<?php

return array(
    "mappings" =>
        array(
            370246 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '370246',
                    'name' => '中国工商银行-牡丹运通卡金卡-贷记卡',
                    'type' => '1',
                ),
            370248 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '370248',
                    'name' => '中国工商银行-牡丹运通卡金卡-贷记卡',
                    'type' => '1',
                ),
            370249 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '370249',
                    'name' => '中国工商银行-牡丹运通卡金卡-贷记卡',
                    'type' => '1',
                ),
            427010 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '427010',
                    'name' => '中国工商银行-牡丹VISA卡(单位卡)-贷记卡',
                    'type' => '1',
                ),
            427018 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '427018',
                    'name' => '中国工商银行-牡丹VISA信用卡-贷记卡',
                    'type' => '1',
                ),
            427019 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '427019',
                    'name' => '中国工商银行-牡丹VISA卡(单位卡)-贷记卡',
                    'type' => '1',
                ),
            427020 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '427020',
                    'name' => '中国工商银行-牡丹VISA信用卡-贷记卡',
                    'type' => '1',
                ),
            427029 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '427029',
                    'name' => '中国工商银行-牡丹VISA信用卡-贷记卡',
                    'type' => '1',
                ),
            427030 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '427030',
                    'name' => '中国工商银行-牡丹VISA信用卡-贷记卡',
                    'type' => '1',
                ),
            427039 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '427039',
                    'name' => '中国工商银行-牡丹VISA信用卡-贷记卡',
                    'type' => '1',
                ),
            370247 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '370247',
                    'name' => '中国工商银行-牡丹运通卡普通卡-贷记卡',
                    'type' => '1',
                ),
            438125 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '438125',
                    'name' => '中国工商银行-牡丹VISA信用卡-贷记卡',
                    'type' => '1',
                ),
            438126 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '438126',
                    'name' => '中国工商银行-牡丹VISA白金卡-贷记卡',
                    'type' => '1',
                ),
            451804 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '451804',
                    'name' => '中国工商银行-牡丹贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            451810 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '451810',
                    'name' => '中国工商银行-牡丹贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            451811 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '451811',
                    'name' => '中国工商银行-牡丹贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            45806 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '45806',
                    'name' => '中国工商银行-牡丹信用卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            458071 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '458071',
                    'name' => '中国工商银行-牡丹贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            489734 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '489734',
                    'name' => '中国工商银行-牡丹欧元卡-贷记卡',
                    'type' => '1',
                ),
            489735 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '489735',
                    'name' => '中国工商银行-牡丹欧元卡-贷记卡',
                    'type' => '1',
                ),
            489736 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '489736',
                    'name' => '中国工商银行-牡丹欧元卡-贷记卡',
                    'type' => '1',
                ),
            510529 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '510529',
                    'name' => '中国工商银行-牡丹万事达国际借记卡-贷记卡',
                    'type' => '1',
                ),
            427062 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '427062',
                    'name' => '中国工商银行-牡丹VISA信用卡-贷记卡',
                    'type' => '1',
                ),
            524091 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '524091',
                    'name' => '中国工商银行-海航信用卡-贷记卡',
                    'type' => '1',
                ),
            427064 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '427064',
                    'name' => '中国工商银行-牡丹VISA信用卡-贷记卡',
                    'type' => '1',
                ),
            530970 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '530970',
                    'name' => '中国工商银行-牡丹万事达信用卡-贷记卡',
                    'type' => '1',
                ),
            53098 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '53098',
                    'name' => '中国工商银行-牡丹信用卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            530990 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '530990',
                    'name' => '中国工商银行-牡丹万事达信用卡-贷记卡',
                    'type' => '1',
                ),
            558360 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '558360',
                    'name' => '中国工商银行-牡丹万事达信用卡-贷记卡',
                    'type' => '1',
                ),
            620200 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620200',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620302 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620302',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620402 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620402',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620403 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620403',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620404 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620404',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            524047 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '524047',
                    'name' => '中国工商银行-牡丹万事达白金卡-贷记卡',
                    'type' => '1',
                ),
            620406 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620406',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620407 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620407',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            525498 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '525498',
                    'name' => '中国工商银行-海航信用卡个人普卡-贷记卡',
                    'type' => '1',
                ),
            620409 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620409',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620410 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620410',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620411 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620411',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620412 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620412',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620502 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620502',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620503 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620503',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620405 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620405',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620408 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620408',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620512 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620512',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620602 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620602',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620604 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620604',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620607 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620607',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620611 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620611',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620612 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620612',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620704 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620704',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620706 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620706',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620707 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620707',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620708 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620708',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620709 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620709',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620710 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620710',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620609 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620609',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620712 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620712',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620713 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620713',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620714 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620714',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620802 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620802',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620711 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620711',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620904 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620904',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620905 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620905',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621001 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621001',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            620902 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620902',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621103 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621103',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621105 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621105',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621106 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621106',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621107 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621107',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621102 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621102',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621203 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621203',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621204 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621204',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621205 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621205',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621206 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621206',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621207 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621207',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621208 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621208',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621209 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621209',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621210 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621210',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621302 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621302',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621303 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621303',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621202 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621202',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621305 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621305',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621306 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621306',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621307 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621307',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621309 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621309',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621311 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621311',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621313 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621313',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621211 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621211',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621315 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621315',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621304 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621304',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621402 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621402',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621404 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621404',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621405 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621405',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621406 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621406',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621407 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621407',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621408 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621408',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621409 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621409',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621410 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621410',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621502 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621502',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621317 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621317',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621511 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621511',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621602 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621602',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621603 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621603',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621604 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621604',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621605 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621605',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621608 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621608',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621609 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621609',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621610 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621610',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621611 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621611',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621612 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621612',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621613 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621613',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621614 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621614',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621615 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621615',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621616 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621616',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621617 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621617',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621607 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621607',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621606 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621606',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621804 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621804',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621807 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621807',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621813 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621813',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621814 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621814',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621817 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621817',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621901 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621901',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621904 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621904',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621905 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621905',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621906 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621906',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621907 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621907',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621908 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621908',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621909 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621909',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621910 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621910',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621911 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621911',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621912 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621912',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621913 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621913',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621915 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621915',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622002 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622002',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621903 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621903',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622004 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622004',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622005 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622005',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622006 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622006',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622007 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622007',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622008 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622008',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622010 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622010',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622011 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622011',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622012 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622012',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            621914 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621914',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622015 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622015',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622016 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622016',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622003 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622003',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622018 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622018',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622019 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622019',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622020 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622020',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622102 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622102',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622103 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622103',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622104 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622104',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622105 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622105',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622013 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622013',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622111 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622111',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622114 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622114',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622200 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622200',
                    'name' => '中国工商银行-灵通卡-借记卡',
                    'type' => '2',
                ),
            622017 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622017',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622202 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622202',
                    'name' => '中国工商银行-E时代卡-借记卡',
                    'type' => '2',
                ),
            622203 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622203',
                    'name' => '中国工商银行-E时代卡-借记卡',
                    'type' => '2',
                ),
            622208 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622208',
                    'name' => '中国工商银行-理财金卡-借记卡',
                    'type' => '2',
                ),
            622210 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622210',
                    'name' => '中国工商银行-准贷记卡(个普)-准贷记卡',
                    'type' => '1',
                ),
            622211 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622211',
                    'name' => '中国工商银行-准贷记卡(个普)-准贷记卡',
                    'type' => '1',
                ),
            622212 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622212',
                    'name' => '中国工商银行-准贷记卡(个普)-准贷记卡',
                    'type' => '1',
                ),
            622213 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622213',
                    'name' => '中国工商银行-准贷记卡(个普)-准贷记卡',
                    'type' => '1',
                ),
            622214 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622214',
                    'name' => '中国工商银行-准贷记卡(个普)-准贷记卡',
                    'type' => '1',
                ),
            622110 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622110',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622220 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622220',
                    'name' => '中国工商银行-准贷记卡(商普)-准贷记卡',
                    'type' => '1',
                ),
            622223 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622223',
                    'name' => '中国工商银行-牡丹卡(商务卡)-准贷记卡',
                    'type' => '1',
                ),
            622225 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622225',
                    'name' => '中国工商银行-准贷记卡(商金)-准贷记卡',
                    'type' => '1',
                ),
            622229 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622229',
                    'name' => '中国工商银行-牡丹卡(商务卡)-准贷记卡',
                    'type' => '1',
                ),
            622230 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622230',
                    'name' => '中国工商银行-贷记卡(个普)-贷记卡',
                    'type' => '1',
                ),
            622231 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622231',
                    'name' => '中国工商银行-牡丹卡(个人卡)-贷记卡',
                    'type' => '1',
                ),
            622232 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622232',
                    'name' => '中国工商银行-牡丹卡(个人卡)-贷记卡',
                    'type' => '1',
                ),
            622233 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622233',
                    'name' => '中国工商银行-牡丹卡(个人卡)-贷记卡',
                    'type' => '1',
                ),
            622234 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622234',
                    'name' => '中国工商银行-牡丹卡(个人卡)-贷记卡',
                    'type' => '1',
                ),
            622235 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622235',
                    'name' => '中国工商银行-贷记卡(个金)-贷记卡',
                    'type' => '1',
                ),
            622237 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622237',
                    'name' => '中国工商银行-牡丹交通卡-贷记卡',
                    'type' => '1',
                ),
            622215 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622215',
                    'name' => '中国工商银行-准贷记卡(个金)-准贷记卡',
                    'type' => '1',
                ),
            622239 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622239',
                    'name' => '中国工商银行-牡丹交通卡-贷记卡',
                    'type' => '1',
                ),
            622240 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622240',
                    'name' => '中国工商银行-贷记卡(商普)-贷记卡',
                    'type' => '1',
                ),
            622245 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622245',
                    'name' => '中国工商银行-贷记卡(商金)-贷记卡',
                    'type' => '1',
                ),
            622224 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622224',
                    'name' => '中国工商银行-牡丹卡(商务卡)-准贷记卡',
                    'type' => '1',
                ),
            622303 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622303',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622304 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622304',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622305 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622305',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622306 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622306',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622307 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622307',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622308 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622308',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622309 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622309',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622238 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622238',
                    'name' => '中国工商银行-牡丹交通卡-贷记卡',
                    'type' => '1',
                ),
            622314 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622314',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622315 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622315',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622317 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622317',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622302 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622302',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622402 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622402',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622403 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622403',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622404 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622404',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622313 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622313',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622504 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622504',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622505 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622505',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622509 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622509',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622513 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622513',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622517 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622517',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622502 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622502',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622604 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622604',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622605 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622605',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622606 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622606',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622510 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622510',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622703 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622703',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622715 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622715',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622806 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622806',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622902 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622902',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622903 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622903',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622706 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622706',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            623002 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '623002',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            623006 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '623006',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            623008 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '623008',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            623011 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '623011',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            623012 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '623012',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            622904 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622904',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            623015 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '623015',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            623100 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '623100',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            623202 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '623202',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            623301 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '623301',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            623400 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '623400',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            623500 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '623500',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            623602 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '623602',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            623803 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '623803',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            623901 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '623901',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            623014 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '623014',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            624100 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '624100',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            624200 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '624200',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            624301 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '624301',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            624402 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '624402',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            62451804 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '62451804',
                    'name' => '中国工商银行-牡丹贷记卡-贷记卡',
                    'type' => '1',
                ),
            62451810 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '62451810',
                    'name' => '中国工商银行-牡丹贷记卡-贷记卡',
                    'type' => '1',
                ),
            62451811 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '62451811',
                    'name' => '中国工商银行-牡丹贷记卡-贷记卡',
                    'type' => '1',
                ),
            6245806 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '6245806',
                    'name' => '中国工商银行-牡丹信用卡-贷记卡',
                    'type' => '1',
                ),
            62458071 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '62458071',
                    'name' => '中国工商银行-牡丹贷记卡-贷记卡',
                    'type' => '1',
                ),
            6253098 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '6253098',
                    'name' => '中国工商银行-牡丹信用卡-贷记卡',
                    'type' => '1',
                ),
            623700 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '623700',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            628288 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '628288',
                    'name' => '中国工商银行-中央预算单位公务卡-贷记卡',
                    'type' => '1',
                ),
            624000 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '624000',
                    'name' => '中国工商银行-牡丹灵通卡-借记卡',
                    'type' => '2',
                ),
            9558 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '9558',
                    'name' => '中国工商银行-牡丹灵通卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            628286 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '628286',
                    'name' => '中国工商银行-财政预算单位公务卡-贷记卡',
                    'type' => '1',
                ),
            622206 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622206',
                    'name' => '中国工商银行-牡丹卡白金卡-贷记卡',
                    'type' => '1',
                ),
            621225 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621225',
                    'name' => '中国工商银行-牡丹卡普卡-借记卡',
                    'type' => '2',
                ),
            526836 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '526836',
                    'name' => '中国工商银行-国航知音牡丹信用卡-贷记卡',
                    'type' => '1',
                ),
            513685 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '513685',
                    'name' => '中国工商银行-国航知音牡丹信用卡-贷记卡',
                    'type' => '1',
                ),
            543098 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '543098',
                    'name' => '中国工商银行-国航知音牡丹信用卡-贷记卡',
                    'type' => '1',
                ),
            458441 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '458441',
                    'name' => '中国工商银行-国航知音牡丹信用卡-贷记卡',
                    'type' => '1',
                ),
            620058 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620058',
                    'name' => '中国工商银行-银联标准卡-借记卡',
                    'type' => '2',
                ),
            621281 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621281',
                    'name' => '中国工商银行-中职学生资助卡-借记卡',
                    'type' => '2',
                ),
            622246 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622246',
                    'name' => '中国工商银行-专用信用消费卡-贷记卡',
                    'type' => '1',
                ),
            900000 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '900000',
                    'name' => '中国工商银行-牡丹社会保障卡-借记卡',
                    'type' => '2',
                ),
            544210 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '544210',
                    'name' => '中国工商银行-牡丹东航联名卡-贷记卡',
                    'type' => '1',
                ),
            548943 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '548943',
                    'name' => '中国工商银行-牡丹东航联名卡-贷记卡',
                    'type' => '1',
                ),
            370267 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '370267',
                    'name' => '中国工商银行-牡丹运通白金卡-贷记卡',
                    'type' => '1',
                ),
            621558 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621558',
                    'name' => '中国工商银行-福农灵通卡-借记卡',
                    'type' => '2',
                ),
            621559 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621559',
                    'name' => '中国工商银行-福农灵通卡-借记卡',
                    'type' => '2',
                ),
            621722 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621722',
                    'name' => '中国工商银行-灵通卡-借记卡',
                    'type' => '2',
                ),
            621723 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621723',
                    'name' => '中国工商银行-灵通卡-借记卡',
                    'type' => '2',
                ),
            620086 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620086',
                    'name' => '中国工商银行-中国旅行卡-借记卡',
                    'type' => '2',
                ),
            621226 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621226',
                    'name' => '中国工商银行-牡丹卡普卡-借记卡',
                    'type' => '2',
                ),
            402791 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '402791',
                    'name' => '中国工商银行-国际借记卡-借记卡',
                    'type' => '2',
                ),
            427028 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '427028',
                    'name' => '中国工商银行-国际借记卡-借记卡',
                    'type' => '2',
                ),
            427038 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '427038',
                    'name' => '中国工商银行-国际借记卡-借记卡',
                    'type' => '2',
                ),
            548259 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '548259',
                    'name' => '中国工商银行-国际借记卡-借记卡',
                    'type' => '2',
                ),
            356879 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '356879',
                    'name' => '中国工商银行-牡丹JCB信用卡-贷记卡',
                    'type' => '1',
                ),
            356880 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '356880',
                    'name' => '中国工商银行-牡丹JCB信用卡-贷记卡',
                    'type' => '1',
                ),
            356881 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '356881',
                    'name' => '中国工商银行-牡丹JCB信用卡-贷记卡',
                    'type' => '1',
                ),
            356882 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '356882',
                    'name' => '中国工商银行-牡丹JCB信用卡-贷记卡',
                    'type' => '1',
                ),
            528856 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '528856',
                    'name' => '中国工商银行-牡丹多币种卡-贷记卡',
                    'type' => '1',
                ),
            621618 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621618',
                    'name' => '中国工商银行-武警军人保障卡-借记卡',
                    'type' => '2',
                ),
            620516 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620516',
                    'name' => '中国工商银行-预付芯片卡-借记卡',
                    'type' => '2',
                ),
            621227 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621227',
                    'name' => '中国工商银行-理财金账户金卡-借记卡',
                    'type' => '2',
                ),
            621721 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621721',
                    'name' => '中国工商银行-灵通卡-借记卡',
                    'type' => '2',
                ),
            900010 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '900010',
                    'name' => '中国工商银行-牡丹宁波市民卡-借记卡',
                    'type' => '2',
                ),
            625330 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625330',
                    'name' => '中国工商银行-中国旅游卡-贷记卡',
                    'type' => '1',
                ),
            625331 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625331',
                    'name' => '中国工商银行-中国旅游卡-贷记卡',
                    'type' => '1',
                ),
            625332 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625332',
                    'name' => '中国工商银行-中国旅游卡-贷记卡',
                    'type' => '1',
                ),
            623062 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '623062',
                    'name' => '中国工商银行-借记卡-借记卡',
                    'type' => '2',
                ),
            622236 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622236',
                    'name' => '中国工商银行-借贷合一卡-贷记卡',
                    'type' => '1',
                ),
            621670 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621670',
                    'name' => '中国工商银行-普通高中学生资助卡-借记卡',
                    'type' => '2',
                ),
            524374 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '524374',
                    'name' => '中国工商银行-牡丹多币种卡-贷记卡',
                    'type' => '1',
                ),
            550213 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '550213',
                    'name' => '中国工商银行-牡丹多币种卡-贷记卡',
                    'type' => '1',
                ),
            374738 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '374738',
                    'name' => '中国工商银行-牡丹百夫长信用卡-贷记卡',
                    'type' => '1',
                ),
            374739 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '374739',
                    'name' => '中国工商银行-牡丹百夫长信用卡-贷记卡',
                    'type' => '1',
                ),
            621288 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621288',
                    'name' => '中国工商银行-工银财富卡-借记卡',
                    'type' => '2',
                ),
            625708 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625708',
                    'name' => '中国工商银行-中小商户采购卡-贷记卡',
                    'type' => '1',
                ),
            625709 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625709',
                    'name' => '中国工商银行-中小商户采购卡-贷记卡',
                    'type' => '1',
                ),
            622597 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622597',
                    'name' => '中国工商银行-环球旅行金卡-贷记卡',
                    'type' => '1',
                ),
            622599 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622599',
                    'name' => '中国工商银行-环球旅行白金卡-贷记卡',
                    'type' => '1',
                ),
            360883 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '360883',
                    'name' => '中国工商银行-牡丹工银大来卡-贷记卡',
                    'type' => '1',
                ),
            360884 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '360884',
                    'name' => '中国工商银行-牡丹工银大莱卡-贷记卡',
                    'type' => '1',
                ),
            625865 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625865',
                    'name' => '中国工商银行-IC金卡-贷记卡',
                    'type' => '1',
                ),
            625866 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625866',
                    'name' => '中国工商银行-IC白金卡-贷记卡',
                    'type' => '1',
                ),
            625899 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625899',
                    'name' => '中国工商银行-工行IC卡（红卡）-贷记卡',
                    'type' => '1',
                ),
            625929 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625929',
                    'name' => '中国工商银行布鲁塞尔-贷记卡-贷记卡',
                    'type' => '1',
                ),
            621376 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621376',
                    'name' => '中国工商银行布鲁塞尔分行-借记卡-借记卡',
                    'type' => '2',
                ),
            620054 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620054',
                    'name' => '中国工商银行布鲁塞尔分行-预付卡-预付费卡',
                    'type' => '3',
                ),
            620142 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620142',
                    'name' => '中国工商银行布鲁塞尔分行-预付卡-预付费卡',
                    'type' => '3',
                ),
            621423 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621423',
                    'name' => '中国工商银行（巴西）-借记卡-借记卡',
                    'type' => '2',
                ),
            625927 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625927',
                    'name' => '中国工商银行（巴西）-贷记卡-贷记卡',
                    'type' => '1',
                ),
            621428 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621428',
                    'name' => '中国工商银行金边分行-借记卡-借记卡',
                    'type' => '2',
                ),
            625939 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625939',
                    'name' => '中国工商银行金边分行-信用卡-贷记卡',
                    'type' => '1',
                ),
            621434 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621434',
                    'name' => '中国工商银行金边分行-借记卡-借记卡',
                    'type' => '2',
                ),
            625987 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625987',
                    'name' => '中国工商银行金边分行-信用卡-贷记卡',
                    'type' => '1',
                ),
            621761 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621761',
                    'name' => '中国工商银行加拿大分行-借记卡-借记卡',
                    'type' => '2',
                ),
            621749 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621749',
                    'name' => '中国工商银行加拿大分行-借记卡-借记卡',
                    'type' => '2',
                ),
            620184 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620184',
                    'name' => '中国工商银行加拿大分行-预付卡-预付费卡',
                    'type' => '3',
                ),
            625930 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625930',
                    'name' => '中国工商银行加拿大-贷记卡-贷记卡',
                    'type' => '1',
                ),
            621300 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621300',
                    'name' => '中国工商银行巴黎分行-借记卡-借记卡',
                    'type' => '2',
                ),
            621378 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621378',
                    'name' => '中国工商银行巴黎分行-借记卡-借记卡',
                    'type' => '2',
                ),
            625114 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625114',
                    'name' => '中国工商银行巴黎分行-贷记卡-贷记卡',
                    'type' => '1',
                ),
            622159 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622159',
                    'name' => '中国工商银行法兰克福分行-贷记卡-贷记卡',
                    'type' => '1',
                ),
            621720 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621720',
                    'name' => '中国工商银行法兰克福分行-借记卡-借记卡',
                    'type' => '2',
                ),
            625021 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625021',
                    'name' => '中国工商银行法兰克福分行-贷记卡-贷记卡',
                    'type' => '1',
                ),
            625022 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625022',
                    'name' => '中国工商银行法兰克福分行-贷记卡-贷记卡',
                    'type' => '1',
                ),
            625932 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625932',
                    'name' => '中国工商银行法兰克福-贷记卡-贷记卡',
                    'type' => '1',
                ),
            621379 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621379',
                    'name' => '中国工商银行法兰克福分行-借记卡-借记卡',
                    'type' => '2',
                ),
            620114 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620114',
                    'name' => '中国工商银行法兰克福分行-预付卡-预付费卡',
                    'type' => '3',
                ),
            620146 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620146',
                    'name' => '中国工商银行法兰克福分行-预付卡-预付费卡',
                    'type' => '3',
                ),
            622889 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622889',
                    'name' => '中国工商银行(亚洲)有限公司-ICBC(Asia) Credit-贷记卡',
                    'type' => '1',
                ),
            625900 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625900',
                    'name' => '中国工商银行(亚洲)有限公司-ICBC Credit Card-贷记卡',
                    'type' => '1',
                ),
            622949 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622949',
                    'name' => '中国工商银行(亚洲)有限公司-EliteClubATMCard-借记卡',
                    'type' => '2',
                ),
            625915 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625915',
                    'name' => '中国工商银行(亚洲)有限公司-港币信用卡-贷记卡',
                    'type' => '1',
                ),
            625916 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625916',
                    'name' => '中国工商银行(亚洲)有限公司-港币信用卡-贷记卡',
                    'type' => '1',
                ),
            620030 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620030',
                    'name' => '中国工商银行(亚洲)有限公司-工银亚洲预付卡-预付费卡',
                    'type' => '3',
                ),
            620050 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620050',
                    'name' => '中国工商银行(亚洲)有限公司-预付卡-预付费卡',
                    'type' => '3',
                ),
            622944 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622944',
                    'name' => '中国工商银行(亚洲)有限公司-CNYEasylinkCard-借记卡',
                    'type' => '2',
                ),
            625115 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625115',
                    'name' => '中国工商银行(亚洲)有限公司-工银银联公司卡-贷记卡',
                    'type' => '1',
                ),
            620101 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620101',
                    'name' => '中国工商银行(亚洲)有限公司--预付费卡',
                    'type' => '3',
                ),
            623335 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '623335',
                    'name' => '中国工商银行(亚洲)有限公司--预付费卡',
                    'type' => '3',
                ),
            622171 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622171',
                    'name' => '中国工商银行(印尼)-印尼盾复合卡-贷记卡',
                    'type' => '1',
                ),
            621240 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621240',
                    'name' => '中国工商银行(印尼)-借记卡-借记卡',
                    'type' => '2',
                ),
            621724 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621724',
                    'name' => '中国工商银行印尼分行-借记卡-借记卡',
                    'type' => '2',
                ),
            625931 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625931',
                    'name' => '中国工商银行印尼-贷记卡-贷记卡',
                    'type' => '1',
                ),
            621762 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621762',
                    'name' => '中国工商银行（印度尼西亚）-借记卡-借记卡',
                    'type' => '2',
                ),
            625918 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625918',
                    'name' => '中国工商银行印尼分行-信用卡-贷记卡',
                    'type' => '1',
                ),
            625113 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625113',
                    'name' => '中国工商银行米兰-贷记卡-贷记卡',
                    'type' => '1',
                ),
            621371 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621371',
                    'name' => '中国工商银行米兰分行-借记卡-借记卡',
                    'type' => '2',
                ),
            620143 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620143',
                    'name' => '中国工商银行米兰分行-预付卡-预付费卡',
                    'type' => '3',
                ),
            620149 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620149',
                    'name' => '中国工商银行米兰分行-预付卡-预付费卡',
                    'type' => '3',
                ),
            621730 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621730',
                    'name' => '中国工商银行东京分行-工行东京借记卡-借记卡',
                    'type' => '2',
                ),
            625928 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625928',
                    'name' => '中国工商银行阿拉木图-贷记卡-贷记卡',
                    'type' => '1',
                ),
            621414 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621414',
                    'name' => '中国工商银行阿拉木图子行-借记卡-借记卡',
                    'type' => '2',
                ),
            625914 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625914',
                    'name' => '中国工商银行阿拉木图子行-贷记卡-贷记卡',
                    'type' => '1',
                ),
            621375 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621375',
                    'name' => '中国工商银行阿拉木图子行-借记卡-借记卡',
                    'type' => '2',
                ),
            620187 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620187',
                    'name' => '中国工商银行阿拉木图子行-预付卡-预付费卡',
                    'type' => '3',
                ),
            621734 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621734',
                    'name' => '中国工商银行首尔-借记卡-借记卡',
                    'type' => '2',
                ),
            621433 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621433',
                    'name' => '中国工商银行万象分行-借记卡-借记卡',
                    'type' => '2',
                ),
            625986 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625986',
                    'name' => '中国工商银行万象分行-贷记卡-贷记卡',
                    'type' => '1',
                ),
            621370 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621370',
                    'name' => '中国工商银行卢森堡分行-借记卡-借记卡',
                    'type' => '2',
                ),
            625925 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625925',
                    'name' => '中国工商银行卢森堡分行-贷记卡-贷记卡',
                    'type' => '1',
                ),
            622926 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622926',
                    'name' => '中国工商银行澳门分行-E时代卡-借记卡',
                    'type' => '2',
                ),
            622927 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622927',
                    'name' => '中国工商银行澳门分行-E时代卡-借记卡',
                    'type' => '2',
                ),
            622928 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622928',
                    'name' => '中国工商银行澳门分行-E时代卡-借记卡',
                    'type' => '2',
                ),
            622929 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622929',
                    'name' => '中国工商银行澳门分行-理财金账户-借记卡',
                    'type' => '2',
                ),
            622930 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622930',
                    'name' => '中国工商银行澳门分行-理财金账户-借记卡',
                    'type' => '2',
                ),
            622931 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622931',
                    'name' => '中国工商银行澳门分行-理财金账户-借记卡',
                    'type' => '2',
                ),
            621733 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621733',
                    'name' => '中国工商银行（澳门）-借记卡-借记卡',
                    'type' => '2',
                ),
            621732 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621732',
                    'name' => '中国工商银行（澳门）-借记卡-借记卡',
                    'type' => '2',
                ),
            620124 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620124',
                    'name' => '中国工商银行澳门分行-预付卡-预付费卡',
                    'type' => '3',
                ),
            620183 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620183',
                    'name' => '中国工商银行澳门分行-预付卡-预付费卡',
                    'type' => '3',
                ),
            620561 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620561',
                    'name' => '中国工商银行澳门分行-工银闪付预付卡-预付费卡',
                    'type' => '3',
                ),
            625116 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625116',
                    'name' => '中国工商银行澳门分行-工银银联公司卡-贷记卡',
                    'type' => '1',
                ),
            622227 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622227',
                    'name' => '中国工商银行澳门分行-Diamond-贷记卡',
                    'type' => '1',
                ),
            625921 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625921',
                    'name' => '中国工商银行马来西亚-贷记卡-贷记卡',
                    'type' => '1',
                ),
            621764 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621764',
                    'name' => '中国工商银行马来西亚-借记卡-借记卡',
                    'type' => '2',
                ),
            625926 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625926',
                    'name' => '中国工商银行阿姆斯特丹-贷记卡-贷记卡',
                    'type' => '1',
                ),
            621372 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621372',
                    'name' => '中国工商银行阿姆斯特丹-借记卡-借记卡',
                    'type' => '2',
                ),
            623034 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '623034',
                    'name' => '中国工商银行新西兰-借记卡-借记卡',
                    'type' => '2',
                ),
            625110 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625110',
                    'name' => '中国工商银行新西兰-信用卡-贷记卡',
                    'type' => '1',
                ),
            621464 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621464',
                    'name' => '中国工商银行卡拉奇分行-借记卡-借记卡',
                    'type' => '2',
                ),
            625942 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625942',
                    'name' => '中国工商银行卡拉奇分行-贷记卡-贷记卡',
                    'type' => '1',
                ),
            622158 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '622158',
                    'name' => '中国工商银行新加坡分行-贷记卡-贷记卡',
                    'type' => '1',
                ),
            625917 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625917',
                    'name' => '中国工商银行新加坡分行-贷记卡-贷记卡',
                    'type' => '1',
                ),
            621765 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621765',
                    'name' => '中国工商银行新加坡分行-借记卡-借记卡',
                    'type' => '2',
                ),
            620094 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620094',
                    'name' => '中国工商银行新加坡分行-预付卡-预付费卡',
                    'type' => '3',
                ),
            620186 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620186',
                    'name' => '中国工商银行新加坡分行-预付卡-预付费卡',
                    'type' => '3',
                ),
            621719 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621719',
                    'name' => '中国工商银行新加坡分行-借记卡-借记卡',
                    'type' => '2',
                ),
            625922 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625922',
                    'name' => '中国工商银行河内-贷记卡-贷记卡',
                    'type' => '1',
                ),
            621369 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621369',
                    'name' => '中国工商银行河内-借记卡-借记卡',
                    'type' => '2',
                ),
            621763 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621763',
                    'name' => '中国工商银行河内-工银越南盾借记卡-借记卡',
                    'type' => '2',
                ),
            625934 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625934',
                    'name' => '中国工商银行河内-工银越南盾信用卡-贷记卡',
                    'type' => '1',
                ),
            620046 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620046',
                    'name' => '中国工商银行河内-预付卡-预付费卡',
                    'type' => '3',
                ),
            621750 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621750',
                    'name' => '中国工商银行马德里分行-借记卡-借记卡',
                    'type' => '2',
                ),
            625933 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625933',
                    'name' => '中国工商银行马德里-贷记卡-贷记卡',
                    'type' => '1',
                ),
            621377 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621377',
                    'name' => '中国工商银行马德里分行-借记卡-借记卡',
                    'type' => '2',
                ),
            620148 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620148',
                    'name' => '中国工商银行马德里分行-预付卡-预付费卡',
                    'type' => '3',
                ),
            620185 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '620185',
                    'name' => '中国工商银行马德里分行-预付卡-预付费卡',
                    'type' => '3',
                ),
            625920 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625920',
                    'name' => '中国工商银行泰国-贷记卡-贷记卡',
                    'type' => '1',
                ),
            621367 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621367',
                    'name' => '中国工商银行泰国-借记卡-借记卡',
                    'type' => '2',
                ),
            625924 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625924',
                    'name' => '中国工商银行伦敦-贷记卡-贷记卡',
                    'type' => '1',
                ),
            621374 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621374',
                    'name' => '中国工商银行伦敦子行-借记卡-借记卡',
                    'type' => '2',
                ),
            621731 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621731',
                    'name' => '中国工商银行伦敦子行-工银伦敦借记卡-借记卡',
                    'type' => '2',
                ),
            621781 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '621781',
                    'name' => '中国工商银行伦敦子行-借记卡-借记卡',
                    'type' => '2',
                ),
            625017 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625017',
                    'name' => '中国工商银行（澳门）(26470446)-普卡-贷记卡',
                    'type' => '1',
                ),
            625018 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625018',
                    'name' => '中国工商银行（澳门）(26470446)-金卡-贷记卡',
                    'type' => '1',
                ),
            625019 =>
                array(
                    'bank_id' => '5',
                    'card_bin' => '625019',
                    'name' => '中国工商银行（澳门）(26470446)-白金卡-贷记卡',
                    'type' => '1',
                ),
            103 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '103',
                    'name' => '中国农业银行-金穗借记卡-借记卡',
                    'type' => '2',
                ),
            552599 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '552599',
                    'name' => '中国农业银行-金穗贷记卡-贷记卡',
                    'type' => '1',
                ),
            6349102 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '6349102',
                    'name' => '中国农业银行-金穗信用卡-准贷记卡',
                    'type' => '1',
                ),
            6353591 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '6353591',
                    'name' => '中国农业银行-金穗信用卡-准贷记卡',
                    'type' => '1',
                ),
            623206 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '623206',
                    'name' => '中国农业银行-中国旅游卡-借记卡',
                    'type' => '2',
                ),
            621671 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '621671',
                    'name' => '中国农业银行-普通高中学生资助卡-借记卡',
                    'type' => '2',
                ),
            620059 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '620059',
                    'name' => '中国农业银行-银联标准卡-借记卡',
                    'type' => '2',
                ),
            403361 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '403361',
                    'name' => '中国农业银行-金穗贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            404117 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '404117',
                    'name' => '中国农业银行-金穗贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            404118 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '404118',
                    'name' => '中国农业银行-金穗贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            404119 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '404119',
                    'name' => '中国农业银行-金穗贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            404120 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '404120',
                    'name' => '中国农业银行-金穗贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            404121 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '404121',
                    'name' => '中国农业银行-金穗贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            463758 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '463758',
                    'name' => '中国农业银行-VISA白金卡-贷记卡',
                    'type' => '1',
                ),
            49102 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '49102',
                    'name' => '中国农业银行-金穗信用卡(银联卡)-准贷记卡',
                    'type' => '1',
                ),
            514027 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '514027',
                    'name' => '中国农业银行-万事达白金卡-贷记卡',
                    'type' => '1',
                ),
            519412 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '519412',
                    'name' => '中国农业银行-金穗贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            519413 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '519413',
                    'name' => '中国农业银行-金穗贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            520082 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '520082',
                    'name' => '中国农业银行-金穗贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            520083 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '520083',
                    'name' => '中国农业银行-金穗贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            53591 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '53591',
                    'name' => '中国农业银行-金穗信用卡(银联卡)-准贷记卡',
                    'type' => '1',
                ),
            558730 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '558730',
                    'name' => '中国农业银行-金穗贷记卡-贷记卡',
                    'type' => '1',
                ),
            621282 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '621282',
                    'name' => '中国农业银行-中职学生资助卡-借记卡',
                    'type' => '2',
                ),
            621336 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '621336',
                    'name' => '中国农业银行-专用惠农卡-借记卡',
                    'type' => '2',
                ),
            621619 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '621619',
                    'name' => '中国农业银行-武警军人保障卡-借记卡',
                    'type' => '2',
                ),
            622821 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '622821',
                    'name' => '中国农业银行-金穗校园卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622822 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '622822',
                    'name' => '中国农业银行-金穗星座卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622823 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '622823',
                    'name' => '中国农业银行-金穗社保卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622824 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '622824',
                    'name' => '中国农业银行-金穗旅游卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622825 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '622825',
                    'name' => '中国农业银行-金穗青年卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622826 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '622826',
                    'name' => '中国农业银行-复合介质金穗通宝卡-借记卡',
                    'type' => '2',
                ),
            622827 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '622827',
                    'name' => '中国农业银行-金穗海通卡-借记卡',
                    'type' => '2',
                ),
            622828 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '622828',
                    'name' => '中国农业银行-退役金卡-借记卡',
                    'type' => '2',
                ),
            622836 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '622836',
                    'name' => '中国农业银行-金穗贷记卡-贷记卡',
                    'type' => '1',
                ),
            622837 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '622837',
                    'name' => '中国农业银行-金穗贷记卡-贷记卡',
                    'type' => '1',
                ),
            622840 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '622840',
                    'name' => '中国农业银行-金穗通宝卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622841 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '622841',
                    'name' => '中国农业银行-金穗惠农卡-借记卡',
                    'type' => '2',
                ),
            622843 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '622843',
                    'name' => '中国农业银行-金穗通宝银卡-借记卡',
                    'type' => '2',
                ),
            622844 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '622844',
                    'name' => '中国农业银行-金穗通宝卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622845 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '622845',
                    'name' => '中国农业银行-金穗通宝卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622846 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '622846',
                    'name' => '中国农业银行-金穗通宝卡-借记卡',
                    'type' => '2',
                ),
            622847 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '622847',
                    'name' => '中国农业银行-金穗通宝卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622848 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '622848',
                    'name' => '中国农业银行-金穗通宝卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622849 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '622849',
                    'name' => '中国农业银行-金穗通宝钻石卡-借记卡',
                    'type' => '2',
                ),
            623018 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '623018',
                    'name' => '中国农业银行-掌尚钱包-借记卡',
                    'type' => '2',
                ),
            625996 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '625996',
                    'name' => '中国农业银行-银联IC卡金卡-贷记卡',
                    'type' => '1',
                ),
            625997 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '625997',
                    'name' => '中国农业银行-银联预算单位公务卡金卡-贷记卡',
                    'type' => '1',
                ),
            625998 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '625998',
                    'name' => '中国农业银行-银联IC卡白金卡-贷记卡',
                    'type' => '1',
                ),
            628268 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '628268',
                    'name' => '中国农业银行-金穗公务卡-贷记卡',
                    'type' => '1',
                ),
            95595 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '95595',
                    'name' => '中国农业银行-借记卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            95596 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '95596',
                    'name' => '中国农业银行-借记卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            95597 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '95597',
                    'name' => '中国农业银行-借记卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            95598 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '95598',
                    'name' => '中国农业银行-借记卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            95599 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '95599',
                    'name' => '中国农业银行-借记卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            625826 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '625826',
                    'name' => '中国农业银行贷记卡-IC普卡-贷记卡',
                    'type' => '1',
                ),
            625827 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '625827',
                    'name' => '中国农业银行贷记卡-IC金卡-贷记卡',
                    'type' => '1',
                ),
            548478 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '548478',
                    'name' => '中国农业银行贷记卡-澳元卡-贷记卡',
                    'type' => '1',
                ),
            544243 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '544243',
                    'name' => '中国农业银行贷记卡-欧元卡-贷记卡',
                    'type' => '1',
                ),
            622820 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '622820',
                    'name' => '中国农业银行贷记卡-金穗通商卡-准贷记卡',
                    'type' => '1',
                ),
            622830 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '622830',
                    'name' => '中国农业银行贷记卡-金穗通商卡-准贷记卡',
                    'type' => '1',
                ),
            622838 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '622838',
                    'name' => '中国农业银行贷记卡-银联白金卡-贷记卡',
                    'type' => '1',
                ),
            625336 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '625336',
                    'name' => '中国农业银行贷记卡-中国旅游卡-贷记卡',
                    'type' => '1',
                ),
            628269 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '628269',
                    'name' => '中国农业银行贷记卡-银联IC公务卡-贷记卡',
                    'type' => '1',
                ),
            620501 =>
                array(
                    'bank_id' => '6',
                    'card_bin' => '620501',
                    'name' => '宁波市中国农业银行-市民卡B卡-借记卡',
                    'type' => '2',
                ),
            621660 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621660',
                    'name' => '中国银行-联名卡-借记卡',
                    'type' => '2',
                ),
            621661 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621661',
                    'name' => '中国银行-个人普卡-借记卡',
                    'type' => '2',
                ),
            621662 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621662',
                    'name' => '中国银行-个人金卡-借记卡',
                    'type' => '2',
                ),
            621663 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621663',
                    'name' => '中国银行-员工普卡-借记卡',
                    'type' => '2',
                ),
            621665 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621665',
                    'name' => '中国银行-员工金卡-借记卡',
                    'type' => '2',
                ),
            621667 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621667',
                    'name' => '中国银行-理财普卡-借记卡',
                    'type' => '2',
                ),
            621668 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621668',
                    'name' => '中国银行-理财金卡-借记卡',
                    'type' => '2',
                ),
            621669 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621669',
                    'name' => '中国银行-理财银卡-借记卡',
                    'type' => '2',
                ),
            621666 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621666',
                    'name' => '中国银行-理财白金卡-借记卡',
                    'type' => '2',
                ),
            625908 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '625908',
                    'name' => '中国银行-中行金融IC卡白金卡-贷记卡',
                    'type' => '1',
                ),
            625910 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '625910',
                    'name' => '中国银行-中行金融IC卡普卡-贷记卡',
                    'type' => '1',
                ),
            625909 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '625909',
                    'name' => '中国银行-中行金融IC卡金卡-贷记卡',
                    'type' => '1',
                ),
            356833 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '356833',
                    'name' => '中国银行-中银JCB卡金卡-贷记卡',
                    'type' => '1',
                ),
            356835 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '356835',
                    'name' => '中国银行-中银JCB卡普卡-贷记卡',
                    'type' => '1',
                ),
            409665 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '409665',
                    'name' => '中国银行-员工普卡-贷记卡',
                    'type' => '1',
                ),
            409666 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '409666',
                    'name' => '中国银行-个人普卡-贷记卡',
                    'type' => '1',
                ),
            409668 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '409668',
                    'name' => '中国银行-中银威士信用卡员-贷记卡',
                    'type' => '1',
                ),
            409669 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '409669',
                    'name' => '中国银行-中银威士信用卡员-贷记卡',
                    'type' => '1',
                ),
            409670 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '409670',
                    'name' => '中国银行-个人白金卡-贷记卡',
                    'type' => '1',
                ),
            409671 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '409671',
                    'name' => '中国银行-中银威士信用卡-贷记卡',
                    'type' => '1',
                ),
            409672 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '409672',
                    'name' => '中国银行-长城公务卡-贷记卡',
                    'type' => '1',
                ),
            456351 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '456351',
                    'name' => '中国银行-长城电子借记卡-借记卡',
                    'type' => '2',
                ),
            512315 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '512315',
                    'name' => '中国银行-中银万事达信用卡-贷记卡',
                    'type' => '1',
                ),
            512316 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '512316',
                    'name' => '中国银行-中银万事达信用卡-贷记卡',
                    'type' => '1',
                ),
            512411 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '512411',
                    'name' => '中国银行-中银万事达信用卡-贷记卡',
                    'type' => '1',
                ),
            512412 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '512412',
                    'name' => '中国银行-中银万事达信用卡-贷记卡',
                    'type' => '1',
                ),
            514957 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '514957',
                    'name' => '中国银行-中银万事达信用卡-贷记卡',
                    'type' => '1',
                ),
            409667 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '409667',
                    'name' => '中国银行-中银威士信用卡员-贷记卡',
                    'type' => '1',
                ),
            518378 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '518378',
                    'name' => '中国银行-长城万事达信用卡-准贷记卡',
                    'type' => '1',
                ),
            518379 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '518379',
                    'name' => '中国银行-长城万事达信用卡-准贷记卡',
                    'type' => '1',
                ),
            518474 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '518474',
                    'name' => '中国银行-长城万事达信用卡-准贷记卡',
                    'type' => '1',
                ),
            518475 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '518475',
                    'name' => '中国银行-长城万事达信用卡-准贷记卡',
                    'type' => '1',
                ),
            518476 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '518476',
                    'name' => '中国银行-长城万事达信用卡-准贷记卡',
                    'type' => '1',
                ),
            438088 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '438088',
                    'name' => '中国银行-中银奥运信用卡-贷记卡',
                    'type' => '1',
                ),
            524865 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '524865',
                    'name' => '中国银行-长城信用卡-准贷记卡',
                    'type' => '1',
                ),
            525745 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '525745',
                    'name' => '中国银行-长城信用卡-准贷记卡',
                    'type' => '1',
                ),
            525746 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '525746',
                    'name' => '中国银行-长城信用卡-准贷记卡',
                    'type' => '1',
                ),
            547766 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '547766',
                    'name' => '中国银行-长城万事达信用卡-准贷记卡',
                    'type' => '1',
                ),
            552742 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '552742',
                    'name' => '中国银行-长城公务卡-贷记卡',
                    'type' => '1',
                ),
            553131 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '553131',
                    'name' => '中国银行-长城公务卡-贷记卡',
                    'type' => '1',
                ),
            558868 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '558868',
                    'name' => '中国银行-中银万事达信用卡-准贷记卡',
                    'type' => '1',
                ),
            514958 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '514958',
                    'name' => '中国银行-中银万事达信用卡-贷记卡',
                    'type' => '1',
                ),
            622752 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622752',
                    'name' => '中国银行-长城人民币信用卡-准贷记卡',
                    'type' => '1',
                ),
            622753 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622753',
                    'name' => '中国银行-长城人民币信用卡-准贷记卡',
                    'type' => '1',
                ),
            622755 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622755',
                    'name' => '中国银行-长城人民币信用卡-准贷记卡',
                    'type' => '1',
                ),
            524864 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '524864',
                    'name' => '中国银行-长城信用卡-准贷记卡',
                    'type' => '1',
                ),
            622757 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622757',
                    'name' => '中国银行-长城人民币信用卡-准贷记卡',
                    'type' => '1',
                ),
            622758 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622758',
                    'name' => '中国银行-长城人民币信用卡-准贷记卡',
                    'type' => '1',
                ),
            622759 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622759',
                    'name' => '中国银行-长城信用卡-准贷记卡',
                    'type' => '1',
                ),
            622760 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622760',
                    'name' => '中国银行-银联单币贷记卡-贷记卡',
                    'type' => '1',
                ),
            622761 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622761',
                    'name' => '中国银行-长城信用卡-准贷记卡',
                    'type' => '1',
                ),
            622762 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622762',
                    'name' => '中国银行-长城信用卡-准贷记卡',
                    'type' => '1',
                ),
            622763 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622763',
                    'name' => '中国银行-长城信用卡-准贷记卡',
                    'type' => '1',
                ),
            601382 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '601382',
                    'name' => '中国银行-长城电子借记卡-借记卡',
                    'type' => '2',
                ),
            622756 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622756',
                    'name' => '中国银行-长城人民币信用卡-准贷记卡',
                    'type' => '1',
                ),
            628388 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '628388',
                    'name' => '中国银行-银联标准公务卡-贷记卡',
                    'type' => '1',
                ),
            621256 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621256',
                    'name' => '中国银行-一卡双账户普卡-借记卡',
                    'type' => '2',
                ),
            621212 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621212',
                    'name' => '中国银行-财互通卡-借记卡',
                    'type' => '2',
                ),
            620514 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '620514',
                    'name' => '中国银行-电子现金卡-预付费卡',
                    'type' => '3',
                ),
            622754 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622754',
                    'name' => '中国银行-长城人民币信用卡-准贷记卡',
                    'type' => '1',
                ),
            622764 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622764',
                    'name' => '中国银行-长城单位信用卡普卡-准贷记卡',
                    'type' => '1',
                ),
            518377 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '518377',
                    'name' => '中国银行-中银女性主题信用卡-贷记卡',
                    'type' => '1',
                ),
            622765 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622765',
                    'name' => '中国银行-长城单位信用卡金卡-准贷记卡',
                    'type' => '1',
                ),
            622788 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622788',
                    'name' => '中国银行-白金卡-贷记卡',
                    'type' => '1',
                ),
            621283 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621283',
                    'name' => '中国银行-中职学生资助卡-借记卡',
                    'type' => '2',
                ),
            620061 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '620061',
                    'name' => '中国银行-银联标准卡-借记卡',
                    'type' => '2',
                ),
            621725 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621725',
                    'name' => '中国银行-金融IC卡-借记卡',
                    'type' => '2',
                ),
            620040 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '620040',
                    'name' => '中国银行-长城社会保障卡-预付费卡',
                    'type' => '3',
                ),
            558869 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '558869',
                    'name' => '中国银行-世界卡-准贷记卡',
                    'type' => '1',
                ),
            621330 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621330',
                    'name' => '中国银行-社保联名卡-借记卡',
                    'type' => '2',
                ),
            621331 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621331',
                    'name' => '中国银行-社保联名卡-借记卡',
                    'type' => '2',
                ),
            621332 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621332',
                    'name' => '中国银行-医保联名卡-借记卡',
                    'type' => '2',
                ),
            621333 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621333',
                    'name' => '中国银行-医保联名卡-借记卡',
                    'type' => '2',
                ),
            621297 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621297',
                    'name' => '中国银行-公司借记卡-借记卡',
                    'type' => '2',
                ),
            377677 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '377677',
                    'name' => '中国银行-银联美运顶级卡-准贷记卡',
                    'type' => '1',
                ),
            621568 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621568',
                    'name' => '中国银行-长城福农借记卡金卡-借记卡',
                    'type' => '2',
                ),
            621569 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621569',
                    'name' => '中国银行-长城福农借记卡普卡-借记卡',
                    'type' => '2',
                ),
            625905 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '625905',
                    'name' => '中国银行-中行金融IC卡普卡-准贷记卡',
                    'type' => '1',
                ),
            625906 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '625906',
                    'name' => '中国银行-中行金融IC卡金卡-准贷记卡',
                    'type' => '1',
                ),
            625907 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '625907',
                    'name' => '中国银行-中行金融IC卡白金卡-准贷记卡',
                    'type' => '1',
                ),
            628313 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '628313',
                    'name' => '中国银行-长城银联公务IC卡白金卡-贷记卡',
                    'type' => '1',
                ),
            625333 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '625333',
                    'name' => '中国银行-中银旅游信用卡-准贷记卡',
                    'type' => '1',
                ),
            628312 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '628312',
                    'name' => '中国银行-长城银联公务IC卡金卡-贷记卡',
                    'type' => '1',
                ),
            623208 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '623208',
                    'name' => '中国银行-中国旅游卡-借记卡',
                    'type' => '2',
                ),
            621620 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621620',
                    'name' => '中国银行-武警军人保障卡-借记卡',
                    'type' => '2',
                ),
            621756 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621756',
                    'name' => '中国银行-社保联名借记IC卡-借记卡',
                    'type' => '2',
                ),
            621757 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621757',
                    'name' => '中国银行-社保联名借记IC卡-借记卡',
                    'type' => '2',
                ),
            621758 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621758',
                    'name' => '中国银行-医保联名借记IC卡-借记卡',
                    'type' => '2',
                ),
            621759 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621759',
                    'name' => '中国银行-医保联名借记IC卡-借记卡',
                    'type' => '2',
                ),
            621785 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621785',
                    'name' => '中国银行-借记IC个人普卡-借记卡',
                    'type' => '2',
                ),
            621786 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621786',
                    'name' => '中国银行-借记IC个人金卡-借记卡',
                    'type' => '2',
                ),
            621787 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621787',
                    'name' => '中国银行-借记IC个人普卡-借记卡',
                    'type' => '2',
                ),
            621788 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621788',
                    'name' => '中国银行-借记IC白金卡-借记卡',
                    'type' => '2',
                ),
            621789 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621789',
                    'name' => '中国银行-借记IC钻石卡-借记卡',
                    'type' => '2',
                ),
            621790 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621790',
                    'name' => '中国银行-借记IC联名卡-借记卡',
                    'type' => '2',
                ),
            621672 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621672',
                    'name' => '中国银行-普通高中学生资助卡-借记卡',
                    'type' => '2',
                ),
            625337 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '625337',
                    'name' => '中国银行-长城环球通港澳台旅游金卡-准贷记卡',
                    'type' => '1',
                ),
            625338 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '625338',
                    'name' => '中国银行-长城环球通港澳台旅游白金卡-准贷记卡',
                    'type' => '1',
                ),
            625568 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '625568',
                    'name' => '中国银行-中银福农信用卡-准贷记卡',
                    'type' => '1',
                ),
            620025 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '620025',
                    'name' => '中国银行（澳大利亚）-预付卡-预付费卡',
                    'type' => '3',
                ),
            620026 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '620026',
                    'name' => '中国银行（澳大利亚）-预付卡-预付费卡',
                    'type' => '3',
                ),
            621293 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621293',
                    'name' => '中国银行（澳大利亚）-借记卡-借记卡',
                    'type' => '2',
                ),
            621294 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621294',
                    'name' => '中国银行（澳大利亚）-借记卡-借记卡',
                    'type' => '2',
                ),
            621342 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621342',
                    'name' => '中国银行（澳大利亚）-借记卡-借记卡',
                    'type' => '2',
                ),
            621343 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621343',
                    'name' => '中国银行（澳大利亚）-借记卡-借记卡',
                    'type' => '2',
                ),
            621364 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621364',
                    'name' => '中国银行（澳大利亚）-借记卡-借记卡',
                    'type' => '2',
                ),
            621394 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621394',
                    'name' => '中国银行（澳大利亚）-借记卡-借记卡',
                    'type' => '2',
                ),
            621648 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621648',
                    'name' => '中国银行金边分行-借记卡-借记卡',
                    'type' => '2',
                ),
            621248 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621248',
                    'name' => '中国银行雅加达分行-借记卡-借记卡',
                    'type' => '2',
                ),
            621215 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621215',
                    'name' => '中国银行东京分行-借记卡普卡-借记卡',
                    'type' => '2',
                ),
            621249 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621249',
                    'name' => '中国银行首尔分行-借记卡-借记卡',
                    'type' => '2',
                ),
            622750 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622750',
                    'name' => '中国银行澳门分行-人民币信用卡-贷记卡',
                    'type' => '1',
                ),
            622751 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622751',
                    'name' => '中国银行澳门分行-人民币信用卡-贷记卡',
                    'type' => '1',
                ),
            622771 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622771',
                    'name' => '中国银行澳门分行-中银卡-借记卡',
                    'type' => '2',
                ),
            622772 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622772',
                    'name' => '中国银行澳门分行-中银卡-借记卡',
                    'type' => '2',
                ),
            622770 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622770',
                    'name' => '中国银行澳门分行-中银卡-借记卡',
                    'type' => '2',
                ),
            625145 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '625145',
                    'name' => '中国银行澳门分行-中银银联双币商务卡-贷记卡',
                    'type' => '1',
                ),
            620531 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '620531',
                    'name' => '中国银行澳门分行-预付卡-预付费卡',
                    'type' => '3',
                ),
            620210 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '620210',
                    'name' => '中国银行澳门分行-澳门中国银行银联预付卡-预付费卡',
                    'type' => '3',
                ),
            620211 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '620211',
                    'name' => '中国银行澳门分行-澳门中国银行银联预付卡-预付费卡',
                    'type' => '3',
                ),
            622479 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622479',
                    'name' => '中国银行澳门分行-熊猫卡-贷记卡',
                    'type' => '1',
                ),
            622480 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622480',
                    'name' => '中国银行澳门分行-财富卡-贷记卡',
                    'type' => '1',
                ),
            622273 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622273',
                    'name' => '中国银行澳门分行-银联港币卡-借记卡',
                    'type' => '2',
                ),
            622274 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622274',
                    'name' => '中国银行澳门分行-银联澳门币卡-借记卡',
                    'type' => '2',
                ),
            620019 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '620019',
                    'name' => '中国银行(马来西亚)-预付卡-预付费卡',
                    'type' => '3',
                ),
            620035 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '620035',
                    'name' => '中国银行(马来西亚)-预付卡-预付费卡',
                    'type' => '3',
                ),
            621231 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621231',
                    'name' => '中国银行马尼拉分行-双币种借记卡-借记卡',
                    'type' => '2',
                ),
            622789 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622789',
                    'name' => '中国银行新加坡分行-BOCCUPPLATINUMCARD-贷记卡',
                    'type' => '1',
                ),
            621638 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621638',
                    'name' => '中国银行胡志明分行-借记卡-借记卡',
                    'type' => '2',
                ),
            621334 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621334',
                    'name' => '中国银行曼谷分行-借记卡-借记卡',
                    'type' => '2',
                ),
            625140 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '625140',
                    'name' => '中国银行曼谷分行-长城信用卡环球通-贷记卡',
                    'type' => '1',
                ),
            621395 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621395',
                    'name' => '中国银行曼谷分行-借记卡-借记卡',
                    'type' => '2',
                ),
            620513 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '620513',
                    'name' => '中国银行宁波分行-长城宁波市民卡-预付费卡',
                    'type' => '3',
                ),
            621741 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621741',
                    'name' => '中国银行（香港）(25190344)-接触式晶片借记卡-借记卡',
                    'type' => '2',
                ),
            623040 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '623040',
                    'name' => '中国银行（香港）(25190344)-接触式银联双币预制晶片借记卡-借记卡',
                    'type' => '2',
                ),
            620202 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '620202',
                    'name' => '中国银行（香港）(25190344)-中国银行银联预付卡-预付费卡',
                    'type' => '3',
                ),
            620203 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '620203',
                    'name' => '中国银行（香港）(25190344)-中国银行银联预付卡-预付费卡',
                    'type' => '3',
                ),
            625136 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '625136',
                    'name' => '中国银行（香港）(25190344)-中银Good Day银联双币白金卡-贷记卡',
                    'type' => '1',
                ),
            621782 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621782',
                    'name' => '中国银行（香港）(25190344)-中银纯电子现金双币卡-借记卡',
                    'type' => '2',
                ),
            623309 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '623309',
                    'name' => '中国银行（香港）(25190344)-中国银行银联公司借记卡-借记卡',
                    'type' => '2',
                ),
            622346 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622346',
                    'name' => '中国银行香港有限公司(47980344)-人民币信用卡金卡-贷记卡',
                    'type' => '1',
                ),
            622347 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622347',
                    'name' => '中国银行香港有限公司(47980344)-信用卡普通卡-贷记卡',
                    'type' => '1',
                ),
            622348 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622348',
                    'name' => '中国银行香港有限公司(47980344)-中银卡(人民币)-借记卡',
                    'type' => '2',
                ),
            621041 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '621041',
                    'name' => '中国银行(香港)(47980344)-银联港币借记卡-借记卡',
                    'type' => '2',
                ),
            622790 =>
                array(
                    'bank_id' => '7',
                    'card_bin' => '622790',
                    'name' => '中国银行新加坡分行(99900702)-Great Wall Platinum-贷记卡',
                    'type' => '1',
                ),
            5453242 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '5453242',
                    'name' => '中国建设银行-龙卡信用卡-贷记卡',
                    'type' => '1',
                ),
            5491031 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '5491031',
                    'name' => '中国建设银行-龙卡信用卡-贷记卡',
                    'type' => '1',
                ),
            5544033 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '5544033',
                    'name' => '中国建设银行-龙卡信用卡-贷记卡',
                    'type' => '1',
                ),
            622725 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '622725',
                    'name' => '中国建设银行-龙卡准贷记卡-准贷记卡',
                    'type' => '1',
                ),
            622728 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '622728',
                    'name' => '中国建设银行-龙卡准贷记卡金卡-准贷记卡',
                    'type' => '1',
                ),
            621284 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '621284',
                    'name' => '中国建设银行-中职学生资助卡-借记卡',
                    'type' => '2',
                ),
            421349 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '421349',
                    'name' => '中国建设银行-乐当家银卡VISA-借记卡',
                    'type' => '2',
                ),
            434061 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '434061',
                    'name' => '中国建设银行-乐当家金卡VISA-借记卡',
                    'type' => '2',
                ),
            434062 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '434062',
                    'name' => '中国建设银行-乐当家白金卡-借记卡',
                    'type' => '2',
                ),
            436728 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '436728',
                    'name' => '中国建设银行-龙卡普通卡VISA-准贷记卡',
                    'type' => '1',
                ),
            436742 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '436742',
                    'name' => '中国建设银行-龙卡储蓄卡-借记卡',
                    'type' => '2',
                ),
            453242 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '453242',
                    'name' => '中国建设银行-VISA准贷记卡(银联卡)-准贷记卡',
                    'type' => '1',
                ),
            491031 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '491031',
                    'name' => '中国建设银行-VISA准贷记金卡-准贷记卡',
                    'type' => '1',
                ),
            524094 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '524094',
                    'name' => '中国建设银行-乐当家-借记卡',
                    'type' => '2',
                ),
            526410 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '526410',
                    'name' => '中国建设银行-乐当家-借记卡',
                    'type' => '2',
                ),
            53242 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '53242',
                    'name' => '中国建设银行-MASTER准贷记卡-准贷记卡',
                    'type' => '1',
                ),
            53243 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '53243',
                    'name' => '中国建设银行-乐当家-准贷记卡',
                    'type' => '1',
                ),
            544033 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '544033',
                    'name' => '中国建设银行-准贷记金卡-准贷记卡',
                    'type' => '1',
                ),
            552245 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '552245',
                    'name' => '中国建设银行-乐当家白金卡-借记卡',
                    'type' => '2',
                ),
            589970 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '589970',
                    'name' => '中国建设银行-金融复合IC卡-借记卡',
                    'type' => '2',
                ),
            620060 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '620060',
                    'name' => '中国建设银行-银联标准卡-借记卡',
                    'type' => '2',
                ),
            621080 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '621080',
                    'name' => '中国建设银行-银联理财钻石卡-借记卡',
                    'type' => '2',
                ),
            621081 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '621081',
                    'name' => '中国建设银行-金融IC卡-借记卡',
                    'type' => '2',
                ),
            621466 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '621466',
                    'name' => '中国建设银行-理财白金卡-借记卡',
                    'type' => '2',
                ),
            621467 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '621467',
                    'name' => '中国建设银行-社保IC卡-借记卡',
                    'type' => '2',
                ),
            621488 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '621488',
                    'name' => '中国建设银行-财富卡私人银行卡-借记卡',
                    'type' => '2',
                ),
            621499 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '621499',
                    'name' => '中国建设银行-理财金卡-借记卡',
                    'type' => '2',
                ),
            621598 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '621598',
                    'name' => '中国建设银行-福农卡-借记卡',
                    'type' => '2',
                ),
            621621 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '621621',
                    'name' => '中国建设银行-武警军人保障卡-借记卡',
                    'type' => '2',
                ),
            621700 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '621700',
                    'name' => '中国建设银行-龙卡通-借记卡',
                    'type' => '2',
                ),
            622280 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '622280',
                    'name' => '中国建设银行-银联储蓄卡-借记卡',
                    'type' => '2',
                ),
            622700 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '622700',
                    'name' => '中国建设银行-龙卡储蓄卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622707 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '622707',
                    'name' => '中国建设银行-准贷记卡-准贷记卡',
                    'type' => '1',
                ),
            622966 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '622966',
                    'name' => '中国建设银行-理财白金卡-借记卡',
                    'type' => '2',
                ),
            622988 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '622988',
                    'name' => '中国建设银行-理财金卡-借记卡',
                    'type' => '2',
                ),
            625955 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '625955',
                    'name' => '中国建设银行-准贷记卡普卡-准贷记卡',
                    'type' => '1',
                ),
            625956 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '625956',
                    'name' => '中国建设银行-准贷记卡金卡-准贷记卡',
                    'type' => '1',
                ),
            553242 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '553242',
                    'name' => '中国建设银行-龙卡信用卡-贷记卡',
                    'type' => '1',
                ),
            621082 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '621082',
                    'name' => '中国建设银行-建行陆港通龙卡-借记卡',
                    'type' => '2',
                ),
            621673 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '621673',
                    'name' => '中国建设银行-普通高中学生资助卡-借记卡',
                    'type' => '2',
                ),
            623211 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '623211',
                    'name' => '中国建设银行-中国旅游卡-借记卡',
                    'type' => '2',
                ),
            436742193 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '436742193',
                    'name' => '中国建设银行厦门分行-龙卡储蓄卡-借记卡',
                    'type' => '2',
                ),
            622280193 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '622280193',
                    'name' => '中国建设银行厦门分行-银联储蓄卡-借记卡',
                    'type' => '2',
                ),
            356896 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '356896',
                    'name' => '中国建设银行-龙卡JCB金卡-贷记卡',
                    'type' => '1',
                ),
            356899 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '356899',
                    'name' => '中国建设银行-龙卡JCB白金卡-贷记卡',
                    'type' => '1',
                ),
            356895 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '356895',
                    'name' => '中国建设银行-龙卡JCB普卡-贷记卡',
                    'type' => '1',
                ),
            436718 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '436718',
                    'name' => '中国建设银行-龙卡贷记卡公司卡-贷记卡',
                    'type' => '1',
                ),
            436738 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '436738',
                    'name' => '中国建设银行-龙卡贷记卡-贷记卡',
                    'type' => '1',
                ),
            436745 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '436745',
                    'name' => '中国建设银行-龙卡国际普通卡VISA-贷记卡',
                    'type' => '1',
                ),
            436748 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '436748',
                    'name' => '中国建设银行-龙卡国际金卡VISA-贷记卡',
                    'type' => '1',
                ),
            489592 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '489592',
                    'name' => '中国建设银行-VISA白金信用卡-贷记卡',
                    'type' => '1',
                ),
            531693 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '531693',
                    'name' => '中国建设银行-龙卡国际白金卡-贷记卡',
                    'type' => '1',
                ),
            532450 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '532450',
                    'name' => '中国建设银行-龙卡国际普通卡MASTER-贷记卡',
                    'type' => '1',
                ),
            532458 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '532458',
                    'name' => '中国建设银行-龙卡国际金卡MASTER-贷记卡',
                    'type' => '1',
                ),
            544887 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '544887',
                    'name' => '中国建设银行-龙卡万事达金卡-贷记卡',
                    'type' => '1',
                ),
            552801 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '552801',
                    'name' => '中国建设银行-龙卡贷记卡-贷记卡',
                    'type' => '1',
                ),
            557080 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '557080',
                    'name' => '中国建设银行-龙卡万事达白金卡-贷记卡',
                    'type' => '1',
                ),
            558895 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '558895',
                    'name' => '中国建设银行-龙卡贷记卡-贷记卡',
                    'type' => '1',
                ),
            559051 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '559051',
                    'name' => '中国建设银行-龙卡万事达信用卡-贷记卡',
                    'type' => '1',
                ),
            622166 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '622166',
                    'name' => '中国建设银行-龙卡人民币信用卡-贷记卡',
                    'type' => '1',
                ),
            622168 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '622168',
                    'name' => '中国建设银行-龙卡人民币信用金卡-贷记卡',
                    'type' => '1',
                ),
            622708 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '622708',
                    'name' => '中国建设银行-龙卡人民币白金卡-贷记卡',
                    'type' => '1',
                ),
            625964 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '625964',
                    'name' => '中国建设银行-龙卡IC信用卡普卡-贷记卡',
                    'type' => '1',
                ),
            625965 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '625965',
                    'name' => '中国建设银行-龙卡IC信用卡金卡-贷记卡',
                    'type' => '1',
                ),
            625966 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '625966',
                    'name' => '中国建设银行-龙卡IC信用卡白金卡-贷记卡',
                    'type' => '1',
                ),
            628266 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '628266',
                    'name' => '中国建设银行-龙卡银联公务卡普卡-贷记卡',
                    'type' => '1',
                ),
            628366 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '628366',
                    'name' => '中国建设银行-龙卡银联公务卡金卡-贷记卡',
                    'type' => '1',
                ),
            625362 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '625362',
                    'name' => '中国建设银行-中国旅游卡-贷记卡',
                    'type' => '1',
                ),
            625363 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '625363',
                    'name' => '中国建设银行-中国旅游卡-贷记卡',
                    'type' => '1',
                ),
            628316 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '628316',
                    'name' => '中国建设银行-龙卡IC公务卡-贷记卡',
                    'type' => '1',
                ),
            628317 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '628317',
                    'name' => '中国建设银行-龙卡IC公务卡-贷记卡',
                    'type' => '1',
                ),
            622381 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '622381',
                    'name' => '中国建设银行亚洲股份有限公司(25070344)-人民币信用卡-贷记卡',
                    'type' => '1',
                ),
            622675 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '622675',
                    'name' => '中国建设银行亚洲股份有限公司(25070344)-银联卡-贷记卡',
                    'type' => '1',
                ),
            622676 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '622676',
                    'name' => '中国建设银行亚洲股份有限公司(25070344)-银联卡-贷记卡',
                    'type' => '1',
                ),
            622677 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '622677',
                    'name' => '中国建设银行亚洲股份有限公司(25070344)-银联卡-贷记卡',
                    'type' => '1',
                ),
            622382 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '622382',
                    'name' => '中国建设银行亚洲股份有限公司(25070344)-人民币卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            621487 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '621487',
                    'name' => '中国建设银行亚洲股份有限公司(25070344)-借记卡-借记卡',
                    'type' => '2',
                ),
            621083 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '621083',
                    'name' => '中国建设银行亚洲股份有限公司(25070344)-建行陆港通龙卡-借记卡',
                    'type' => '2',
                ),
            621084 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '621084',
                    'name' => '中国建设银行澳门股份有限公司(25270446)-扣款卡-借记卡',
                    'type' => '2',
                ),
            620107 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '620107',
                    'name' => '中国建设银行（亚洲）(25330344)-预付卡-借记卡',
                    'type' => '2',
                ),
            623251 =>
                array(
                    'bank_id' => '8',
                    'card_bin' => '623251',
                    'name' => '中国建设银行-单位结算卡-借记卡',
                    'type' => '2',
                ),
            620021 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '620021',
                    'name' => '交通银行-交行预付卡-预付费卡',
                    'type' => '3',
                ),
            620521 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '620521',
                    'name' => '交通银行-世博预付IC卡-预付费卡',
                    'type' => '3',
                ),
            '00405512' =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '00405512',
                    'name' => '交通银行-太平洋互连卡-借记卡',
                    'type' => '2',
                ),
            '0049104' =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '0049104',
                    'name' => '交通银行-太平洋信用卡-贷记卡',
                    'type' => '1',
                ),
            '0053783' =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '0053783',
                    'name' => '交通银行-太平洋信用卡-贷记卡',
                    'type' => '1',
                ),
            '00601428' =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '00601428',
                    'name' => '交通银行-太平洋万事顺卡-借记卡',
                    'type' => '2',
                ),
            405512 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '405512',
                    'name' => '交通银行-太平洋互连卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            434910 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '434910',
                    'name' => '交通银行-太平洋白金信用卡-贷记卡',
                    'type' => '1',
                ),
            458123 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '458123',
                    'name' => '交通银行-太平洋双币贷记卡-贷记卡',
                    'type' => '1',
                ),
            458124 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '458124',
                    'name' => '交通银行-太平洋双币贷记卡-贷记卡',
                    'type' => '1',
                ),
            49104 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '49104',
                    'name' => '交通银行-太平洋信用卡-贷记卡',
                    'type' => '1',
                ),
            520169 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '520169',
                    'name' => '交通银行-太平洋双币贷记卡-贷记卡',
                    'type' => '1',
                ),
            522964 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '522964',
                    'name' => '交通银行-太平洋白金信用卡-贷记卡',
                    'type' => '1',
                ),
            53783 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '53783',
                    'name' => '交通银行-太平洋信用卡-贷记卡',
                    'type' => '1',
                ),
            552853 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '552853',
                    'name' => '交通银行-太平洋双币贷记卡-贷记卡',
                    'type' => '1',
                ),
            601428 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '601428',
                    'name' => '交通银行-太平洋万事顺卡-借记卡',
                    'type' => '2',
                ),
            622250 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '622250',
                    'name' => '交通银行-太平洋人民币贷记卡-贷记卡',
                    'type' => '1',
                ),
            622251 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '622251',
                    'name' => '交通银行-太平洋人民币贷记卡-贷记卡',
                    'type' => '1',
                ),
            521899 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '521899',
                    'name' => '交通银行-太平洋双币贷记卡-贷记卡',
                    'type' => '1',
                ),
            622254 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '622254',
                    'name' => '交通银行-太平洋准贷记卡-准贷记卡',
                    'type' => '1',
                ),
            622255 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '622255',
                    'name' => '交通银行-太平洋准贷记卡-准贷记卡',
                    'type' => '1',
                ),
            622256 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '622256',
                    'name' => '交通银行-太平洋准贷记卡-准贷记卡',
                    'type' => '1',
                ),
            622257 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '622257',
                    'name' => '交通银行-太平洋准贷记卡-准贷记卡',
                    'type' => '1',
                ),
            622258 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '622258',
                    'name' => '交通银行-太平洋借记卡-借记卡',
                    'type' => '2',
                ),
            622259 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '622259',
                    'name' => '交通银行-太平洋借记卡-借记卡',
                    'type' => '2',
                ),
            622253 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '622253',
                    'name' => '交通银行-太平洋人民币贷记卡-贷记卡',
                    'type' => '1',
                ),
            622261 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '622261',
                    'name' => '交通银行-太平洋借记卡-借记卡',
                    'type' => '2',
                ),
            622284 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '622284',
                    'name' => '交通银行-太平洋MORE卡-准贷记卡',
                    'type' => '1',
                ),
            622656 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '622656',
                    'name' => '交通银行-白金卡-贷记卡',
                    'type' => '1',
                ),
            628216 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '628216',
                    'name' => '交通银行-交通银行公务卡普卡-贷记卡',
                    'type' => '1',
                ),
            622252 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '622252',
                    'name' => '交通银行-太平洋人民币贷记卡-贷记卡',
                    'type' => '1',
                ),
            66405512 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '66405512',
                    'name' => '交通银行-太平洋互连卡-借记卡',
                    'type' => '2',
                ),
            6649104 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '6649104',
                    'name' => '交通银行-太平洋信用卡-贷记卡',
                    'type' => '1',
                ),
            622260 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '622260',
                    'name' => '交通银行-太平洋借记卡-借记卡',
                    'type' => '2',
                ),
            66601428 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '66601428',
                    'name' => '交通银行-太平洋万事顺卡-借记卡',
                    'type' => '2',
                ),
            955590 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '955590',
                    'name' => '交通银行-太平洋贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            955591 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '955591',
                    'name' => '交通银行-太平洋贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            955592 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '955592',
                    'name' => '交通银行-太平洋贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            955593 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '955593',
                    'name' => '交通银行-太平洋贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            6653783 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '6653783',
                    'name' => '交通银行-太平洋信用卡-贷记卡',
                    'type' => '1',
                ),
            628218 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '628218',
                    'name' => '交通银行-交通银行公务卡金卡-贷记卡',
                    'type' => '1',
                ),
            622262 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '622262',
                    'name' => '交通银行-交银IC卡-借记卡',
                    'type' => '2',
                ),
            621069 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '621069',
                    'name' => '交通银行香港分行-交通银行港币借记卡-借记卡',
                    'type' => '2',
                ),
            620013 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '620013',
                    'name' => '交通银行香港分行-港币礼物卡-借记卡',
                    'type' => '2',
                ),
            625028 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '625028',
                    'name' => '交通银行香港分行-双币种信用卡-贷记卡',
                    'type' => '1',
                ),
            625029 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '625029',
                    'name' => '交通银行香港分行-双币种信用卡-贷记卡',
                    'type' => '1',
                ),
            621436 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '621436',
                    'name' => '交通银行香港分行-双币卡-借记卡',
                    'type' => '2',
                ),
            621002 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '621002',
                    'name' => '交通银行香港分行-银联人民币卡-借记卡',
                    'type' => '2',
                ),
            621335 =>
                array(
                    'bank_id' => '9',
                    'card_bin' => '621335',
                    'name' => '交通银行澳门分行-银联借记卡-借记卡',
                    'type' => '2',
                ),
            621098 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '621098',
                    'name' => '中国邮政储蓄银行-绿卡通-借记卡',
                    'type' => '2',
                ),
            622150 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '622150',
                    'name' => '中国邮政储蓄银行-绿卡银联标准卡-借记卡',
                    'type' => '2',
                ),
            622151 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '622151',
                    'name' => '中国邮政储蓄银行-绿卡银联标准卡-借记卡',
                    'type' => '2',
                ),
            622181 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '622181',
                    'name' => '中国邮政储蓄银行-绿卡专用卡-借记卡',
                    'type' => '2',
                ),
            622188 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '622188',
                    'name' => '中国邮政储蓄银行-绿卡银联标准卡-借记卡',
                    'type' => '2',
                ),
            955100 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '955100',
                    'name' => '中国邮政储蓄银行-绿卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            621095 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '621095',
                    'name' => '中国邮政储蓄银行-绿卡VIP卡-借记卡',
                    'type' => '2',
                ),
            620062 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '620062',
                    'name' => '中国邮政储蓄银行-银联标准卡-借记卡',
                    'type' => '2',
                ),
            621285 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '621285',
                    'name' => '中国邮政储蓄银行-中职学生资助卡-借记卡',
                    'type' => '2',
                ),
            621798 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '621798',
                    'name' => '中国邮政储蓄银行-IC绿卡通VIP卡-借记卡',
                    'type' => '2',
                ),
            621799 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '621799',
                    'name' => '中国邮政储蓄银行-IC绿卡通-借记卡',
                    'type' => '2',
                ),
            621797 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '621797',
                    'name' => '中国邮政储蓄银行-IC联名卡-借记卡',
                    'type' => '2',
                ),
            620529 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '620529',
                    'name' => '中国邮政储蓄银行-IC预付费卡-预付费卡',
                    'type' => '3',
                ),
            622199 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '622199',
                    'name' => '中国邮政储蓄银行-绿卡银联标准卡-借记卡',
                    'type' => '2',
                ),
            621096 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '621096',
                    'name' => '中国邮政储蓄银行-绿卡通-借记卡',
                    'type' => '2',
                ),
            62215049 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '62215049',
                    'name' => '中国邮政储蓄银行河南分行-绿卡储蓄卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            62215050 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '62215050',
                    'name' => '中国邮政储蓄银行河南分行-绿卡储蓄卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            62215051 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '62215051',
                    'name' => '中国邮政储蓄银行河南分行-绿卡储蓄卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            62218850 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '62218850',
                    'name' => '中国邮政储蓄银行河南分行-绿卡储蓄卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            62218851 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '62218851',
                    'name' => '中国邮政储蓄银行河南分行-绿卡储蓄卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            62218849 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '62218849',
                    'name' => '中国邮政储蓄银行河南分行-绿卡储蓄卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            621622 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '621622',
                    'name' => '中国邮政储蓄银行-武警军人保障卡-借记卡',
                    'type' => '2',
                ),
            623219 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '623219',
                    'name' => '中国邮政储蓄银行-中国旅游卡（金卡）-借记卡',
                    'type' => '2',
                ),
            621674 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '621674',
                    'name' => '中国邮政储蓄银行-普通高中学生资助卡-借记卡',
                    'type' => '2',
                ),
            623218 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '623218',
                    'name' => '中国邮政储蓄银行-中国旅游卡（普卡）-借记卡',
                    'type' => '2',
                ),
            621599 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '621599',
                    'name' => '中国邮政储蓄银行-福农卡-借记卡',
                    'type' => '2',
                ),
            622812 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '622812',
                    'name' => '中国邮政储蓄银行信用卡中心(61000000)-银联标准白金卡-贷记卡',
                    'type' => '1',
                ),
            622810 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '622810',
                    'name' => '中国邮政储蓄银行信用卡中心(61000000)-银联标准贷记卡-贷记卡',
                    'type' => '1',
                ),
            622811 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '622811',
                    'name' => '中国邮政储蓄银行信用卡中心(61000000)-银联标准贷记卡-贷记卡',
                    'type' => '1',
                ),
            628310 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '628310',
                    'name' => '中国邮政储蓄银行信用卡中心(61000000)-银联标准公务卡-贷记卡',
                    'type' => '1',
                ),
            625919 =>
                array(
                    'bank_id' => '10',
                    'card_bin' => '625919',
                    'name' => '中国邮政储蓄银行信用卡中心(61000000)-上海购物信用卡-贷记卡',
                    'type' => '1',
                ),
            303 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '303',
                    'name' => '中国光大银行-阳光卡-借记卡',
                    'type' => '2',
                ),
            356837 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '356837',
                    'name' => '中国光大银行-阳光商旅信用卡-贷记卡',
                    'type' => '1',
                ),
            356838 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '356838',
                    'name' => '中国光大银行-阳光商旅信用卡-贷记卡',
                    'type' => '1',
                ),
            486497 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '486497',
                    'name' => '中国光大银行-阳光商旅信用卡-贷记卡',
                    'type' => '1',
                ),
            622660 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '622660',
                    'name' => '中国光大银行-阳光卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622662 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '622662',
                    'name' => '中国光大银行-阳光卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622663 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '622663',
                    'name' => '中国光大银行-阳光卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622664 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '622664',
                    'name' => '中国光大银行-阳光卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622665 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '622665',
                    'name' => '中国光大银行-阳光卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622666 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '622666',
                    'name' => '中国光大银行-阳光卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622667 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '622667',
                    'name' => '中国光大银行-阳光卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622669 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '622669',
                    'name' => '中国光大银行-阳光卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622670 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '622670',
                    'name' => '中国光大银行-阳光卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622671 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '622671',
                    'name' => '中国光大银行-阳光卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622672 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '622672',
                    'name' => '中国光大银行-阳光卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622668 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '622668',
                    'name' => '中国光大银行-阳光卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622661 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '622661',
                    'name' => '中国光大银行-阳光卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622674 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '622674',
                    'name' => '中国光大银行-阳光卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            90030 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '90030',
                    'name' => '中国光大银行-阳光卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622673 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '622673',
                    'name' => '中国光大银行-阳光卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            620518 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '620518',
                    'name' => '中国光大银行-借记卡普卡-借记卡',
                    'type' => '2',
                ),
            621489 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '621489',
                    'name' => '中国光大银行-社会保障IC卡-借记卡',
                    'type' => '2',
                ),
            621492 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '621492',
                    'name' => '中国光大银行-IC借记卡普卡-借记卡',
                    'type' => '2',
                ),
            620535 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '620535',
                    'name' => '中国光大银行-手机支付卡-借记卡',
                    'type' => '2',
                ),
            623156 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '623156',
                    'name' => '中国光大银行-联名IC卡普卡-借记卡',
                    'type' => '2',
                ),
            621490 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '621490',
                    'name' => '中国光大银行-借记IC卡白金卡-借记卡',
                    'type' => '2',
                ),
            621491 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '621491',
                    'name' => '中国光大银行-借记IC卡金卡-借记卡',
                    'type' => '2',
                ),
            620085 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '620085',
                    'name' => '中国光大银行-阳光旅行卡-借记卡',
                    'type' => '2',
                ),
            623155 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '623155',
                    'name' => '中国光大银行-借记IC卡钻石卡-借记卡',
                    'type' => '2',
                ),
            623157 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '623157',
                    'name' => '中国光大银行-联名IC卡金卡-借记卡',
                    'type' => '2',
                ),
            623158 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '623158',
                    'name' => '中国光大银行-联名IC卡白金卡-借记卡',
                    'type' => '2',
                ),
            623159 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '623159',
                    'name' => '中国光大银行-联名IC卡钻石卡-借记卡',
                    'type' => '2',
                ),
            622657 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '622657',
                    'name' => '中国光大银行(63030000)-存贷合一白金卡-贷记卡',
                    'type' => '1',
                ),
            622685 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '622685',
                    'name' => '中国光大银行(63030000)-存贷合一卡普卡-贷记卡',
                    'type' => '1',
                ),
            622659 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '622659',
                    'name' => '中国光大银行(63030000)-理财信用卡-贷记卡',
                    'type' => '1',
                ),
            622687 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '622687',
                    'name' => '中国光大银行(63030000)-存贷合一钻石卡-贷记卡',
                    'type' => '1',
                ),
            625978 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '625978',
                    'name' => '中国光大银行(63030000)-存贷合一IC卡-贷记卡',
                    'type' => '1',
                ),
            625980 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '625980',
                    'name' => '中国光大银行(63030000)-存贷合一IC卡-贷记卡',
                    'type' => '1',
                ),
            625981 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '625981',
                    'name' => '中国光大银行(63030000)-存贷合一IC卡-贷记卡',
                    'type' => '1',
                ),
            625979 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '625979',
                    'name' => '中国光大银行(63030000)-存贷合一IC卡-贷记卡',
                    'type' => '1',
                ),
            356839 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '356839',
                    'name' => '中国光大银行(63030000)-阳光商旅信用卡-贷记卡',
                    'type' => '1',
                ),
            356840 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '356840',
                    'name' => '中国光大银行(63030000)-阳光商旅信用卡-贷记卡',
                    'type' => '1',
                ),
            406252 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '406252',
                    'name' => '中国光大银行(63030000)-阳光信用卡(银联-贷记卡',
                    'type' => '1',
                ),
            406254 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '406254',
                    'name' => '中国光大银行(63030000)-阳光信用卡(银联-贷记卡',
                    'type' => '1',
                ),
            425862 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '425862',
                    'name' => '中国光大银行(63030000)-阳光商旅信用卡-贷记卡',
                    'type' => '1',
                ),
            481699 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '481699',
                    'name' => '中国光大银行(63030000)-阳光白金信用卡-贷记卡',
                    'type' => '1',
                ),
            524090 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '524090',
                    'name' => '中国光大银行(63030000)-安邦俱乐部信用卡-贷记卡',
                    'type' => '1',
                ),
            543159 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '543159',
                    'name' => '中国光大银行(63030000)-足球锦标赛纪念卡-贷记卡',
                    'type' => '1',
                ),
            622161 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '622161',
                    'name' => '中国光大银行(63030000)-光大银行联名公务卡-贷记卡',
                    'type' => '1',
                ),
            622570 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '622570',
                    'name' => '中国光大银行(63030000)-积分卡-贷记卡',
                    'type' => '1',
                ),
            622650 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '622650',
                    'name' => '中国光大银行(63030000)-炎黄卡普卡-贷记卡',
                    'type' => '1',
                ),
            622655 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '622655',
                    'name' => '中国光大银行(63030000)-炎黄卡白金卡-贷记卡',
                    'type' => '1',
                ),
            622658 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '622658',
                    'name' => '中国光大银行(63030000)-炎黄卡金卡-贷记卡',
                    'type' => '1',
                ),
            625975 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '625975',
                    'name' => '中国光大银行(63030000)-贷记IC卡-贷记卡',
                    'type' => '1',
                ),
            625977 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '625977',
                    'name' => '中国光大银行(63030000)-贷记IC卡-贷记卡',
                    'type' => '1',
                ),
            628201 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '628201',
                    'name' => '中国光大银行(63030000)-银联公务卡-贷记卡',
                    'type' => '1',
                ),
            628202 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '628202',
                    'name' => '中国光大银行(63030000)-银联公务卡-贷记卡',
                    'type' => '1',
                ),
            625976 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '625976',
                    'name' => '中国光大银行(63030000)-贷记IC卡-贷记卡',
                    'type' => '1',
                ),
            625339 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '625339',
                    'name' => '中国光大银行(63030000)-银联贷记IC旅游卡-贷记卡',
                    'type' => '1',
                ),
            622801 =>
                array(
                    'bank_id' => '11',
                    'card_bin' => '622801',
                    'name' => '中国光大银行(63030000)-贷记IC卡-贷记卡',
                    'type' => '1',
                ),
            622615 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '622615',
                    'name' => '中国民生银行-民生借记卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622616 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '622616',
                    'name' => '中国民生银行-民生银联借记卡－金卡-借记卡',
                    'type' => '2',
                ),
            622618 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '622618',
                    'name' => '中国民生银行-钻石卡-借记卡',
                    'type' => '2',
                ),
            622622 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '622622',
                    'name' => '中国民生银行-民生借记卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622617 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '622617',
                    'name' => '中国民生银行-民生借记卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622619 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '622619',
                    'name' => '中国民生银行-民生借记卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            415599 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '415599',
                    'name' => '中国民生银行-民生借记卡-借记卡',
                    'type' => '2',
                ),
            421393 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '421393',
                    'name' => '中国民生银行-民生国际卡-借记卡',
                    'type' => '2',
                ),
            421865 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '421865',
                    'name' => '中国民生银行-民生国际卡(银卡)-借记卡',
                    'type' => '2',
                ),
            427570 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '427570',
                    'name' => '中国民生银行-民生国际卡(欧元卡)-借记卡',
                    'type' => '2',
                ),
            427571 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '427571',
                    'name' => '中国民生银行-民生国际卡(澳元卡)-借记卡',
                    'type' => '2',
                ),
            472067 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '472067',
                    'name' => '中国民生银行-民生国际卡-借记卡',
                    'type' => '2',
                ),
            472068 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '472068',
                    'name' => '中国民生银行-民生国际卡-借记卡',
                    'type' => '2',
                ),
            622620 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '622620',
                    'name' => '中国民生银行-薪资理财卡-借记卡',
                    'type' => '2',
                ),
            621691 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '621691',
                    'name' => '中国民生银行-借记卡普卡-借记卡',
                    'type' => '2',
                ),
            545392 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '545392',
                    'name' => '中国民生银行-民生MasterCard-贷记卡',
                    'type' => '1',
                ),
            545393 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '545393',
                    'name' => '中国民生银行-民生MasterCard-贷记卡',
                    'type' => '1',
                ),
            545431 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '545431',
                    'name' => '中国民生银行-民生MasterCard-贷记卡',
                    'type' => '1',
                ),
            545447 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '545447',
                    'name' => '中国民生银行-民生MasterCard-贷记卡',
                    'type' => '1',
                ),
            356859 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '356859',
                    'name' => '中国民生银行-民生JCB信用卡-贷记卡',
                    'type' => '1',
                ),
            356857 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '356857',
                    'name' => '中国民生银行-民生JCB金卡-贷记卡',
                    'type' => '1',
                ),
            407405 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '407405',
                    'name' => '中国民生银行-民生贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            421869 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '421869',
                    'name' => '中国民生银行-民生贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            421870 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '421870',
                    'name' => '中国民生银行-民生贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            421871 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '421871',
                    'name' => '中国民生银行-民生贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            512466 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '512466',
                    'name' => '中国民生银行-民生贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            356856 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '356856',
                    'name' => '中国民生银行-民生JCB普卡-贷记卡',
                    'type' => '1',
                ),
            528948 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '528948',
                    'name' => '中国民生银行-民生贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            552288 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '552288',
                    'name' => '中国民生银行-民生贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            622600 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '622600',
                    'name' => '中国民生银行-民生信用卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            622601 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '622601',
                    'name' => '中国民生银行-民生信用卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            622602 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '622602',
                    'name' => '中国民生银行-民生银联白金信用卡-贷记卡',
                    'type' => '1',
                ),
            517636 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '517636',
                    'name' => '中国民生银行-民生贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            622621 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '622621',
                    'name' => '中国民生银行-民生银联个人白金卡-贷记卡',
                    'type' => '1',
                ),
            628258 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '628258',
                    'name' => '中国民生银行-公务卡金卡-贷记卡',
                    'type' => '1',
                ),
            556610 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '556610',
                    'name' => '中国民生银行-民生贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            622603 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '622603',
                    'name' => '中国民生银行-民生银联商务信用卡-贷记卡',
                    'type' => '1',
                ),
            464580 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '464580',
                    'name' => '中国民生银行-民VISA无限卡-贷记卡',
                    'type' => '1',
                ),
            464581 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '464581',
                    'name' => '中国民生银行-民生VISA商务白金卡-贷记卡',
                    'type' => '1',
                ),
            523952 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '523952',
                    'name' => '中国民生银行-民生万事达钛金卡-贷记卡',
                    'type' => '1',
                ),
            545217 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '545217',
                    'name' => '中国民生银行-民生万事达世界卡-贷记卡',
                    'type' => '1',
                ),
            553161 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '553161',
                    'name' => '中国民生银行-民生万事达白金公务卡-贷记卡',
                    'type' => '1',
                ),
            356858 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '356858',
                    'name' => '中国民生银行-民生JCB白金卡-贷记卡',
                    'type' => '1',
                ),
            622623 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '622623',
                    'name' => '中国民生银行-银联标准金卡-贷记卡',
                    'type' => '1',
                ),
            625911 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '625911',
                    'name' => '中国民生银行-银联芯片普卡-贷记卡',
                    'type' => '1',
                ),
            377152 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '377152',
                    'name' => '中国民生银行-民生运通双币信用卡普卡-贷记卡',
                    'type' => '1',
                ),
            377153 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '377153',
                    'name' => '中国民生银行-民生运通双币信用卡金卡-贷记卡',
                    'type' => '1',
                ),
            377158 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '377158',
                    'name' => '中国民生银行-民生运通双币信用卡钻石卡-贷记卡',
                    'type' => '1',
                ),
            377155 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '377155',
                    'name' => '中国民生银行-民生运通双币标准信用卡白金卡-贷记卡',
                    'type' => '1',
                ),
            625912 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '625912',
                    'name' => '中国民生银行-银联芯片金卡-贷记卡',
                    'type' => '1',
                ),
            625913 =>
                array(
                    'bank_id' => '12',
                    'card_bin' => '625913',
                    'name' => '中国民生银行-银联芯片白金卡-贷记卡',
                    'type' => '1',
                ),
            356885 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '356885',
                    'name' => '招商银行-招商银行信用卡-贷记卡',
                    'type' => '1',
                ),
            356886 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '356886',
                    'name' => '招商银行-招商银行信用卡-贷记卡',
                    'type' => '1',
                ),
            356887 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '356887',
                    'name' => '招商银行-招商银行信用卡-贷记卡',
                    'type' => '1',
                ),
            356888 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '356888',
                    'name' => '招商银行-招商银行信用卡-贷记卡',
                    'type' => '1',
                ),
            356890 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '356890',
                    'name' => '招商银行-招商银行信用卡-贷记卡',
                    'type' => '1',
                ),
            402658 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '402658',
                    'name' => '招商银行-两地一卡通-借记卡',
                    'type' => '2',
                ),
            410062 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '410062',
                    'name' => '招商银行-招行国际卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            439188 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '439188',
                    'name' => '招商银行-招商银行信用卡-贷记卡',
                    'type' => '1',
                ),
            439227 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '439227',
                    'name' => '招商银行-VISA商务信用卡-贷记卡',
                    'type' => '1',
                ),
            468203 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '468203',
                    'name' => '招商银行-招行国际卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            479228 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '479228',
                    'name' => '招商银行-招商银行信用卡-贷记卡',
                    'type' => '1',
                ),
            479229 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '479229',
                    'name' => '招商银行-招商银行信用卡-贷记卡',
                    'type' => '1',
                ),
            512425 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '512425',
                    'name' => '招商银行-招行国际卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            521302 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '521302',
                    'name' => '招商银行-世纪金花联名信用卡-贷记卡',
                    'type' => '1',
                ),
            524011 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '524011',
                    'name' => '招商银行-招行国际卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            356889 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '356889',
                    'name' => '招商银行-招商银行信用卡-贷记卡',
                    'type' => '1',
                ),
            545620 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '545620',
                    'name' => '招商银行-万事达信用卡-贷记卡',
                    'type' => '1',
                ),
            545621 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '545621',
                    'name' => '招商银行-万事达信用卡-贷记卡',
                    'type' => '1',
                ),
            545947 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '545947',
                    'name' => '招商银行-万事达信用卡-贷记卡',
                    'type' => '1',
                ),
            545948 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '545948',
                    'name' => '招商银行-万事达信用卡-贷记卡',
                    'type' => '1',
                ),
            552534 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '552534',
                    'name' => '招商银行-招商银行信用卡-贷记卡',
                    'type' => '1',
                ),
            552587 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '552587',
                    'name' => '招商银行-招商银行信用卡-贷记卡',
                    'type' => '1',
                ),
            622575 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '622575',
                    'name' => '招商银行-招商银行信用卡-贷记卡',
                    'type' => '1',
                ),
            622576 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '622576',
                    'name' => '招商银行-招商银行信用卡-贷记卡',
                    'type' => '1',
                ),
            622577 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '622577',
                    'name' => '招商银行-招商银行信用卡-贷记卡',
                    'type' => '1',
                ),
            622579 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '622579',
                    'name' => '招商银行-招商银行信用卡-贷记卡',
                    'type' => '1',
                ),
            622580 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '622580',
                    'name' => '招商银行-一卡通(银联卡)-借记卡',
                    'type' => '2',
                ),
            545619 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '545619',
                    'name' => '招商银行-万事达信用卡-贷记卡',
                    'type' => '1',
                ),
            622581 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '622581',
                    'name' => '招商银行-招商银行信用卡-贷记卡',
                    'type' => '1',
                ),
            622582 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '622582',
                    'name' => '招商银行-招商银行信用卡-贷记卡',
                    'type' => '1',
                ),
            622588 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '622588',
                    'name' => '招商银行-一卡通(银联卡)-借记卡',
                    'type' => '2',
                ),
            622598 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '622598',
                    'name' => '招商银行-公司卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622609 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '622609',
                    'name' => '招商银行-金卡-借记卡',
                    'type' => '2',
                ),
            690755 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '690755',
                    'name' => '招商银行-招行一卡通-借记卡',
                    'type' => '2',
                ),
            95555 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '95555',
                    'name' => '招商银行-一卡通(银联卡)-借记卡',
                    'type' => '2',
                ),
            545623 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '545623',
                    'name' => '招商银行-万事达信用卡-贷记卡',
                    'type' => '1',
                ),
            621286 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '621286',
                    'name' => '招商银行-金葵花卡-借记卡',
                    'type' => '2',
                ),
            620520 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '620520',
                    'name' => '招商银行-电子现金卡-预付费卡',
                    'type' => '3',
                ),
            621483 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '621483',
                    'name' => '招商银行-银联IC普卡-借记卡',
                    'type' => '2',
                ),
            621485 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '621485',
                    'name' => '招商银行-银联IC金卡-借记卡',
                    'type' => '2',
                ),
            621486 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '621486',
                    'name' => '招商银行-银联金葵花IC卡-借记卡',
                    'type' => '2',
                ),
            628290 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '628290',
                    'name' => '招商银行-IC公务卡-贷记卡',
                    'type' => '1',
                ),
            622578 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '622578',
                    'name' => '招商银行-招商银行信用卡-贷记卡',
                    'type' => '1',
                ),
            370285 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '370285',
                    'name' => '招商银行信用卡中心-美国运通绿卡-贷记卡',
                    'type' => '1',
                ),
            370286 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '370286',
                    'name' => '招商银行信用卡中心-美国运通金卡-贷记卡',
                    'type' => '1',
                ),
            370287 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '370287',
                    'name' => '招商银行信用卡中心-美国运通商务绿卡-贷记卡',
                    'type' => '1',
                ),
            370289 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '370289',
                    'name' => '招商银行信用卡中心-美国运通商务金卡-贷记卡',
                    'type' => '1',
                ),
            439225 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '439225',
                    'name' => '招商银行信用卡中心-VISA信用卡-贷记卡',
                    'type' => '1',
                ),
            518710 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '518710',
                    'name' => '招商银行信用卡中心-MASTER信用卡-贷记卡',
                    'type' => '1',
                ),
            518718 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '518718',
                    'name' => '招商银行信用卡中心-MASTER信用金卡-贷记卡',
                    'type' => '1',
                ),
            628362 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '628362',
                    'name' => '招商银行信用卡中心-银联标准公务卡(金卡)-贷记卡',
                    'type' => '1',
                ),
            439226 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '439226',
                    'name' => '招商银行信用卡中心-VISA信用卡-贷记卡',
                    'type' => '1',
                ),
            628262 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '628262',
                    'name' => '招商银行信用卡中心-银联标准财政公务卡-贷记卡',
                    'type' => '1',
                ),
            625802 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '625802',
                    'name' => '招商银行信用卡中心-芯片IC信用卡-贷记卡',
                    'type' => '1',
                ),
            625803 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '625803',
                    'name' => '招商银行信用卡中心-芯片IC信用卡-贷记卡',
                    'type' => '1',
                ),
            621299 =>
                array(
                    'bank_id' => '13',
                    'card_bin' => '621299',
                    'name' => '招商银行香港分行-香港一卡通-借记卡',
                    'type' => '2',
                ),
            433670 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '433670',
                    'name' => '中信银行-中信借记卡-借记卡',
                    'type' => '2',
                ),
            433680 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '433680',
                    'name' => '中信银行-中信借记卡-借记卡',
                    'type' => '2',
                ),
            442729 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '442729',
                    'name' => '中信银行-中信国际借记卡-借记卡',
                    'type' => '2',
                ),
            442730 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '442730',
                    'name' => '中信银行-中信国际借记卡-借记卡',
                    'type' => '2',
                ),
            620082 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '620082',
                    'name' => '中信银行-中国旅行卡-借记卡',
                    'type' => '2',
                ),
            622690 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '622690',
                    'name' => '中信银行-中信借记卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622691 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '622691',
                    'name' => '中信银行-中信借记卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622692 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '622692',
                    'name' => '中信银行-中信贵宾卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622696 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '622696',
                    'name' => '中信银行-中信理财宝金卡-借记卡',
                    'type' => '2',
                ),
            622698 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '622698',
                    'name' => '中信银行-中信理财宝白金卡-借记卡',
                    'type' => '2',
                ),
            622998 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '622998',
                    'name' => '中信银行-中信钻石卡-借记卡',
                    'type' => '2',
                ),
            622999 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '622999',
                    'name' => '中信银行-中信钻石卡-借记卡',
                    'type' => '2',
                ),
            433671 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '433671',
                    'name' => '中信银行-中信借记卡-借记卡',
                    'type' => '2',
                ),
            968807 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '968807',
                    'name' => '中信银行-中信理财宝(银联卡)-借记卡',
                    'type' => '2',
                ),
            968808 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '968808',
                    'name' => '中信银行-中信理财宝(银联卡)-借记卡',
                    'type' => '2',
                ),
            968809 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '968809',
                    'name' => '中信银行-中信理财宝(银联卡)-借记卡',
                    'type' => '2',
                ),
            621771 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '621771',
                    'name' => '中信银行-借记卡-借记卡',
                    'type' => '2',
                ),
            621767 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '621767',
                    'name' => '中信银行-理财宝IC卡-借记卡',
                    'type' => '2',
                ),
            621768 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '621768',
                    'name' => '中信银行-理财宝IC卡-借记卡',
                    'type' => '2',
                ),
            621770 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '621770',
                    'name' => '中信银行-理财宝IC卡-借记卡',
                    'type' => '2',
                ),
            621772 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '621772',
                    'name' => '中信银行-理财宝IC卡-借记卡',
                    'type' => '2',
                ),
            621773 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '621773',
                    'name' => '中信银行-理财宝IC卡-借记卡',
                    'type' => '2',
                ),
            620527 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '620527',
                    'name' => '中信银行-主账户复合电子现金卡-借记卡',
                    'type' => '2',
                ),
            376968 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '376968',
                    'name' => '中信银行信用卡中心(63020000)-中信贷记卡银联卡-贷记卡',
                    'type' => '1',
                ),
            376969 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '376969',
                    'name' => '中信银行信用卡中心(63020000)-中信贷记卡银联卡-贷记卡',
                    'type' => '1',
                ),
            400360 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '400360',
                    'name' => '中信银行信用卡中心(63020000)-中信贷记卡-贷记卡',
                    'type' => '1',
                ),
            403391 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '403391',
                    'name' => '中信银行信用卡中心(63020000)-中信贷记卡-贷记卡',
                    'type' => '1',
                ),
            403392 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '403392',
                    'name' => '中信银行信用卡中心(63020000)-中信贷记卡-贷记卡',
                    'type' => '1',
                ),
            376966 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '376966',
                    'name' => '中信银行信用卡中心(63020000)-中信贷记卡银联卡-贷记卡',
                    'type' => '1',
                ),
            404158 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '404158',
                    'name' => '中信银行信用卡中心(63020000)-中信贷记卡-贷记卡',
                    'type' => '1',
                ),
            404159 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '404159',
                    'name' => '中信银行信用卡中心(63020000)-中信贷记卡-贷记卡',
                    'type' => '1',
                ),
            404171 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '404171',
                    'name' => '中信银行信用卡中心(63020000)-中信贷记卡-贷记卡',
                    'type' => '1',
                ),
            404172 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '404172',
                    'name' => '中信银行信用卡中心(63020000)-中信贷记卡-贷记卡',
                    'type' => '1',
                ),
            404173 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '404173',
                    'name' => '中信银行信用卡中心(63020000)-中信贷记卡-贷记卡',
                    'type' => '1',
                ),
            404174 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '404174',
                    'name' => '中信银行信用卡中心(63020000)-中信贷记卡-贷记卡',
                    'type' => '1',
                ),
            404157 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '404157',
                    'name' => '中信银行信用卡中心(63020000)-中信贷记卡-贷记卡',
                    'type' => '1',
                ),
            433667 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '433667',
                    'name' => '中信银行信用卡中心(63020000)-中信贷记卡-贷记卡',
                    'type' => '1',
                ),
            433668 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '433668',
                    'name' => '中信银行信用卡中心(63020000)-中信贷记卡-贷记卡',
                    'type' => '1',
                ),
            433669 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '433669',
                    'name' => '中信银行信用卡中心(63020000)-中信贷记卡-贷记卡',
                    'type' => '1',
                ),
            514906 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '514906',
                    'name' => '中信银行信用卡中心(63020000)-中信贷记卡-贷记卡',
                    'type' => '1',
                ),
            403393 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '403393',
                    'name' => '中信银行信用卡中心(63020000)-中信贷记卡-贷记卡',
                    'type' => '1',
                ),
            520108 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '520108',
                    'name' => '中信银行信用卡中心(63020000)-中信贷记卡-贷记卡',
                    'type' => '1',
                ),
            433666 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '433666',
                    'name' => '中信银行信用卡中心(63020000)-中信贷记卡-贷记卡',
                    'type' => '1',
                ),
            558916 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '558916',
                    'name' => '中信银行信用卡中心(63020000)-中信贷记卡-贷记卡',
                    'type' => '1',
                ),
            622678 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '622678',
                    'name' => '中信银行信用卡中心(63020000)-中信银联标准贷记卡-贷记卡',
                    'type' => '1',
                ),
            622679 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '622679',
                    'name' => '中信银行信用卡中心(63020000)-中信银联标准贷记卡-贷记卡',
                    'type' => '1',
                ),
            622680 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '622680',
                    'name' => '中信银行信用卡中心(63020000)-中信银联标准贷记卡-贷记卡',
                    'type' => '1',
                ),
            622688 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '622688',
                    'name' => '中信银行信用卡中心(63020000)-中信银联标准贷记卡-贷记卡',
                    'type' => '1',
                ),
            622689 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '622689',
                    'name' => '中信银行信用卡中心(63020000)-中信银联标准贷记卡-贷记卡',
                    'type' => '1',
                ),
            628206 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '628206',
                    'name' => '中信银行信用卡中心(63020000)-中信银联公务卡-贷记卡',
                    'type' => '1',
                ),
            556617 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '556617',
                    'name' => '中信银行信用卡中心(63020000)-中信贷记卡-贷记卡',
                    'type' => '1',
                ),
            628209 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '628209',
                    'name' => '中信银行信用卡中心(63020000)-中信银联公务卡-贷记卡',
                    'type' => '1',
                ),
            518212 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '518212',
                    'name' => '中信银行信用卡中心(63020000)-中信贷记卡-贷记卡',
                    'type' => '1',
                ),
            628208 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '628208',
                    'name' => '中信银行信用卡中心(63020000)-中信银联公务卡-贷记卡',
                    'type' => '1',
                ),
            356390 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '356390',
                    'name' => '中信银行信用卡中心(63020000)-中信JCB美元卡-贷记卡',
                    'type' => '1',
                ),
            356391 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '356391',
                    'name' => '中信银行信用卡中心(63020000)-中信JCB美元卡-贷记卡',
                    'type' => '1',
                ),
            356392 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '356392',
                    'name' => '中信银行信用卡中心(63020000)-中信JCB美元卡-贷记卡',
                    'type' => '1',
                ),
            622916 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '622916',
                    'name' => '中信银行信用卡中心(63020000)-中信银联IC卡普卡-贷记卡',
                    'type' => '1',
                ),
            622918 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '622918',
                    'name' => '中信银行信用卡中心(63020000)-中信银联IC卡金卡-贷记卡',
                    'type' => '1',
                ),
            622919 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '622919',
                    'name' => '中信银行信用卡中心(63020000)-中信银联IC卡白金卡-贷记卡',
                    'type' => '1',
                ),
            628370 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '628370',
                    'name' => '中信银行信用卡中心(63020000)-公务IC普卡-贷记卡',
                    'type' => '1',
                ),
            628371 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '628371',
                    'name' => '中信银行信用卡中心(63020000)-公务IC金卡-贷记卡',
                    'type' => '1',
                ),
            628372 =>
                array(
                    'bank_id' => '14',
                    'card_bin' => '628372',
                    'name' => '中信银行信用卡中心(63020000)-公务IC白金卡-贷记卡',
                    'type' => '1',
                ),
            999999 =>
                array(
                    'bank_id' => '15',
                    'card_bin' => '999999',
                    'name' => '华夏银行-华夏卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            621222 =>
                array(
                    'bank_id' => '15',
                    'card_bin' => '621222',
                    'name' => '华夏银行-华夏白金卡-借记卡',
                    'type' => '2',
                ),
            623020 =>
                array(
                    'bank_id' => '15',
                    'card_bin' => '623020',
                    'name' => '华夏银行-华夏普卡-借记卡',
                    'type' => '2',
                ),
            623021 =>
                array(
                    'bank_id' => '15',
                    'card_bin' => '623021',
                    'name' => '华夏银行-华夏金卡-借记卡',
                    'type' => '2',
                ),
            623022 =>
                array(
                    'bank_id' => '15',
                    'card_bin' => '623022',
                    'name' => '华夏银行-华夏白金卡-借记卡',
                    'type' => '2',
                ),
            623023 =>
                array(
                    'bank_id' => '15',
                    'card_bin' => '623023',
                    'name' => '华夏银行-华夏钻石卡-借记卡',
                    'type' => '2',
                ),
            622630 =>
                array(
                    'bank_id' => '15',
                    'card_bin' => '622630',
                    'name' => '华夏银行-华夏卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622631 =>
                array(
                    'bank_id' => '15',
                    'card_bin' => '622631',
                    'name' => '华夏银行-华夏至尊金卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622632 =>
                array(
                    'bank_id' => '15',
                    'card_bin' => '622632',
                    'name' => '华夏银行-华夏丽人卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622633 =>
                array(
                    'bank_id' => '15',
                    'card_bin' => '622633',
                    'name' => '华夏银行-华夏万通卡-借记卡',
                    'type' => '2',
                ),
            523959 =>
                array(
                    'bank_id' => '15',
                    'card_bin' => '523959',
                    'name' => '华夏银行(63040000)-华夏万事达信用卡-贷记卡',
                    'type' => '1',
                ),
            528709 =>
                array(
                    'bank_id' => '15',
                    'card_bin' => '528709',
                    'name' => '华夏银行(63040000)-万事达信用卡金卡-贷记卡',
                    'type' => '1',
                ),
            539867 =>
                array(
                    'bank_id' => '15',
                    'card_bin' => '539867',
                    'name' => '华夏银行(63040000)-万事达普卡-贷记卡',
                    'type' => '1',
                ),
            539868 =>
                array(
                    'bank_id' => '15',
                    'card_bin' => '539868',
                    'name' => '华夏银行(63040000)-万事达普卡-贷记卡',
                    'type' => '1',
                ),
            622637 =>
                array(
                    'bank_id' => '15',
                    'card_bin' => '622637',
                    'name' => '华夏银行(63040000)-华夏信用卡金卡-贷记卡',
                    'type' => '1',
                ),
            622638 =>
                array(
                    'bank_id' => '15',
                    'card_bin' => '622638',
                    'name' => '华夏银行(63040000)-华夏白金卡-贷记卡',
                    'type' => '1',
                ),
            628318 =>
                array(
                    'bank_id' => '15',
                    'card_bin' => '628318',
                    'name' => '华夏银行(63040000)-华夏公务信用卡-贷记卡',
                    'type' => '1',
                ),
            528708 =>
                array(
                    'bank_id' => '15',
                    'card_bin' => '528708',
                    'name' => '华夏银行(63040000)-万事达信用卡金卡-贷记卡',
                    'type' => '1',
                ),
            622636 =>
                array(
                    'bank_id' => '15',
                    'card_bin' => '622636',
                    'name' => '华夏银行(63040000)-华夏信用卡普卡-贷记卡',
                    'type' => '1',
                ),
            625967 =>
                array(
                    'bank_id' => '15',
                    'card_bin' => '625967',
                    'name' => '华夏银行(63040000)-华夏标准金融IC信用卡-贷记卡',
                    'type' => '1',
                ),
            625968 =>
                array(
                    'bank_id' => '15',
                    'card_bin' => '625968',
                    'name' => '华夏银行(63040000)-华夏标准金融IC信用卡-贷记卡',
                    'type' => '1',
                ),
            625969 =>
                array(
                    'bank_id' => '15',
                    'card_bin' => '625969',
                    'name' => '华夏银行(63040000)-华夏标准金融IC信用卡-贷记卡',
                    'type' => '1',
                ),
            356851 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '356851',
                    'name' => '浦发银行-浦发JCB金卡-贷记卡',
                    'type' => '1',
                ),
            356852 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '356852',
                    'name' => '浦发银行-浦发JCB白金卡-贷记卡',
                    'type' => '1',
                ),
            404738 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '404738',
                    'name' => '浦发银行-信用卡VISA普通-贷记卡',
                    'type' => '1',
                ),
            404739 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '404739',
                    'name' => '浦发银行-信用卡VISA金卡-贷记卡',
                    'type' => '1',
                ),
            456418 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '456418',
                    'name' => '浦发银行-浦发银行VISA年青卡-贷记卡',
                    'type' => '1',
                ),
            498451 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '498451',
                    'name' => '浦发银行-VISA白金信用卡-贷记卡',
                    'type' => '1',
                ),
            515672 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '515672',
                    'name' => '浦发银行-浦发万事达白金卡-贷记卡',
                    'type' => '1',
                ),
            356850 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '356850',
                    'name' => '浦发银行-浦发JCB普卡-贷记卡',
                    'type' => '1',
                ),
            517650 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '517650',
                    'name' => '浦发银行-浦发万事达金卡-贷记卡',
                    'type' => '1',
                ),
            525998 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '525998',
                    'name' => '浦发银行-浦发万事达普卡-贷记卡',
                    'type' => '1',
                ),
            622177 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '622177',
                    'name' => '浦发银行-浦发单币卡-贷记卡',
                    'type' => '1',
                ),
            622277 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '622277',
                    'name' => '浦发银行-浦发银联单币麦兜普卡-贷记卡',
                    'type' => '1',
                ),
            622516 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '622516',
                    'name' => '浦发银行-东方轻松理财卡-借记卡',
                    'type' => '2',
                ),
            622518 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '622518',
                    'name' => '浦发银行-东方轻松理财卡-借记卡',
                    'type' => '2',
                ),
            622520 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '622520',
                    'name' => '浦发银行-东方轻松理财智业金卡-准贷记卡',
                    'type' => '1',
                ),
            622521 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '622521',
                    'name' => '浦发银行-东方卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622522 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '622522',
                    'name' => '浦发银行-东方卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622523 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '622523',
                    'name' => '浦发银行-东方卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            628222 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '628222',
                    'name' => '浦发银行-公务卡金卡-贷记卡',
                    'type' => '1',
                ),
            84301 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '84301',
                    'name' => '浦发银行-东方卡-借记卡',
                    'type' => '2',
                ),
            84336 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '84336',
                    'name' => '浦发银行-东方卡-借记卡',
                    'type' => '2',
                ),
            84373 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '84373',
                    'name' => '浦发银行-东方卡-借记卡',
                    'type' => '2',
                ),
            628221 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '628221',
                    'name' => '浦发银行-公务卡普卡-贷记卡',
                    'type' => '1',
                ),
            84385 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '84385',
                    'name' => '浦发银行-东方卡-借记卡',
                    'type' => '2',
                ),
            84390 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '84390',
                    'name' => '浦发银行-东方卡-借记卡',
                    'type' => '2',
                ),
            87000 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '87000',
                    'name' => '浦发银行-东方卡-借记卡',
                    'type' => '2',
                ),
            87010 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '87010',
                    'name' => '浦发银行-东方卡-借记卡',
                    'type' => '2',
                ),
            87030 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '87030',
                    'name' => '浦发银行-东方卡-借记卡',
                    'type' => '2',
                ),
            87040 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '87040',
                    'name' => '浦发银行-东方卡-借记卡',
                    'type' => '2',
                ),
            84380 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '84380',
                    'name' => '浦发银行-东方卡-借记卡',
                    'type' => '2',
                ),
            984301 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '984301',
                    'name' => '浦发银行-东方卡-借记卡',
                    'type' => '2',
                ),
            984303 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '984303',
                    'name' => '浦发银行-东方卡-借记卡',
                    'type' => '2',
                ),
            84361 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '84361',
                    'name' => '浦发银行-东方卡-借记卡',
                    'type' => '2',
                ),
            87050 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '87050',
                    'name' => '浦发银行-东方卡-借记卡',
                    'type' => '2',
                ),
            622176 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '622176',
                    'name' => '浦发银行-浦发单币卡-贷记卡',
                    'type' => '1',
                ),
            622276 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '622276',
                    'name' => '浦发银行-浦发联名信用卡-贷记卡',
                    'type' => '1',
                ),
            622228 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '622228',
                    'name' => '浦发银行-浦发银联白金卡-贷记卡',
                    'type' => '1',
                ),
            621352 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '621352',
                    'name' => '浦发银行-轻松理财普卡-借记卡',
                    'type' => '2',
                ),
            621351 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '621351',
                    'name' => '浦发银行-移动联名卡-借记卡',
                    'type' => '2',
                ),
            621390 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '621390',
                    'name' => '浦发银行-轻松理财消贷易卡-借记卡',
                    'type' => '2',
                ),
            621792 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '621792',
                    'name' => '浦发银行-轻松理财普卡（复合卡）-借记卡',
                    'type' => '2',
                ),
            625957 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '625957',
                    'name' => '浦发银行-贷记卡-贷记卡',
                    'type' => '1',
                ),
            625958 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '625958',
                    'name' => '浦发银行-贷记卡-贷记卡',
                    'type' => '1',
                ),
            621791 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '621791',
                    'name' => '浦发银行-东方借记卡（复合卡）-借记卡',
                    'type' => '2',
                ),
            84342 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '84342',
                    'name' => '浦发银行-东方卡-借记卡',
                    'type' => '2',
                ),
            620530 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '620530',
                    'name' => '浦发银行-电子现金卡（IC卡）-预付费卡',
                    'type' => '3',
                ),
            625993 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '625993',
                    'name' => '浦发银行-移动浦发联名卡-贷记卡',
                    'type' => '1',
                ),
            622519 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '622519',
                    'name' => '浦发银行-东方-标准准贷记卡-准贷记卡',
                    'type' => '1',
                ),
            621793 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '621793',
                    'name' => '浦发银行-轻松理财金卡（复合卡）-借记卡',
                    'type' => '2',
                ),
            621795 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '621795',
                    'name' => '浦发银行-轻松理财白金卡（复合卡）-借记卡',
                    'type' => '2',
                ),
            621796 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '621796',
                    'name' => '浦发银行-轻松理财钻石卡（复合卡）-借记卡',
                    'type' => '2',
                ),
            622500 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '622500',
                    'name' => '浦发银行-东方卡-贷记卡',
                    'type' => '1',
                ),
            625971 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '625971',
                    'name' => '浦发银行信用卡中心(63100000)-移动浦发借贷合一联名卡-贷记卡',
                    'type' => '1',
                ),
            625970 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '625970',
                    'name' => '浦发银行信用卡中心(63100000)-贷记卡-贷记卡',
                    'type' => '1',
                ),
            377187 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '377187',
                    'name' => '浦发银行信用卡中心(63100000)-浦发私人银行信用卡-贷记卡',
                    'type' => '1',
                ),
            625831 =>
                array(
                    'bank_id' => '16',
                    'card_bin' => '625831',
                    'name' => '浦发银行信用卡中心(63100000)-中国移动浦发银行联名手机卡-贷记卡',
                    'type' => '1',
                ),
            412963 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '412963',
                    'name' => '平安银行（借记卡）-发展借记卡-借记卡',
                    'type' => '2',
                ),
            415752 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '415752',
                    'name' => '平安银行（借记卡）-国际借记卡-借记卡',
                    'type' => '2',
                ),
            415753 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '415753',
                    'name' => '平安银行（借记卡）-国际借记卡-借记卡',
                    'type' => '2',
                ),
            622535 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '622535',
                    'name' => '平安银行（借记卡）-聚财卡金卡-借记卡',
                    'type' => '2',
                ),
            622536 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '622536',
                    'name' => '平安银行（借记卡）-聚财卡VIP金卡-借记卡',
                    'type' => '2',
                ),
            622538 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '622538',
                    'name' => '平安银行（借记卡）-发展卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622539 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '622539',
                    'name' => '平安银行（借记卡）-聚财卡白金卡和钻石卡-借记卡',
                    'type' => '2',
                ),
            998800 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '998800',
                    'name' => '平安银行（借记卡）-发展借记卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            412962 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '412962',
                    'name' => '平安银行（借记卡）-发展借记卡-借记卡',
                    'type' => '2',
                ),
            622983 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '622983',
                    'name' => '平安银行（借记卡）-聚财卡钻石卡-借记卡',
                    'type' => '2',
                ),
            620010 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '620010',
                    'name' => '平安银行（借记卡）-公益预付卡-预付费卡',
                    'type' => '3',
                ),
            621626 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '621626',
                    'name' => '平安银行-新磁条借记卡-借记卡',
                    'type' => '2',
                ),
            623058 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '623058',
                    'name' => '平安银行-平安银行IC借记卡-借记卡',
                    'type' => '2',
                ),
            602907 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '602907',
                    'name' => '平安银行-万事顺卡-借记卡',
                    'type' => '2',
                ),
            622986 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '622986',
                    'name' => '平安银行-平安银行借记卡-借记卡',
                    'type' => '2',
                ),
            622989 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '622989',
                    'name' => '平安银行-平安银行借记卡-借记卡',
                    'type' => '2',
                ),
            622298 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '622298',
                    'name' => '平安银行-万事顺借记卡-借记卡',
                    'type' => '2',
                ),
            531659 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '531659',
                    'name' => '平安银行股份有限公司-白金信用卡-贷记卡',
                    'type' => '1',
                ),
            622157 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '622157',
                    'name' => '平安银行股份有限公司-白金信用卡-贷记卡',
                    'type' => '1',
                ),
            435744 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '435744',
                    'name' => '平安银行股份有限公司-沃尔玛百分卡-贷记卡',
                    'type' => '1',
                ),
            435745 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '435745',
                    'name' => '平安银行股份有限公司-沃尔玛百分卡-贷记卡',
                    'type' => '1',
                ),
            483536 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '483536',
                    'name' => '平安银行股份有限公司-VISA白金卡-贷记卡',
                    'type' => '1',
                ),
            622525 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '622525',
                    'name' => '平安银行股份有限公司-人民币信用卡金卡-贷记卡',
                    'type' => '1',
                ),
            622526 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '622526',
                    'name' => '平安银行股份有限公司-人民币信用卡普卡-贷记卡',
                    'type' => '1',
                ),
            998801 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '998801',
                    'name' => '平安银行股份有限公司-发展信用卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            998802 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '998802',
                    'name' => '平安银行股份有限公司-发展信用卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            528020 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '528020',
                    'name' => '平安银行股份有限公司-平安银行信用卡-贷记卡',
                    'type' => '1',
                ),
            622155 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '622155',
                    'name' => '平安银行股份有限公司-平安银行信用卡-贷记卡',
                    'type' => '1',
                ),
            622156 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '622156',
                    'name' => '平安银行股份有限公司-平安银行信用卡-贷记卡',
                    'type' => '1',
                ),
            526855 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '526855',
                    'name' => '平安银行股份有限公司-平安银行信用卡-贷记卡',
                    'type' => '1',
                ),
            356869 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '356869',
                    'name' => '平安银行股份有限公司-信用卡-贷记卡',
                    'type' => '1',
                ),
            356868 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '356868',
                    'name' => '平安银行股份有限公司-信用卡-贷记卡',
                    'type' => '1',
                ),
            625360 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '625360',
                    'name' => '平安银行股份有限公司-平安中国旅游信用卡-贷记卡',
                    'type' => '1',
                ),
            625361 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '625361',
                    'name' => '平安银行股份有限公司-平安中国旅游白金信用卡-贷记卡',
                    'type' => '1',
                ),
            628296 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '628296',
                    'name' => '平安银行股份有限公司-公务卡-贷记卡',
                    'type' => '1',
                ),
            625825 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '625825',
                    'name' => '平安银行股份有限公司-白金IC卡-贷记卡',
                    'type' => '1',
                ),
            625823 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '625823',
                    'name' => '平安银行股份有限公司-贷记IC卡-贷记卡',
                    'type' => '1',
                ),
            627069 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '627069',
                    'name' => '平安银行股份有限公司-一账通借贷合一钻石卡-借记卡',
                    'type' => '2',
                ),
            627068 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '627068',
                    'name' => '平安银行股份有限公司-一账通借贷合一白金卡-借记卡',
                    'type' => '2',
                ),
            627066 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '627066',
                    'name' => '平安银行股份有限公司-一账通借贷合一卡普卡-借记卡',
                    'type' => '2',
                ),
            627067 =>
                array(
                    'bank_id' => '17',
                    'card_bin' => '627067',
                    'name' => '平安银行股份有限公司-一账通借贷合一卡金卡-借记卡',
                    'type' => '2',
                ),
            406365 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '406365',
                    'name' => '广发银行股份有限公司-广发VISA信用卡-贷记卡',
                    'type' => '1',
                ),
            406366 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '406366',
                    'name' => '广发银行股份有限公司-广发VISA信用卡-贷记卡',
                    'type' => '1',
                ),
            428911 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '428911',
                    'name' => '广发银行股份有限公司-广发信用卡-贷记卡',
                    'type' => '1',
                ),
            436768 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '436768',
                    'name' => '广发银行股份有限公司-广发信用卡-贷记卡',
                    'type' => '1',
                ),
            436769 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '436769',
                    'name' => '广发银行股份有限公司-广发信用卡-贷记卡',
                    'type' => '1',
                ),
            487013 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '487013',
                    'name' => '广发银行股份有限公司-广发VISA信用卡-贷记卡',
                    'type' => '1',
                ),
            491032 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '491032',
                    'name' => '广发银行股份有限公司-广发信用卡-贷记卡',
                    'type' => '1',
                ),
            491034 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '491034',
                    'name' => '广发银行股份有限公司-广发信用卡-贷记卡',
                    'type' => '1',
                ),
            491035 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '491035',
                    'name' => '广发银行股份有限公司-广发信用卡-贷记卡',
                    'type' => '1',
                ),
            491036 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '491036',
                    'name' => '广发银行股份有限公司-广发信用卡-贷记卡',
                    'type' => '1',
                ),
            491037 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '491037',
                    'name' => '广发银行股份有限公司-广发信用卡-贷记卡',
                    'type' => '1',
                ),
            491038 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '491038',
                    'name' => '广发银行股份有限公司-广发信用卡-贷记卡',
                    'type' => '1',
                ),
            518364 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '518364',
                    'name' => '广发银行股份有限公司-广发信用卡-贷记卡',
                    'type' => '1',
                ),
            520152 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '520152',
                    'name' => '广发银行股份有限公司-广发万事达信用卡-贷记卡',
                    'type' => '1',
                ),
            520382 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '520382',
                    'name' => '广发银行股份有限公司-广发万事达信用卡-贷记卡',
                    'type' => '1',
                ),
            548844 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '548844',
                    'name' => '广发银行股份有限公司-广发信用卡-贷记卡',
                    'type' => '1',
                ),
            552794 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '552794',
                    'name' => '广发银行股份有限公司-广发万事达信用卡-贷记卡',
                    'type' => '1',
                ),
            622555 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '622555',
                    'name' => '广发银行股份有限公司-广发银联标准金卡-贷记卡',
                    'type' => '1',
                ),
            622556 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '622556',
                    'name' => '广发银行股份有限公司-广发银联标准普卡-贷记卡',
                    'type' => '1',
                ),
            622557 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '622557',
                    'name' => '广发银行股份有限公司-广发银联标准真情金卡-贷记卡',
                    'type' => '1',
                ),
            622558 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '622558',
                    'name' => '广发银行股份有限公司-广发银联标准白金卡-贷记卡',
                    'type' => '1',
                ),
            622559 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '622559',
                    'name' => '广发银行股份有限公司-广发银联标准真情普卡-贷记卡',
                    'type' => '1',
                ),
            622560 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '622560',
                    'name' => '广发银行股份有限公司-广发真情白金卡-贷记卡',
                    'type' => '1',
                ),
            622568 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '622568',
                    'name' => '广发银行股份有限公司-广发理财通卡-借记卡',
                    'type' => '2',
                ),
            528931 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '528931',
                    'name' => '广发银行股份有限公司-广发万事达信用卡-贷记卡',
                    'type' => '1',
                ),
            9111 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '9111',
                    'name' => '广发银行股份有限公司-广发理财通(银联卡)-借记卡',
                    'type' => '2',
                ),
            558894 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '558894',
                    'name' => '广发银行股份有限公司-广发万事达信用卡-贷记卡',
                    'type' => '1',
                ),
            625072 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '625072',
                    'name' => '广发银行股份有限公司-银联标准金卡-贷记卡',
                    'type' => '1',
                ),
            625071 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '625071',
                    'name' => '广发银行股份有限公司-银联标准普卡-贷记卡',
                    'type' => '1',
                ),
            628260 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '628260',
                    'name' => '广发银行股份有限公司-银联公务金卡-贷记卡',
                    'type' => '1',
                ),
            628259 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '628259',
                    'name' => '广发银行股份有限公司-银联公务普卡-贷记卡',
                    'type' => '1',
                ),
            621462 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '621462',
                    'name' => '广发银行股份有限公司-理财通卡-借记卡',
                    'type' => '2',
                ),
            625805 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '625805',
                    'name' => '广发银行股份有限公司-银联真情普卡-贷记卡',
                    'type' => '1',
                ),
            625806 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '625806',
                    'name' => '广发银行股份有限公司-银联真情金卡-贷记卡',
                    'type' => '1',
                ),
            625807 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '625807',
                    'name' => '广发银行股份有限公司-银联真情白金卡-贷记卡',
                    'type' => '1',
                ),
            625808 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '625808',
                    'name' => '广发银行股份有限公司-银联标准普卡-贷记卡',
                    'type' => '1',
                ),
            625809 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '625809',
                    'name' => '广发银行股份有限公司-银联标准金卡-贷记卡',
                    'type' => '1',
                ),
            625810 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '625810',
                    'name' => '广发银行股份有限公司-银联标准白金卡-贷记卡',
                    'type' => '1',
                ),
            685800 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '685800',
                    'name' => '广发银行股份有限公司-广发万事达信用卡-贷记卡',
                    'type' => '1',
                ),
            620037 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '620037',
                    'name' => '广发银行股份有限公司-广发青年银行预付卡-预付费卡',
                    'type' => '3',
                ),
            6858000 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '6858000',
                    'name' => '广发银行股份有限公司-广发理财通-贷记卡',
                    'type' => '1',
                ),
            6858001 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '6858001',
                    'name' => '广发银行股份有限公司-广发理财通-借记卡',
                    'type' => '2',
                ),
            6858009 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '6858009',
                    'name' => '广发银行股份有限公司-广发理财通-借记卡',
                    'type' => '2',
                ),
            623506 =>
                array(
                    'bank_id' => '18',
                    'card_bin' => '623506',
                    'name' => '广发银行股份有限公司-广发财富管理多币IC卡-借记卡',
                    'type' => '2',
                ),
            90592 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '90592',
                    'name' => '兴业银行-兴业卡-借记卡',
                    'type' => '2',
                ),
            966666 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '966666',
                    'name' => '兴业银行-兴业卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622909 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '622909',
                    'name' => '兴业银行-兴业卡(银联标准卡)-借记卡',
                    'type' => '2',
                ),
            622908 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '622908',
                    'name' => '兴业银行-兴业自然人生理财卡-借记卡',
                    'type' => '2',
                ),
            438588 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '438588',
                    'name' => '兴业银行-兴业智能卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            438589 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '438589',
                    'name' => '兴业银行-兴业智能卡-借记卡',
                    'type' => '2',
                ),
            461982 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '461982',
                    'name' => '兴业银行-visa标准双币个人普卡-贷记卡',
                    'type' => '1',
                ),
            486493 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '486493',
                    'name' => '兴业银行-VISA商务普卡-贷记卡',
                    'type' => '1',
                ),
            486494 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '486494',
                    'name' => '兴业银行-VISA商务金卡-贷记卡',
                    'type' => '1',
                ),
            486861 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '486861',
                    'name' => '兴业银行-VISA运动白金信用卡-贷记卡',
                    'type' => '1',
                ),
            523036 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '523036',
                    'name' => '兴业银行-万事达信用卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            451289 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '451289',
                    'name' => '兴业银行-VISA信用卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            527414 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '527414',
                    'name' => '兴业银行-加菲猫信用卡-贷记卡',
                    'type' => '1',
                ),
            528057 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '528057',
                    'name' => '兴业银行-个人白金卡-贷记卡',
                    'type' => '1',
                ),
            622901 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '622901',
                    'name' => '兴业银行-银联信用卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            622922 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '622922',
                    'name' => '兴业银行-银联白金信用卡-贷记卡',
                    'type' => '1',
                ),
            628212 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '628212',
                    'name' => '兴业银行-银联标准公务卡-贷记卡',
                    'type' => '1',
                ),
            451290 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '451290',
                    'name' => '兴业银行-VISA信用卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            524070 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '524070',
                    'name' => '兴业银行-万事达信用卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            625084 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '625084',
                    'name' => '兴业银行-银联标准贷记普卡-贷记卡',
                    'type' => '1',
                ),
            625085 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '625085',
                    'name' => '兴业银行-银联标准贷记金卡-贷记卡',
                    'type' => '1',
                ),
            625086 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '625086',
                    'name' => '兴业银行-银联标准贷记金卡-贷记卡',
                    'type' => '1',
                ),
            625087 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '625087',
                    'name' => '兴业银行-银联标准贷记金卡-贷记卡',
                    'type' => '1',
                ),
            548738 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '548738',
                    'name' => '兴业银行-兴业信用卡-贷记卡',
                    'type' => '1',
                ),
            549633 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '549633',
                    'name' => '兴业银行-兴业信用卡-贷记卡',
                    'type' => '1',
                ),
            552398 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '552398',
                    'name' => '兴业银行-兴业信用卡-贷记卡',
                    'type' => '1',
                ),
            625082 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '625082',
                    'name' => '兴业银行-银联标准贷记普卡-贷记卡',
                    'type' => '1',
                ),
            625083 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '625083',
                    'name' => '兴业银行-银联标准贷记普卡-贷记卡',
                    'type' => '1',
                ),
            625960 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '625960',
                    'name' => '兴业银行-兴业芯片普卡-贷记卡',
                    'type' => '1',
                ),
            625961 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '625961',
                    'name' => '兴业银行-兴业芯片金卡-贷记卡',
                    'type' => '1',
                ),
            625962 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '625962',
                    'name' => '兴业银行-兴业芯片白金卡-贷记卡',
                    'type' => '1',
                ),
            625963 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '625963',
                    'name' => '兴业银行-兴业芯片钻石卡-贷记卡',
                    'type' => '1',
                ),
            621245 =>
                array(
                    'bank_id' => '19',
                    'card_bin' => '621245',
                    'name' => '法国兴业银行（中国）-法兴标准借记卡-借记卡',
                    'type' => '2',
                ),
            621019 =>
                array(
                    'bank_id' => '20',
                    'card_bin' => '621019',
                    'name' => '浙商银行-商卡-借记卡',
                    'type' => '2',
                ),
            6223091100 =>
                array(
                    'bank_id' => '20',
                    'card_bin' => '6223091100',
                    'name' => '浙商银行天津分行-商卡-借记卡',
                    'type' => '2',
                ),
            6223092900 =>
                array(
                    'bank_id' => '20',
                    'card_bin' => '6223092900',
                    'name' => '浙商银行上海分行-商卡-借记卡',
                    'type' => '2',
                ),
            6223093310 =>
                array(
                    'bank_id' => '20',
                    'card_bin' => '6223093310',
                    'name' => '浙商银行营业部-商卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            6223093320 =>
                array(
                    'bank_id' => '20',
                    'card_bin' => '6223093320',
                    'name' => '浙商银行宁波分行-商卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            6223093330 =>
                array(
                    'bank_id' => '20',
                    'card_bin' => '6223093330',
                    'name' => '浙商银行温州分行-商卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            6223093370 =>
                array(
                    'bank_id' => '20',
                    'card_bin' => '6223093370',
                    'name' => '浙商银行绍兴分行-商卡-借记卡',
                    'type' => '2',
                ),
            6223093380 =>
                array(
                    'bank_id' => '20',
                    'card_bin' => '6223093380',
                    'name' => '浙商银行义乌分行-商卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            6223096510 =>
                array(
                    'bank_id' => '20',
                    'card_bin' => '6223096510',
                    'name' => '浙商银行成都分行-商卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            6223097910 =>
                array(
                    'bank_id' => '20',
                    'card_bin' => '6223097910',
                    'name' => '浙商银行西安分行-商卡-借记卡',
                    'type' => '2',
                ),
            621268 =>
                array(
                    'bank_id' => '21',
                    'card_bin' => '621268',
                    'name' => '渤海银行-浩瀚金卡-借记卡',
                    'type' => '2',
                ),
            622884 =>
                array(
                    'bank_id' => '21',
                    'card_bin' => '622884',
                    'name' => '渤海银行-渤海银行借记卡-借记卡',
                    'type' => '2',
                ),
            621453 =>
                array(
                    'bank_id' => '21',
                    'card_bin' => '621453',
                    'name' => '渤海银行-金融IC卡-借记卡',
                    'type' => '2',
                ),
            622684 =>
                array(
                    'bank_id' => '21',
                    'card_bin' => '622684',
                    'name' => '渤海银行-渤海银行公司借记卡-借记卡',
                    'type' => '2',
                ),
            623078 =>
                array(
                    'bank_id' => '22',
                    'card_bin' => '623078',
                    'name' => '恒丰银行-九州IC卡-借记卡',
                    'type' => '2',
                ),
            622384 =>
                array(
                    'bank_id' => '22',
                    'card_bin' => '622384',
                    'name' => '恒丰银行-九州借记卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            940034 =>
                array(
                    'bank_id' => '22',
                    'card_bin' => '940034',
                    'name' => '恒丰银行-九州借记卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622413 =>
                array(
                    'bank_id' => '23',
                    'card_bin' => '622413',
                    'name' => '鞍山银行-千山卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            940002 =>
                array(
                    'bank_id' => '23',
                    'card_bin' => '940002',
                    'name' => '鞍山银行-千山卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            623188 =>
                array(
                    'bank_id' => '23',
                    'card_bin' => '623188',
                    'name' => '鞍山银行-千山卡-借记卡',
                    'type' => '2',
                ),
            622336 =>
                array(
                    'bank_id' => '24',
                    'card_bin' => '622336',
                    'name' => '包商银行-雄鹰卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622165 =>
                array(
                    'bank_id' => '24',
                    'card_bin' => '622165',
                    'name' => '包商银行-包头市商业银行借记卡-借记卡',
                    'type' => '2',
                ),
            628295 =>
                array(
                    'bank_id' => '24',
                    'card_bin' => '628295',
                    'name' => '包商银行-包商银行内蒙古自治区公务卡-贷记卡',
                    'type' => '1',
                ),
            625950 =>
                array(
                    'bank_id' => '24',
                    'card_bin' => '625950',
                    'name' => '包商银行-贷记卡-贷记卡',
                    'type' => '1',
                ),
            621760 =>
                array(
                    'bank_id' => '24',
                    'card_bin' => '621760',
                    'name' => '包商银行-借记卡-借记卡',
                    'type' => '2',
                ),
            621091 =>
                array(
                    'bank_id' => '25',
                    'card_bin' => '621091',
                    'name' => '保定银行-直隶卡-借记卡',
                    'type' => '2',
                ),
            623168 =>
                array(
                    'bank_id' => '25',
                    'card_bin' => '623168',
                    'name' => '保定银行-直隶卡-借记卡',
                    'type' => '2',
                ),
            421317 =>
                array(
                    'bank_id' => '26',
                    'card_bin' => '421317',
                    'name' => '北京银行-京卡借记卡-借记卡',
                    'type' => '2',
                ),
            602969 =>
                array(
                    'bank_id' => '26',
                    'card_bin' => '602969',
                    'name' => '北京银行-京卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            621030 =>
                array(
                    'bank_id' => '26',
                    'card_bin' => '621030',
                    'name' => '北京银行-京卡借记卡-借记卡',
                    'type' => '2',
                ),
            621420 =>
                array(
                    'bank_id' => '26',
                    'card_bin' => '621420',
                    'name' => '北京银行-京卡-借记卡',
                    'type' => '2',
                ),
            621468 =>
                array(
                    'bank_id' => '26',
                    'card_bin' => '621468',
                    'name' => '北京银行-京卡-借记卡',
                    'type' => '2',
                ),
            623111 =>
                array(
                    'bank_id' => '26',
                    'card_bin' => '623111',
                    'name' => '北京银行-借记IC卡-借记卡',
                    'type' => '2',
                ),
            422160 =>
                array(
                    'bank_id' => '26',
                    'card_bin' => '422160',
                    'name' => '北京银行-京卡贵宾金卡-借记卡',
                    'type' => '2',
                ),
            422161 =>
                array(
                    'bank_id' => '26',
                    'card_bin' => '422161',
                    'name' => '北京银行-京卡贵宾白金卡-借记卡',
                    'type' => '2',
                ),
            522001 =>
                array(
                    'bank_id' => '26',
                    'card_bin' => '522001',
                    'name' => '北京银行(64031000)-万事达双币金卡-贷记卡',
                    'type' => '1',
                ),
            622163 =>
                array(
                    'bank_id' => '26',
                    'card_bin' => '622163',
                    'name' => '北京银行(64031000)-银联标准贷记卡-贷记卡',
                    'type' => '1',
                ),
            622853 =>
                array(
                    'bank_id' => '26',
                    'card_bin' => '622853',
                    'name' => '北京银行(64031000)-银联标准贷记卡-贷记卡',
                    'type' => '1',
                ),
            628203 =>
                array(
                    'bank_id' => '26',
                    'card_bin' => '628203',
                    'name' => '北京银行(64031000)-银联标准公务卡-贷记卡',
                    'type' => '1',
                ),
            622851 =>
                array(
                    'bank_id' => '26',
                    'card_bin' => '622851',
                    'name' => '北京银行(64031000)-北京银行中荷人寿联名卡-贷记卡',
                    'type' => '1',
                ),
            622852 =>
                array(
                    'bank_id' => '26',
                    'card_bin' => '622852',
                    'name' => '北京银行(64031000)-尊尚白金卡-贷记卡',
                    'type' => '1',
                ),
            621696 =>
                array(
                    'bank_id' => '27',
                    'card_bin' => '621696',
                    'name' => '本溪市商业银行-借记卡-借记卡',
                    'type' => '2',
                ),
            621266 =>
                array(
                    'bank_id' => '28',
                    'card_bin' => '621266',
                    'name' => '沧州银行股份有限公司-狮城卡-借记卡',
                    'type' => '2',
                ),
            62249804 =>
                array(
                    'bank_id' => '28',
                    'card_bin' => '62249804',
                    'name' => '沧州银行股份有限公司-狮城卡-借记卡',
                    'type' => '2',
                ),
            94004604 =>
                array(
                    'bank_id' => '28',
                    'card_bin' => '94004604',
                    'name' => '沧州银行股份有限公司-狮城卡-借记卡',
                    'type' => '2',
                ),
            621422 =>
                array(
                    'bank_id' => '28',
                    'card_bin' => '621422',
                    'name' => '沧州银行-狮城卡-借记卡',
                    'type' => '2',
                ),
            621296 =>
                array(
                    'bank_id' => '29',
                    'card_bin' => '621296',
                    'name' => '长安银行-长长卡-借记卡',
                    'type' => '2',
                ),
            621448 =>
                array(
                    'bank_id' => '29',
                    'card_bin' => '621448',
                    'name' => '长安银行-借记IC卡-借记卡',
                    'type' => '2',
                ),
            694301 =>
                array(
                    'bank_id' => '30',
                    'card_bin' => '694301',
                    'name' => '长沙银行股份有限公司-芙蓉卡-借记卡',
                    'type' => '2',
                ),
            940071 =>
                array(
                    'bank_id' => '30',
                    'card_bin' => '940071',
                    'name' => '长沙银行股份有限公司-芙蓉卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622368 =>
                array(
                    'bank_id' => '30',
                    'card_bin' => '622368',
                    'name' => '长沙银行股份有限公司-芙蓉卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            621446 =>
                array(
                    'bank_id' => '30',
                    'card_bin' => '621446',
                    'name' => '长沙银行股份有限公司-芙蓉金融IC卡-借记卡',
                    'type' => '2',
                ),
            625901 =>
                array(
                    'bank_id' => '30',
                    'card_bin' => '625901',
                    'name' => '长沙银行股份有限公司-市民卡-贷记卡',
                    'type' => '1',
                ),
            622898 =>
                array(
                    'bank_id' => '30',
                    'card_bin' => '622898',
                    'name' => '长沙银行股份有限公司-芙蓉贷记卡-贷记卡',
                    'type' => '1',
                ),
            622900 =>
                array(
                    'bank_id' => '30',
                    'card_bin' => '622900',
                    'name' => '长沙银行股份有限公司-芙蓉贷记卡-贷记卡',
                    'type' => '1',
                ),
            628281 =>
                array(
                    'bank_id' => '30',
                    'card_bin' => '628281',
                    'name' => '长沙银行股份有限公司-公务卡钻石卡-贷记卡',
                    'type' => '1',
                ),
            628282 =>
                array(
                    'bank_id' => '30',
                    'card_bin' => '628282',
                    'name' => '长沙银行股份有限公司-公务卡金卡-贷记卡',
                    'type' => '1',
                ),
            628283 =>
                array(
                    'bank_id' => '30',
                    'card_bin' => '628283',
                    'name' => '长沙银行股份有限公司-公务卡普卡-贷记卡',
                    'type' => '1',
                ),
            620519 =>
                array(
                    'bank_id' => '30',
                    'card_bin' => '620519',
                    'name' => '长沙银行股份有限公司-市民卡-预付费卡',
                    'type' => '3',
                ),
            621739 =>
                array(
                    'bank_id' => '30',
                    'card_bin' => '621739',
                    'name' => '长沙银行股份有限公司-借记IC卡-借记卡',
                    'type' => '2',
                ),
            621074 =>
                array(
                    'bank_id' => '32',
                    'card_bin' => '621074',
                    'name' => '朝阳银行-鑫鑫通卡-借记卡',
                    'type' => '2',
                ),
            621515 =>
                array(
                    'bank_id' => '32',
                    'card_bin' => '621515',
                    'name' => '朝阳银行-朝阳银行福农卡-借记卡',
                    'type' => '2',
                ),
            623030 =>
                array(
                    'bank_id' => '32',
                    'card_bin' => '623030',
                    'name' => '朝阳银行-红山卡-借记卡',
                    'type' => '2',
                ),
            623060 =>
                array(
                    'bank_id' => '34',
                    'card_bin' => '623060',
                    'name' => '承德银行-借记IC卡-借记卡',
                    'type' => '2',
                ),
            628229 =>
                array(
                    'bank_id' => '34',
                    'card_bin' => '628229',
                    'name' => '承德银行(65131410)-热河公务卡-贷记卡',
                    'type' => '1',
                ),
            622945 =>
                array(
                    'bank_id' => '35',
                    'card_bin' => '622945',
                    'name' => '重庆三峡银行-财富人生卡-借记卡',
                    'type' => '2',
                ),
            621755 =>
                array(
                    'bank_id' => '35',
                    'card_bin' => '621755',
                    'name' => '重庆三峡银行-借记卡-借记卡',
                    'type' => '2',
                ),
            9896 =>
                array(
                    'bank_id' => '36',
                    'card_bin' => '9896',
                    'name' => '重庆银行-长江卡-借记卡',
                    'type' => '2',
                ),
            622134 =>
                array(
                    'bank_id' => '36',
                    'card_bin' => '622134',
                    'name' => '重庆银行-长江卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            940018 =>
                array(
                    'bank_id' => '36',
                    'card_bin' => '940018',
                    'name' => '重庆银行-长江卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            623016 =>
                array(
                    'bank_id' => '36',
                    'card_bin' => '623016',
                    'name' => '重庆银行-长江卡-借记卡',
                    'type' => '2',
                ),
            623096 =>
                array(
                    'bank_id' => '36',
                    'card_bin' => '623096',
                    'name' => '重庆银行-借记IC卡-借记卡',
                    'type' => '2',
                ),
            622613 =>
                array(
                    'bank_id' => '36',
                    'card_bin' => '622613',
                    'name' => '重庆银行股份有限公司(64416910)-银联标准卡-贷记卡',
                    'type' => '1',
                ),
            628220 =>
                array(
                    'bank_id' => '36',
                    'card_bin' => '628220',
                    'name' => '重庆银行股份有限公司(64416910)-银联标准公务卡-贷记卡',
                    'type' => '1',
                ),
            621233 =>
                array(
                    'bank_id' => '37',
                    'card_bin' => '621233',
                    'name' => '达州市商业银行-锦程卡-借记卡',
                    'type' => '2',
                ),
            603708 =>
                array(
                    'bank_id' => '38',
                    'card_bin' => '603708',
                    'name' => '大连银行-北方明珠卡-借记卡',
                    'type' => '2',
                ),
            622993 =>
                array(
                    'bank_id' => '38',
                    'card_bin' => '622993',
                    'name' => '大连银行-人民币借记卡-借记卡',
                    'type' => '2',
                ),
            623070 =>
                array(
                    'bank_id' => '38',
                    'card_bin' => '623070',
                    'name' => '大连银行-金融IC借记卡-借记卡',
                    'type' => '2',
                ),
            623069 =>
                array(
                    'bank_id' => '38',
                    'card_bin' => '623069',
                    'name' => '大连银行-大连市社会保障卡-借记卡',
                    'type' => '2',
                ),
            623172 =>
                array(
                    'bank_id' => '38',
                    'card_bin' => '623172',
                    'name' => '大连银行-借记IC卡-借记卡',
                    'type' => '2',
                ),
            623173 =>
                array(
                    'bank_id' => '38',
                    'card_bin' => '623173',
                    'name' => '大连银行-借记IC卡-借记卡',
                    'type' => '2',
                ),
            622383 =>
                array(
                    'bank_id' => '38',
                    'card_bin' => '622383',
                    'name' => '大连银行-大连市商业银行贷记卡-贷记卡',
                    'type' => '1',
                ),
            622385 =>
                array(
                    'bank_id' => '38',
                    'card_bin' => '622385',
                    'name' => '大连银行-大连市商业银行贷记卡-贷记卡',
                    'type' => '1',
                ),
            628299 =>
                array(
                    'bank_id' => '38',
                    'card_bin' => '628299',
                    'name' => '大连银行-银联标准公务卡-贷记卡',
                    'type' => '1',
                ),
            622415 =>
                array(
                    'bank_id' => '40',
                    'card_bin' => '622415',
                    'name' => '丹东银行股份有限公司-银杏卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            940060 =>
                array(
                    'bank_id' => '40',
                    'card_bin' => '940060',
                    'name' => '丹东银行股份有限公司-银杏卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            623098 =>
                array(
                    'bank_id' => '40',
                    'card_bin' => '623098',
                    'name' => '丹东银行-借记IC卡-借记卡',
                    'type' => '2',
                ),
            628329 =>
                array(
                    'bank_id' => '40',
                    'card_bin' => '628329',
                    'name' => '丹东银行-丹东银行公务卡-贷记卡',
                    'type' => '1',
                ),
            622937 =>
                array(
                    'bank_id' => '42',
                    'card_bin' => '622937',
                    'name' => '德州银行-长河借记卡-借记卡',
                    'type' => '2',
                ),
            623101 =>
                array(
                    'bank_id' => '42',
                    'card_bin' => '623101',
                    'name' => '德州银行----借记卡',
                    'type' => '2',
                ),
            628397 =>
                array(
                    'bank_id' => '42',
                    'card_bin' => '628397',
                    'name' => '德州银行(65154680)-长河公务卡-贷记卡',
                    'type' => '1',
                ),
            621004 =>
                array(
                    'bank_id' => '44',
                    'card_bin' => '621004',
                    'name' => '东营银行-胜利卡-借记卡',
                    'type' => '2',
                ),
            628217 =>
                array(
                    'bank_id' => '44',
                    'card_bin' => '628217',
                    'name' => '东营银行(65274550)-财政公务卡-贷记卡',
                    'type' => '1',
                ),
            622978 =>
                array(
                    'bank_id' => '45',
                    'card_bin' => '622978',
                    'name' => '鄂尔多斯银行股份有限公司-天骄卡-借记卡',
                    'type' => '2',
                ),
            628253 =>
                array(
                    'bank_id' => '45',
                    'card_bin' => '628253',
                    'name' => '鄂尔多斯银行-天骄公务卡-贷记卡',
                    'type' => '1',
                ),
            623093 =>
                array(
                    'bank_id' => '45',
                    'card_bin' => '623093',
                    'name' => '鄂尔多斯银行股份有限公司-天骄借记复合卡-借记卡',
                    'type' => '2',
                ),
            628378 =>
                array(
                    'bank_id' => '45',
                    'card_bin' => '628378',
                    'name' => '鄂尔多斯银行股份有限公司----贷记卡',
                    'type' => '1',
                ),
            622388 =>
                array(
                    'bank_id' => '46',
                    'card_bin' => '622388',
                    'name' => '福建海峡银行股份有限公司-榕城卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            621267 =>
                array(
                    'bank_id' => '46',
                    'card_bin' => '621267',
                    'name' => '福建海峡银行股份有限公司-福州市民卡-借记卡',
                    'type' => '2',
                ),
            620043 =>
                array(
                    'bank_id' => '46',
                    'card_bin' => '620043',
                    'name' => '福建海峡银行股份有限公司-福州市民卡-预付费卡',
                    'type' => '3',
                ),
            623063 =>
                array(
                    'bank_id' => '46',
                    'card_bin' => '623063',
                    'name' => '福建海峡银行股份有限公司-海福卡（IC卡）-借记卡',
                    'type' => '2',
                ),
            622442 =>
                array(
                    'bank_id' => '47',
                    'card_bin' => '622442',
                    'name' => '抚顺银行股份有限公司-绿叶卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            940053 =>
                array(
                    'bank_id' => '47',
                    'card_bin' => '940053',
                    'name' => '抚顺银行股份有限公司-绿叶卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            623099 =>
                array(
                    'bank_id' => '47',
                    'card_bin' => '623099',
                    'name' => '抚顺银行-借记IC卡-借记卡',
                    'type' => '2',
                ),
            622126 =>
                array(
                    'bank_id' => '48',
                    'card_bin' => '622126',
                    'name' => '阜新银行股份有限公司-金通卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            623166 =>
                array(
                    'bank_id' => '48',
                    'card_bin' => '623166',
                    'name' => '阜新银行-借记IC卡-借记卡',
                    'type' => '2',
                ),
            628231 =>
                array(
                    'bank_id' => '49',
                    'card_bin' => '628231',
                    'name' => '富滇银行(64667310)-富滇公务卡-贷记卡',
                    'type' => '1',
                ),
            621636 =>
                array(
                    'bank_id' => '50',
                    'card_bin' => '621636',
                    'name' => '甘肃银行-神舟兴陇借记卡-借记卡',
                    'type' => '2',
                ),
            623182 =>
                array(
                    'bank_id' => '50',
                    'card_bin' => '623182',
                    'name' => '甘肃银行-甘肃银行神州兴陇IC卡-借记卡',
                    'type' => '2',
                ),
            622967 =>
                array(
                    'bank_id' => '51',
                    'card_bin' => '622967',
                    'name' => '赣州银行股份有限公司-长征卡-借记卡',
                    'type' => '2',
                ),
            940073 =>
                array(
                    'bank_id' => '51',
                    'card_bin' => '940073',
                    'name' => '赣州银行股份有限公司-长征卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            628233 =>
                array(
                    'bank_id' => '51',
                    'card_bin' => '628233',
                    'name' => '赣州银行股份有限公司(64634280)-长征公务卡-贷记卡',
                    'type' => '1',
                ),
            621469 =>
                array(
                    'bank_id' => '52',
                    'card_bin' => '621469',
                    'name' => '广东华兴银行-借记卡-借记卡',
                    'type' => '2',
                ),
            621625 =>
                array(
                    'bank_id' => '52',
                    'card_bin' => '621625',
                    'name' => '广东华兴银行-华兴银联公司卡-借记卡',
                    'type' => '2',
                ),
            623688 =>
                array(
                    'bank_id' => '52',
                    'card_bin' => '623688',
                    'name' => '广东华兴银行-华兴联名IC卡-借记卡',
                    'type' => '2',
                ),
            623113 =>
                array(
                    'bank_id' => '52',
                    'card_bin' => '623113',
                    'name' => '广东华兴银行-华兴金融IC借记卡-借记卡',
                    'type' => '2',
                ),
            622448 =>
                array(
                    'bank_id' => '53',
                    'card_bin' => '622448',
                    'name' => '广东南粤银行-南珠卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            621727 =>
                array(
                    'bank_id' => '53',
                    'card_bin' => '621727',
                    'name' => '广东南粤银行股份有限公司(64895910)-湛江市民卡-借记卡',
                    'type' => '2',
                ),
            623128 =>
                array(
                    'bank_id' => '53',
                    'card_bin' => '623128',
                    'name' => '广东南粤银行股份有限公司(64895910)----借记卡',
                    'type' => '2',
                ),
            628237 =>
                array(
                    'bank_id' => '53',
                    'card_bin' => '628237',
                    'name' => '广东南粤银行(64895919)-公务卡-贷记卡',
                    'type' => '1',
                ),
            628227 =>
                array(
                    'bank_id' => '54',
                    'card_bin' => '628227',
                    'name' => '广西北部湾银行(64786110)-银联标准公务卡-贷记卡',
                    'type' => '1',
                ),
            623001 =>
                array(
                    'bank_id' => '54',
                    'card_bin' => '623001',
                    'name' => '广西北部湾银行(64786110)-IC借记卡-借记卡',
                    'type' => '2',
                ),
            603445 =>
                array(
                    'bank_id' => '55',
                    'card_bin' => '603445',
                    'name' => '广州银行股份有限公司-羊城借记卡-借记卡',
                    'type' => '2',
                ),
            622467 =>
                array(
                    'bank_id' => '55',
                    'card_bin' => '622467',
                    'name' => '广州银行股份有限公司-羊城借记卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            940016 =>
                array(
                    'bank_id' => '55',
                    'card_bin' => '940016',
                    'name' => '广州银行股份有限公司-羊城借记卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            621463 =>
                array(
                    'bank_id' => '55',
                    'card_bin' => '621463',
                    'name' => '广州银行股份有限公司-金融IC借记卡-借记卡',
                    'type' => '2',
                ),
            625050 =>
                array(
                    'bank_id' => '55',
                    'card_bin' => '625050',
                    'name' => '广州银行股份有限公司(64135810)-广州银行信用卡-贷记卡',
                    'type' => '1',
                ),
            625836 =>
                array(
                    'bank_id' => '55',
                    'card_bin' => '625836',
                    'name' => '广州银行股份有限公司(64135810)-贷记IC卡-贷记卡',
                    'type' => '1',
                ),
            628367 =>
                array(
                    'bank_id' => '55',
                    'card_bin' => '628367',
                    'name' => '广州银行股份有限公司(64135810)-银联标准公务卡-贷记卡',
                    'type' => '1',
                ),
            622133 =>
                array(
                    'bank_id' => '56',
                    'card_bin' => '622133',
                    'name' => '贵阳银行股份有限公司-甲秀银联借记卡-借记卡',
                    'type' => '2',
                ),
            888 =>
                array(
                    'bank_id' => '56',
                    'card_bin' => '888',
                    'name' => '贵阳银行股份有限公司-甲秀卡-借记卡',
                    'type' => '2',
                ),
            621735 =>
                array(
                    'bank_id' => '56',
                    'card_bin' => '621735',
                    'name' => '贵阳银行股份有限公司-一卡通-借记卡',
                    'type' => '2',
                ),
            622170 =>
                array(
                    'bank_id' => '56',
                    'card_bin' => '622170',
                    'name' => '贵阳银行股份有限公司--借记卡',
                    'type' => '2',
                ),
            628213 =>
                array(
                    'bank_id' => '56',
                    'card_bin' => '628213',
                    'name' => '贵阳银行股份有限公司(64437010)-甲秀公务卡-贷记卡',
                    'type' => '1',
                ),
            628219 =>
                array(
                    'bank_id' => '58',
                    'card_bin' => '628219',
                    'name' => '桂林银行(64916170)-漓江公务卡-贷记卡',
                    'type' => '1',
                ),
            621456 =>
                array(
                    'bank_id' => '58',
                    'card_bin' => '621456',
                    'name' => '桂林银行(64916170)-漓江卡-借记卡',
                    'type' => '2',
                ),
            621562 =>
                array(
                    'bank_id' => '58',
                    'card_bin' => '621562',
                    'name' => '桂林银行(64916170)-福农IC卡-借记卡',
                    'type' => '2',
                ),
            940049 =>
                array(
                    'bank_id' => '59',
                    'card_bin' => '940049',
                    'name' => '哈尔滨银行-丁香一卡通(银联卡)-借记卡',
                    'type' => '2',
                ),
            622425 =>
                array(
                    'bank_id' => '59',
                    'card_bin' => '622425',
                    'name' => '哈尔滨银行-丁香借记卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            621577 =>
                array(
                    'bank_id' => '59',
                    'card_bin' => '621577',
                    'name' => '哈尔滨银行-福农借记卡-借记卡',
                    'type' => '2',
                ),
            628224 =>
                array(
                    'bank_id' => '59',
                    'card_bin' => '628224',
                    'name' => '哈尔滨商行(64422610)-哈尔滨银行公务卡-贷记卡',
                    'type' => '1',
                ),
            625119 =>
                array(
                    'bank_id' => '59',
                    'card_bin' => '625119',
                    'name' => '哈尔滨银行(64422610)-联名卡-贷记卡',
                    'type' => '1',
                ),
            625577 =>
                array(
                    'bank_id' => '59',
                    'card_bin' => '625577',
                    'name' => '哈尔滨银行(64422610)-福农准贷记卡-准贷记卡',
                    'type' => '1',
                ),
            625952 =>
                array(
                    'bank_id' => '59',
                    'card_bin' => '625952',
                    'name' => '哈尔滨银行(64422610)-贷记IC卡-贷记卡',
                    'type' => '1',
                ),
            621752 =>
                array(
                    'bank_id' => '59',
                    'card_bin' => '621752',
                    'name' => '哈尔滨银行(64422611)-金融IC借记卡-借记卡',
                    'type' => '2',
                ),
            621360 =>
                array(
                    'bank_id' => '60',
                    'card_bin' => '621360',
                    'name' => '哈密市商业银行-瓜香借记卡-借记卡',
                    'type' => '2',
                ),
            623523 =>
                array(
                    'bank_id' => '61',
                    'card_bin' => '623523',
                    'name' => '邯郸市商业银行-邯郸银行贵宾IC借记卡-借记卡',
                    'type' => '2',
                ),
            990027 =>
                array(
                    'bank_id' => '62',
                    'card_bin' => '990027',
                    'name' => '汉口银行-九通卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622325 =>
                array(
                    'bank_id' => '62',
                    'card_bin' => '622325',
                    'name' => '汉口银行-九通卡-借记卡',
                    'type' => '2',
                ),
            623029 =>
                array(
                    'bank_id' => '62',
                    'card_bin' => '623029',
                    'name' => '汉口银行-借记卡-借记卡',
                    'type' => '2',
                ),
            623105 =>
                array(
                    'bank_id' => '62',
                    'card_bin' => '623105',
                    'name' => '汉口银行-借记卡-借记卡',
                    'type' => '2',
                ),
            622566 =>
                array(
                    'bank_id' => '62',
                    'card_bin' => '622566',
                    'name' => '汉口银行-汉口银行贷记卡-贷记卡',
                    'type' => '1',
                ),
            622567 =>
                array(
                    'bank_id' => '62',
                    'card_bin' => '622567',
                    'name' => '汉口银行-汉口银行贷记卡-贷记卡',
                    'type' => '1',
                ),
            622625 =>
                array(
                    'bank_id' => '62',
                    'card_bin' => '622625',
                    'name' => '汉口银行-九通香港旅游贷记普卡-贷记卡',
                    'type' => '1',
                ),
            622626 =>
                array(
                    'bank_id' => '62',
                    'card_bin' => '622626',
                    'name' => '汉口银行-九通香港旅游贷记金卡-贷记卡',
                    'type' => '1',
                ),
            625946 =>
                array(
                    'bank_id' => '62',
                    'card_bin' => '625946',
                    'name' => '汉口银行-贷记卡-贷记卡',
                    'type' => '1',
                ),
            628200 =>
                array(
                    'bank_id' => '62',
                    'card_bin' => '628200',
                    'name' => '汉口银行-九通公务卡-贷记卡',
                    'type' => '1',
                ),
            622498 =>
                array(
                    'bank_id' => '64',
                    'card_bin' => '622498',
                    'name' => '河北银行股份有限公司-如意借记卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622499 =>
                array(
                    'bank_id' => '64',
                    'card_bin' => '622499',
                    'name' => '河北银行股份有限公司-如意借记卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            940046 =>
                array(
                    'bank_id' => '64',
                    'card_bin' => '940046',
                    'name' => '河北银行股份有限公司-如意卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            623000 =>
                array(
                    'bank_id' => '64',
                    'card_bin' => '623000',
                    'name' => '河北银行股份有限公司-借记IC卡-借记卡',
                    'type' => '2',
                ),
            622921 =>
                array(
                    'bank_id' => '64',
                    'card_bin' => '622921',
                    'name' => '河北银行股份有限公司(64221210)-如意贷记卡-贷记卡',
                    'type' => '1',
                ),
            628321 =>
                array(
                    'bank_id' => '64',
                    'card_bin' => '628321',
                    'name' => '河北银行股份有限公司(64221210)-如意贷记卡-贷记卡',
                    'type' => '1',
                ),
            625598 =>
                array(
                    'bank_id' => '64',
                    'card_bin' => '625598',
                    'name' => '河北银行股份有限公司(64221210)-福农卡-贷记卡',
                    'type' => '1',
                ),
            621239 =>
                array(
                    'bank_id' => '65',
                    'card_bin' => '621239',
                    'name' => '衡水银行-金鼎卡-借记卡',
                    'type' => '2',
                ),
            623068 =>
                array(
                    'bank_id' => '65',
                    'card_bin' => '623068',
                    'name' => '衡水银行-借记IC卡-借记卡',
                    'type' => '2',
                ),
            621217 =>
                array(
                    'bank_id' => '67',
                    'card_bin' => '621217',
                    'name' => '湖北银行-金牛卡-借记卡',
                    'type' => '2',
                ),
            622959 =>
                array(
                    'bank_id' => '67',
                    'card_bin' => '622959',
                    'name' => '湖北银行-汉江卡-借记卡',
                    'type' => '2',
                ),
            621270 =>
                array(
                    'bank_id' => '67',
                    'card_bin' => '621270',
                    'name' => '湖北银行-借记卡-借记卡',
                    'type' => '2',
                ),
            622396 =>
                array(
                    'bank_id' => '67',
                    'card_bin' => '622396',
                    'name' => '湖北银行-三峡卡-借记卡',
                    'type' => '2',
                ),
            622511 =>
                array(
                    'bank_id' => '67',
                    'card_bin' => '622511',
                    'name' => '湖北银行-至尊卡-借记卡',
                    'type' => '2',
                ),
            623076 =>
                array(
                    'bank_id' => '67',
                    'card_bin' => '623076',
                    'name' => '湖北银行-金融IC卡-借记卡',
                    'type' => '2',
                ),
            628306 =>
                array(
                    'bank_id' => '68',
                    'card_bin' => '628306',
                    'name' => '湖州银行(64753360)-公务卡-贷记卡',
                    'type' => '1',
                ),
            621366 =>
                array(
                    'bank_id' => '69',
                    'card_bin' => '621366',
                    'name' => '华融湘江银行-华融卡-借记卡',
                    'type' => '2',
                ),
            621388 =>
                array(
                    'bank_id' => '69',
                    'card_bin' => '621388',
                    'name' => '华融湘江银行-华融卡-借记卡',
                    'type' => '2',
                ),
            628328 =>
                array(
                    'bank_id' => '69',
                    'card_bin' => '628328',
                    'name' => '华融湘江银行(65705500)-华融湘江银行华融公务卡普卡-贷记卡',
                    'type' => '1',
                ),
            622877 =>
                array(
                    'bank_id' => '70',
                    'card_bin' => '622877',
                    'name' => '徽商银行-黄山卡-借记卡',
                    'type' => '2',
                ),
            622879 =>
                array(
                    'bank_id' => '70',
                    'card_bin' => '622879',
                    'name' => '徽商银行-黄山卡-借记卡',
                    'type' => '2',
                ),
            621775 =>
                array(
                    'bank_id' => '70',
                    'card_bin' => '621775',
                    'name' => '徽商银行-借记卡-借记卡',
                    'type' => '2',
                ),
            623203 =>
                array(
                    'bank_id' => '70',
                    'card_bin' => '623203',
                    'name' => '徽商银行-徽商银行中国旅游卡（安徽）-借记卡',
                    'type' => '2',
                ),
            603601 =>
                array(
                    'bank_id' => '70',
                    'card_bin' => '603601',
                    'name' => '徽商银行合肥分行-黄山卡-借记卡',
                    'type' => '2',
                ),
            622137 =>
                array(
                    'bank_id' => '70',
                    'card_bin' => '622137',
                    'name' => '徽商银行芜湖分行-黄山卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622327 =>
                array(
                    'bank_id' => '70',
                    'card_bin' => '622327',
                    'name' => '徽商银行马鞍山分行-黄山卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622340 =>
                array(
                    'bank_id' => '70',
                    'card_bin' => '622340',
                    'name' => '徽商银行淮北分行-黄山卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622366 =>
                array(
                    'bank_id' => '70',
                    'card_bin' => '622366',
                    'name' => '徽商银行安庆分行-黄山卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            628251 =>
                array(
                    'bank_id' => '70',
                    'card_bin' => '628251',
                    'name' => '徽商银行(64403600)-银联标准公务卡-贷记卡',
                    'type' => '1',
                ),
            622651 =>
                array(
                    'bank_id' => '70',
                    'card_bin' => '622651',
                    'name' => '徽商银行(64403600)-贷记卡-贷记卡',
                    'type' => '1',
                ),
            625828 =>
                array(
                    'bank_id' => '70',
                    'card_bin' => '625828',
                    'name' => '徽商银行(64403600)-贷记IC卡-贷记卡',
                    'type' => '1',
                ),
            625652 =>
                array(
                    'bank_id' => '70',
                    'card_bin' => '625652',
                    'name' => '徽商银行(64403600)-公司卡-贷记卡',
                    'type' => '1',
                ),
            625700 =>
                array(
                    'bank_id' => '70',
                    'card_bin' => '625700',
                    'name' => '徽商银行(64403600)-采购卡-贷记卡',
                    'type' => '1',
                ),
            622865 =>
                array(
                    'bank_id' => '71',
                    'card_bin' => '622865',
                    'name' => '吉林银行-君子兰一卡通(银联卡)-借记卡',
                    'type' => '2',
                ),
            940012 =>
                array(
                    'bank_id' => '71',
                    'card_bin' => '940012',
                    'name' => '吉林银行-君子兰卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            623131 =>
                array(
                    'bank_id' => '71',
                    'card_bin' => '623131',
                    'name' => '吉林银行-长白山金融IC卡-借记卡',
                    'type' => '2',
                ),
            622178 =>
                array(
                    'bank_id' => '71',
                    'card_bin' => '622178',
                    'name' => '吉林银行-信用卡-贷记卡',
                    'type' => '1',
                ),
            622179 =>
                array(
                    'bank_id' => '71',
                    'card_bin' => '622179',
                    'name' => '吉林银行-信用卡-贷记卡',
                    'type' => '1',
                ),
            628358 =>
                array(
                    'bank_id' => '71',
                    'card_bin' => '628358',
                    'name' => '吉林银行-公务卡-贷记卡',
                    'type' => '1',
                ),
            622440 =>
                array(
                    'bank_id' => '71',
                    'card_bin' => '622440',
                    'name' => '吉林银行-雾凇卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            940047 =>
                array(
                    'bank_id' => '71',
                    'card_bin' => '940047',
                    'name' => '吉林银行-雾凇卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            621200 =>
                array(
                    'bank_id' => '72',
                    'card_bin' => '621200',
                    'name' => '济宁银行股份有限公司-儒商卡-借记卡',
                    'type' => '2',
                ),
            623116 =>
                array(
                    'bank_id' => '72',
                    'card_bin' => '623116',
                    'name' => '济宁银行股份有限公司----借记卡',
                    'type' => '2',
                ),
            622132 =>
                array(
                    'bank_id' => '73',
                    'card_bin' => '622132',
                    'name' => '嘉兴银行-南湖借记卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            621076 =>
                array(
                    'bank_id' => '74',
                    'card_bin' => '621076',
                    'name' => '江苏银行-聚宝借记卡-借记卡',
                    'type' => '2',
                ),
            504923 =>
                array(
                    'bank_id' => '74',
                    'card_bin' => '504923',
                    'name' => '江苏银行-月季卡-借记卡',
                    'type' => '2',
                ),
            622173 =>
                array(
                    'bank_id' => '74',
                    'card_bin' => '622173',
                    'name' => '江苏银行-紫金卡-借记卡',
                    'type' => '2',
                ),
            622422 =>
                array(
                    'bank_id' => '74',
                    'card_bin' => '622422',
                    'name' => '江苏银行-绿扬卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622447 =>
                array(
                    'bank_id' => '74',
                    'card_bin' => '622447',
                    'name' => '江苏银行-月季卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622131 =>
                array(
                    'bank_id' => '74',
                    'card_bin' => '622131',
                    'name' => '江苏银行-九州借记卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            940076 =>
                array(
                    'bank_id' => '74',
                    'card_bin' => '940076',
                    'name' => '江苏银行-月季卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            621579 =>
                array(
                    'bank_id' => '74',
                    'card_bin' => '621579',
                    'name' => '江苏银行-聚宝惠民福农卡-借记卡',
                    'type' => '2',
                ),
            622876 =>
                array(
                    'bank_id' => '74',
                    'card_bin' => '622876',
                    'name' => '江苏银行-江苏银行聚宝IC借记卡-借记卡',
                    'type' => '2',
                ),
            622873 =>
                array(
                    'bank_id' => '74',
                    'card_bin' => '622873',
                    'name' => '江苏银行-聚宝IC借记卡VIP卡-借记卡',
                    'type' => '2',
                ),
            628210 =>
                array(
                    'bank_id' => '74',
                    'card_bin' => '628210',
                    'name' => '江苏银行-紫金信用卡(公务卡)-贷记卡',
                    'type' => '1',
                ),
            622283 =>
                array(
                    'bank_id' => '74',
                    'card_bin' => '622283',
                    'name' => '江苏银行-紫金信用卡-贷记卡',
                    'type' => '1',
                ),
            625902 =>
                array(
                    'bank_id' => '74',
                    'card_bin' => '625902',
                    'name' => '江苏银行-天翼联名信用卡-贷记卡',
                    'type' => '1',
                ),
            940051 =>
                array(
                    'bank_id' => '76',
                    'card_bin' => '940051',
                    'name' => '金华银行股份有限公司-双龙卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            628204 =>
                array(
                    'bank_id' => '76',
                    'card_bin' => '628204',
                    'name' => '金华银行股份有限公司-公务卡-贷记卡',
                    'type' => '1',
                ),
            622449 =>
                array(
                    'bank_id' => '76',
                    'card_bin' => '622449',
                    'name' => '金华银行股份有限公司-双龙借记卡-借记卡',
                    'type' => '2',
                ),
            623067 =>
                array(
                    'bank_id' => '76',
                    'card_bin' => '623067',
                    'name' => '金华银行股份有限公司-双龙社保卡-借记卡',
                    'type' => '2',
                ),
            622450 =>
                array(
                    'bank_id' => '76',
                    'card_bin' => '622450',
                    'name' => '金华银行股份有限公司-双龙贷记卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            622990 =>
                array(
                    'bank_id' => '77',
                    'card_bin' => '622990',
                    'name' => '锦州银行股份有限公司-7777卡-借记卡',
                    'type' => '2',
                ),
            940003 =>
                array(
                    'bank_id' => '77',
                    'card_bin' => '940003',
                    'name' => '锦州银行股份有限公司-万通卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            628261 =>
                array(
                    'bank_id' => '77',
                    'card_bin' => '628261',
                    'name' => '锦州银行(64392270)-公务卡-贷记卡',
                    'type' => '1',
                ),
            622532 =>
                array(
                    'bank_id' => '78',
                    'card_bin' => '622532',
                    'name' => '晋城银行股份有限公司-珠联璧合卡-借记卡',
                    'type' => '2',
                ),
            621216 =>
                array(
                    'bank_id' => '79',
                    'card_bin' => '621216',
                    'name' => '晋商银行-晋龙一卡通-借记卡',
                    'type' => '2',
                ),
            622465 =>
                array(
                    'bank_id' => '79',
                    'card_bin' => '622465',
                    'name' => '晋商银行-晋龙一卡通-借记卡',
                    'type' => '2',
                ),
            940031 =>
                array(
                    'bank_id' => '79',
                    'card_bin' => '940031',
                    'name' => '晋商银行-晋龙卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            621223 =>
                array(
                    'bank_id' => '80',
                    'card_bin' => '621223',
                    'name' => '晋中银行-九州方圆借记卡-借记卡',
                    'type' => '2',
                ),
            621780 =>
                array(
                    'bank_id' => '80',
                    'card_bin' => '621780',
                    'name' => '晋中银行-九州方圆卡-借记卡',
                    'type' => '2',
                ),
            622162 =>
                array(
                    'bank_id' => '82',
                    'card_bin' => '622162',
                    'name' => '九江银行股份有限公司-庐山卡-借记卡',
                    'type' => '2',
                ),
            628238 =>
                array(
                    'bank_id' => '82',
                    'card_bin' => '628238',
                    'name' => '九江银行股份有限公司(64544240)-庐山公务卡-贷记卡',
                    'type' => '1',
                ),
            621029 =>
                array(
                    'bank_id' => '85',
                    'card_bin' => '621029',
                    'name' => '昆仑银行股份有限公司-瑞卡-借记卡',
                    'type' => '2',
                ),
            621766 =>
                array(
                    'bank_id' => '85',
                    'card_bin' => '621766',
                    'name' => '昆仑银行股份有限公司-金融IC卡-借记卡',
                    'type' => '2',
                ),
            623139 =>
                array(
                    'bank_id' => '85',
                    'card_bin' => '623139',
                    'name' => '昆仑银行股份有限公司--借记卡',
                    'type' => '2',
                ),
            628279 =>
                array(
                    'bank_id' => '86',
                    'card_bin' => '628279',
                    'name' => '莱商银行-银联标准卡-贷记卡',
                    'type' => '1',
                ),
            621403 =>
                array(
                    'bank_id' => '86',
                    'card_bin' => '621403',
                    'name' => '莱商银行-借记IC卡-借记卡',
                    'type' => '2',
                ),
            622139 =>
                array(
                    'bank_id' => '87',
                    'card_bin' => '622139',
                    'name' => '兰州银行股份有限公司-敦煌国际卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            940040 =>
                array(
                    'bank_id' => '87',
                    'card_bin' => '940040',
                    'name' => '兰州银行股份有限公司-敦煌卡-借记卡',
                    'type' => '2',
                ),
            621242 =>
                array(
                    'bank_id' => '87',
                    'card_bin' => '621242',
                    'name' => '兰州银行股份有限公司-敦煌卡-借记卡',
                    'type' => '2',
                ),
            621538 =>
                array(
                    'bank_id' => '87',
                    'card_bin' => '621538',
                    'name' => '兰州银行-敦煌卡-借记卡',
                    'type' => '2',
                ),
            621496 =>
                array(
                    'bank_id' => '87',
                    'card_bin' => '621496',
                    'name' => '兰州银行股份有限公司-敦煌金融IC卡-借记卡',
                    'type' => '2',
                ),
            623129 =>
                array(
                    'bank_id' => '87',
                    'card_bin' => '623129',
                    'name' => '兰州银行股份有限公司-金融社保卡-借记卡',
                    'type' => '2',
                ),
            628263 =>
                array(
                    'bank_id' => '87',
                    'card_bin' => '628263',
                    'name' => '兰州银行(64478210)-敦煌公务卡-贷记卡',
                    'type' => '1',
                ),
            621340 =>
                array(
                    'bank_id' => '88',
                    'card_bin' => '621340',
                    'name' => '廊坊银行-白金卡-借记卡',
                    'type' => '2',
                ),
            621341 =>
                array(
                    'bank_id' => '88',
                    'card_bin' => '621341',
                    'name' => '廊坊银行-金卡-借记卡',
                    'type' => '2',
                ),
            622140 =>
                array(
                    'bank_id' => '88',
                    'card_bin' => '622140',
                    'name' => '廊坊银行-银星卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            623073 =>
                array(
                    'bank_id' => '88',
                    'card_bin' => '623073',
                    'name' => '廊坊银行-龙凤呈祥卡-借记卡',
                    'type' => '2',
                ),
            621086 =>
                array(
                    'bank_id' => '89',
                    'card_bin' => '621086',
                    'name' => '乐山市商业银行-大福卡-借记卡',
                    'type' => '2',
                ),
            621498 =>
                array(
                    'bank_id' => '89',
                    'card_bin' => '621498',
                    'name' => '乐山市商业银行----借记卡',
                    'type' => '2',
                ),
            621057 =>
                array(
                    'bank_id' => '90',
                    'card_bin' => '621057',
                    'name' => '凉山州商业银行-锦程卡-借记卡',
                    'type' => '2',
                ),
            623199 =>
                array(
                    'bank_id' => '90',
                    'card_bin' => '623199',
                    'name' => '凉山州商业银行-金凉山卡-借记卡',
                    'type' => '2',
                ),
            622399 =>
                array(
                    'bank_id' => '91',
                    'card_bin' => '622399',
                    'name' => '辽阳银行股份有限公司-新兴卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            940043 =>
                array(
                    'bank_id' => '91',
                    'card_bin' => '940043',
                    'name' => '辽阳银行股份有限公司-新兴卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            628309 =>
                array(
                    'bank_id' => '91',
                    'card_bin' => '628309',
                    'name' => '辽阳银行股份有限公司-公务卡-贷记卡',
                    'type' => '1',
                ),
            623151 =>
                array(
                    'bank_id' => '91',
                    'card_bin' => '623151',
                    'name' => '辽阳银行股份有限公司-新兴卡-借记卡',
                    'type' => '2',
                ),
            623007 =>
                array(
                    'bank_id' => '92',
                    'card_bin' => '623007',
                    'name' => '临商银行-借记卡-借记卡',
                    'type' => '2',
                ),
            628359 =>
                array(
                    'bank_id' => '92',
                    'card_bin' => '628359',
                    'name' => '临商银行(64314730)-公务卡-贷记卡',
                    'type' => '1',
                ),
            622292 =>
                array(
                    'bank_id' => '93',
                    'card_bin' => '622292',
                    'name' => '柳州银行股份有限公司-龙城卡-借记卡',
                    'type' => '2',
                ),
            622291 =>
                array(
                    'bank_id' => '93',
                    'card_bin' => '622291',
                    'name' => '柳州银行股份有限公司-龙城卡-借记卡',
                    'type' => '2',
                ),
            621412 =>
                array(
                    'bank_id' => '93',
                    'card_bin' => '621412',
                    'name' => '柳州银行股份有限公司-龙城IC卡-借记卡',
                    'type' => '2',
                ),
            622880 =>
                array(
                    'bank_id' => '93',
                    'card_bin' => '622880',
                    'name' => '柳州银行股份有限公司-龙城卡VIP卡-借记卡',
                    'type' => '2',
                ),
            622881 =>
                array(
                    'bank_id' => '93',
                    'card_bin' => '622881',
                    'name' => '柳州银行股份有限公司-龙城致富卡-借记卡',
                    'type' => '2',
                ),
            620118 =>
                array(
                    'bank_id' => '93',
                    'card_bin' => '620118',
                    'name' => '柳州银行股份有限公司-东盟商旅卡-预付费卡',
                    'type' => '3',
                ),
            628293 =>
                array(
                    'bank_id' => '93',
                    'card_bin' => '628293',
                    'name' => '柳州银行(64956140)-龙城公务卡-贷记卡',
                    'type' => '1',
                ),
            622475 =>
                array(
                    'bank_id' => '94',
                    'card_bin' => '622475',
                    'name' => '龙江银行股份有限公司-金鹤卡-借记卡',
                    'type' => '2',
                ),
            621037 =>
                array(
                    'bank_id' => '94',
                    'card_bin' => '621037',
                    'name' => '龙江银行-福农借记卡-借记卡',
                    'type' => '2',
                ),
            621097 =>
                array(
                    'bank_id' => '94',
                    'card_bin' => '621097',
                    'name' => '龙江银行-联名借记卡-借记卡',
                    'type' => '2',
                ),
            621588 =>
                array(
                    'bank_id' => '94',
                    'card_bin' => '621588',
                    'name' => '龙江银行-福农借记卡-借记卡',
                    'type' => '2',
                ),
            62321601 =>
                array(
                    'bank_id' => '94',
                    'card_bin' => '62321601',
                    'name' => '龙江银行-中国旅游卡-借记卡',
                    'type' => '2',
                ),
            623032 =>
                array(
                    'bank_id' => '94',
                    'card_bin' => '623032',
                    'name' => '龙江银行-龙江IC卡-借记卡',
                    'type' => '2',
                ),
            622644 =>
                array(
                    'bank_id' => '94',
                    'card_bin' => '622644',
                    'name' => '龙江银行-社会保障卡-借记卡',
                    'type' => '2',
                ),
            623518 =>
                array(
                    'bank_id' => '94',
                    'card_bin' => '623518',
                    'name' => '龙江银行----借记卡',
                    'type' => '2',
                ),
            622860 =>
                array(
                    'bank_id' => '94',
                    'card_bin' => '622860',
                    'name' => '龙江银行股份有限公司-玉兔卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622977 =>
                array(
                    'bank_id' => '94',
                    'card_bin' => '622977',
                    'name' => '龙江银行股份有限公司-万通卡-借记卡',
                    'type' => '2',
                ),
            628333 =>
                array(
                    'bank_id' => '94',
                    'card_bin' => '628333',
                    'name' => '龙江银行股份有限公司(64162640)-公务卡-贷记卡',
                    'type' => '1',
                ),
            622270 =>
                array(
                    'bank_id' => '94',
                    'card_bin' => '622270',
                    'name' => '龙江银行股份有限公司(64922690)-玉兔贷记卡-贷记卡',
                    'type' => '1',
                ),
            628368 =>
                array(
                    'bank_id' => '94',
                    'card_bin' => '628368',
                    'name' => '龙江银行股份有限公司(64922690)-玉兔贷记卡(公务卡)-贷记卡',
                    'type' => '1',
                ),
            625588 =>
                array(
                    'bank_id' => '94',
                    'card_bin' => '625588',
                    'name' => '龙江银行(64922690)-福农准贷记卡-准贷记卡',
                    'type' => '1',
                ),
            625090 =>
                array(
                    'bank_id' => '94',
                    'card_bin' => '625090',
                    'name' => '龙江银行股份有限公司(64922690)-联名贷记卡-贷记卡',
                    'type' => '1',
                ),
            62536602 =>
                array(
                    'bank_id' => '94',
                    'card_bin' => '62536602',
                    'name' => '龙江银行股份有限公司(64922690)-中国旅游卡-贷记卡',
                    'type' => '1',
                ),
            622392 =>
                array(
                    'bank_id' => '95',
                    'card_bin' => '622392',
                    'name' => '泸州市商业银行-酒城卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            623085 =>
                array(
                    'bank_id' => '95',
                    'card_bin' => '623085',
                    'name' => '泸州市商业银行-酒城IC卡-借记卡',
                    'type' => '2',
                ),
            622420 =>
                array(
                    'bank_id' => '96',
                    'card_bin' => '622420',
                    'name' => '洛阳银行-都市一卡通(银联卡)-借记卡',
                    'type' => '2',
                ),
            940041 =>
                array(
                    'bank_id' => '96',
                    'card_bin' => '940041',
                    'name' => '洛阳银行-都市一卡通(银联卡)-借记卡',
                    'type' => '2',
                ),
            623118 =>
                array(
                    'bank_id' => '96',
                    'card_bin' => '623118',
                    'name' => '洛阳银行----借记卡',
                    'type' => '2',
                ),
            622367 =>
                array(
                    'bank_id' => '97',
                    'card_bin' => '622367',
                    'name' => '绵阳市商业银行-科技城卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            628242 =>
                array(
                    'bank_id' => '99',
                    'card_bin' => '628242',
                    'name' => '南京银行-梅花信用卡公务卡-贷记卡',
                    'type' => '1',
                ),
            622595 =>
                array(
                    'bank_id' => '99',
                    'card_bin' => '622595',
                    'name' => '南京银行-梅花信用卡商务卡-贷记卡',
                    'type' => '1',
                ),
            621259 =>
                array(
                    'bank_id' => '99',
                    'card_bin' => '621259',
                    'name' => '南京银行-白金卡-借记卡',
                    'type' => '2',
                ),
            622596 =>
                array(
                    'bank_id' => '99',
                    'card_bin' => '622596',
                    'name' => '南京银行-商务卡-贷记卡',
                    'type' => '1',
                ),
            621777 =>
                array(
                    'bank_id' => '99',
                    'card_bin' => '621777',
                    'name' => '南京银行(64243010)-借记IC卡-借记卡',
                    'type' => '2',
                ),
            622147 =>
                array(
                    'bank_id' => '100',
                    'card_bin' => '622147',
                    'name' => '内蒙古银行-百灵卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            621633 =>
                array(
                    'bank_id' => '100',
                    'card_bin' => '621633',
                    'name' => '内蒙古银行-成吉思汗卡-借记卡',
                    'type' => '2',
                ),
            628252 =>
                array(
                    'bank_id' => '100',
                    'card_bin' => '628252',
                    'name' => '内蒙古银行(64741910)-银联标准公务卡-贷记卡',
                    'type' => '1',
                ),
            621345 =>
                array(
                    'bank_id' => '101',
                    'card_bin' => '621345',
                    'name' => '宁波东海银行-绿叶卡-借记卡',
                    'type' => '2',
                ),
            621655 =>
                array(
                    'bank_id' => '102',
                    'card_bin' => '621655',
                    'name' => '宁波通商银行-借记卡-借记卡',
                    'type' => '2',
                ),
            621279 =>
                array(
                    'bank_id' => '103',
                    'card_bin' => '621279',
                    'name' => '宁波银行-银联标准卡-借记卡',
                    'type' => '2',
                ),
            622281 =>
                array(
                    'bank_id' => '103',
                    'card_bin' => '622281',
                    'name' => '宁波银行-汇通借记卡-借记卡',
                    'type' => '2',
                ),
            622316 =>
                array(
                    'bank_id' => '103',
                    'card_bin' => '622316',
                    'name' => '宁波银行-汇通卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            940022 =>
                array(
                    'bank_id' => '103',
                    'card_bin' => '940022',
                    'name' => '宁波银行-明州卡-借记卡',
                    'type' => '2',
                ),
            621418 =>
                array(
                    'bank_id' => '103',
                    'card_bin' => '621418',
                    'name' => '宁波银行-汇通借记卡-借记卡',
                    'type' => '2',
                ),
            512431 =>
                array(
                    'bank_id' => '103',
                    'card_bin' => '512431',
                    'name' => '宁波银行-汇通国际卡银联双币卡-贷记卡',
                    'type' => '1',
                ),
            520194 =>
                array(
                    'bank_id' => '103',
                    'card_bin' => '520194',
                    'name' => '宁波银行-汇通国际卡银联双币卡-贷记卡',
                    'type' => '1',
                ),
            625903 =>
                array(
                    'bank_id' => '103',
                    'card_bin' => '625903',
                    'name' => '宁波银行(64083300)-汇通贷记卡-贷记卡',
                    'type' => '1',
                ),
            622282 =>
                array(
                    'bank_id' => '103',
                    'card_bin' => '622282',
                    'name' => '宁波银行(64083300)-汇通贷记卡-贷记卡',
                    'type' => '1',
                ),
            622318 =>
                array(
                    'bank_id' => '103',
                    'card_bin' => '622318',
                    'name' => '宁波银行(64083300)-汇通卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            622778 =>
                array(
                    'bank_id' => '103',
                    'card_bin' => '622778',
                    'name' => '宁波银行(64083300)-汇通白金卡-贷记卡',
                    'type' => '1',
                ),
            628207 =>
                array(
                    'bank_id' => '103',
                    'card_bin' => '628207',
                    'name' => '宁波银行(64083300)-汇通公务卡-贷记卡',
                    'type' => '1',
                ),
            628214 =>
                array(
                    'bank_id' => '104',
                    'card_bin' => '628214',
                    'name' => '宁夏银行-宁夏银行公务卡-贷记卡',
                    'type' => '1',
                ),
            625529 =>
                array(
                    'bank_id' => '104',
                    'card_bin' => '625529',
                    'name' => '宁夏银行-宁夏银行福农贷记卡-贷记卡',
                    'type' => '1',
                ),
            622428 =>
                array(
                    'bank_id' => '104',
                    'card_bin' => '622428',
                    'name' => '宁夏银行-如意卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            621529 =>
                array(
                    'bank_id' => '104',
                    'card_bin' => '621529',
                    'name' => '宁夏银行-宁夏银行福农借记卡-借记卡',
                    'type' => '2',
                ),
            622429 =>
                array(
                    'bank_id' => '104',
                    'card_bin' => '622429',
                    'name' => '宁夏银行-如意借记卡-借记卡',
                    'type' => '2',
                ),
            621417 =>
                array(
                    'bank_id' => '104',
                    'card_bin' => '621417',
                    'name' => '宁夏银行-如意IC卡-借记卡',
                    'type' => '2',
                ),
            623089 =>
                array(
                    'bank_id' => '104',
                    'card_bin' => '623089',
                    'name' => '宁夏银行-宁夏银行如意借记卡-借记卡',
                    'type' => '2',
                ),
            623200 =>
                array(
                    'bank_id' => '104',
                    'card_bin' => '623200',
                    'name' => '宁夏银行-中国旅游卡-借记卡',
                    'type' => '2',
                ),
            622342 =>
                array(
                    'bank_id' => '105',
                    'card_bin' => '622342',
                    'name' => '攀枝花市商业银行-攀枝花卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            623048 =>
                array(
                    'bank_id' => '105',
                    'card_bin' => '623048',
                    'name' => '攀枝花市商业银行-攀枝花卡-借记卡',
                    'type' => '2',
                ),
            621071 =>
                array(
                    'bank_id' => '107',
                    'card_bin' => '621071',
                    'name' => '平顶山银行股份有限公司-佛泉卡-借记卡',
                    'type' => '2',
                ),
            623152 =>
                array(
                    'bank_id' => '107',
                    'card_bin' => '623152',
                    'name' => '平顶山银行股份有限公司----借记卡',
                    'type' => '2',
                ),
            628339 =>
                array(
                    'bank_id' => '107',
                    'card_bin' => '628339',
                    'name' => '平顶山银行-平顶山银行公务卡-贷记卡',
                    'type' => '1',
                ),
            940008 =>
                array(
                    'bank_id' => '108',
                    'card_bin' => '940008',
                    'name' => '齐鲁银行股份有限公司-齐鲁卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622379 =>
                array(
                    'bank_id' => '108',
                    'card_bin' => '622379',
                    'name' => '齐鲁银行股份有限公司-齐鲁卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            628379 =>
                array(
                    'bank_id' => '108',
                    'card_bin' => '628379',
                    'name' => '齐鲁银行股份有限公司(64094510)-泉城公务卡-贷记卡',
                    'type' => '1',
                ),
            940057 =>
                array(
                    'bank_id' => '109',
                    'card_bin' => '940057',
                    'name' => '齐商银行-金达卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622311 =>
                array(
                    'bank_id' => '109',
                    'card_bin' => '622311',
                    'name' => '齐商银行-金达借记卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            623119 =>
                array(
                    'bank_id' => '109',
                    'card_bin' => '623119',
                    'name' => '齐商银行-金达IC卡-借记卡',
                    'type' => '2',
                ),
            628311 =>
                array(
                    'bank_id' => '109',
                    'card_bin' => '628311',
                    'name' => '齐商银行(64384530)-金达公务卡-贷记卡',
                    'type' => '1',
                ),
            621237 =>
                array(
                    'bank_id' => '110',
                    'card_bin' => '621237',
                    'name' => '秦皇岛银行股份有限公司-秦卡-借记卡',
                    'type' => '2',
                ),
            62249802 =>
                array(
                    'bank_id' => '110',
                    'card_bin' => '62249802',
                    'name' => '秦皇岛银行股份有限公司-秦卡-借记卡',
                    'type' => '2',
                ),
            94004602 =>
                array(
                    'bank_id' => '110',
                    'card_bin' => '94004602',
                    'name' => '秦皇岛银行股份有限公司-秦卡-借记卡',
                    'type' => '2',
                ),
            623003 =>
                array(
                    'bank_id' => '110',
                    'card_bin' => '623003',
                    'name' => '秦皇岛银行股份有限公司-秦卡-IC卡-借记卡',
                    'type' => '2',
                ),
            621252 =>
                array(
                    'bank_id' => '111',
                    'card_bin' => '621252',
                    'name' => '青岛银行-金桥通卡-借记卡',
                    'type' => '2',
                ),
            622146 =>
                array(
                    'bank_id' => '111',
                    'card_bin' => '622146',
                    'name' => '青岛银行-金桥卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            940061 =>
                array(
                    'bank_id' => '111',
                    'card_bin' => '940061',
                    'name' => '青岛银行-金桥卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            621419 =>
                array(
                    'bank_id' => '111',
                    'card_bin' => '621419',
                    'name' => '青岛银行-金桥卡-借记卡',
                    'type' => '2',
                ),
            623170 =>
                array(
                    'bank_id' => '111',
                    'card_bin' => '623170',
                    'name' => '青岛银行-借记IC卡-借记卡',
                    'type' => '2',
                ),
            628239 =>
                array(
                    'bank_id' => '111',
                    'card_bin' => '628239',
                    'name' => '青岛银行(64504520)-公务卡-贷记卡',
                    'type' => '1',
                ),
            622310 =>
                array(
                    'bank_id' => '112',
                    'card_bin' => '622310',
                    'name' => '青海银行-三江银行卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            940068 =>
                array(
                    'bank_id' => '112',
                    'card_bin' => '940068',
                    'name' => '青海银行-三江卡-借记卡',
                    'type' => '2',
                ),
            622817 =>
                array(
                    'bank_id' => '112',
                    'card_bin' => '622817',
                    'name' => '青海银行(64588510)-三江贷记卡-贷记卡',
                    'type' => '1',
                ),
            628287 =>
                array(
                    'bank_id' => '112',
                    'card_bin' => '628287',
                    'name' => '青海银行(64588510)-三江贷记卡(公务卡)-贷记卡',
                    'type' => '1',
                ),
            625959 =>
                array(
                    'bank_id' => '112',
                    'card_bin' => '625959',
                    'name' => '青海银行(64588510)-三江贷记IC卡-贷记卡',
                    'type' => '1',
                ),
            62536601 =>
                array(
                    'bank_id' => '112',
                    'card_bin' => '62536601',
                    'name' => '青海银行(64588510)-中国旅游卡-贷记卡',
                    'type' => '1',
                ),
            622777 =>
                array(
                    'bank_id' => '113',
                    'card_bin' => '622777',
                    'name' => '曲靖市商业银行-珠江源卡-借记卡',
                    'type' => '2',
                ),
            621497 =>
                array(
                    'bank_id' => '113',
                    'card_bin' => '621497',
                    'name' => '曲靖市商业银行-珠江源IC卡-借记卡',
                    'type' => '2',
                ),
            622370 =>
                array(
                    'bank_id' => '114',
                    'card_bin' => '622370',
                    'name' => '泉州银行-海峡银联卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            683970 =>
                array(
                    'bank_id' => '114',
                    'card_bin' => '683970',
                    'name' => '泉州银行-海峡储蓄卡-借记卡',
                    'type' => '2',
                ),
            940074 =>
                array(
                    'bank_id' => '114',
                    'card_bin' => '940074',
                    'name' => '泉州银行-海峡银联卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            621437 =>
                array(
                    'bank_id' => '114',
                    'card_bin' => '621437',
                    'name' => '泉州银行-海峡卡-借记卡',
                    'type' => '2',
                ),
            628319 =>
                array(
                    'bank_id' => '114',
                    'card_bin' => '628319',
                    'name' => '泉州银行-公务卡-贷记卡',
                    'type' => '1',
                ),
            623077 =>
                array(
                    'bank_id' => '115',
                    'card_bin' => '623077',
                    'name' => '日照银行-黄海卡、财富卡借记卡-借记卡',
                    'type' => '2',
                ),
            628257 =>
                array(
                    'bank_id' => '115',
                    'card_bin' => '628257',
                    'name' => '日照银行(64554770)-黄海公务卡-贷记卡',
                    'type' => '1',
                ),
            623183 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '623183',
                    'name' => '上海银行-慧通钻石卡-借记卡',
                    'type' => '2',
                ),
            623185 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '623185',
                    'name' => '上海银行-慧通金卡-借记卡',
                    'type' => '2',
                ),
            621005 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '621005',
                    'name' => '上海银行-私人银行卡-借记卡',
                    'type' => '2',
                ),
            622172 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '622172',
                    'name' => '上海银行-综合保险卡-借记卡',
                    'type' => '2',
                ),
            622985 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '622985',
                    'name' => '上海银行-申卡社保副卡(有折)-借记卡',
                    'type' => '2',
                ),
            622987 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '622987',
                    'name' => '上海银行-申卡社保副卡(无折)-借记卡',
                    'type' => '2',
                ),
            622267 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '622267',
                    'name' => '上海银行-白金IC借记卡-借记卡',
                    'type' => '2',
                ),
            622278 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '622278',
                    'name' => '上海银行-慧通白金卡(配折)-借记卡',
                    'type' => '2',
                ),
            622279 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '622279',
                    'name' => '上海银行-慧通白金卡(不配折)-借记卡',
                    'type' => '2',
                ),
            622468 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '622468',
                    'name' => '上海银行-申卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622892 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '622892',
                    'name' => '上海银行-申卡借记卡-借记卡',
                    'type' => '2',
                ),
            940021 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '940021',
                    'name' => '上海银行-银联申卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            621050 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '621050',
                    'name' => '上海银行-单位借记卡-借记卡',
                    'type' => '2',
                ),
            620522 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '620522',
                    'name' => '上海银行-首发纪念版IC卡-借记卡',
                    'type' => '2',
                ),
            356827 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '356827',
                    'name' => '上海银行-申卡贷记卡-贷记卡',
                    'type' => '1',
                ),
            356828 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '356828',
                    'name' => '上海银行-申卡贷记卡-贷记卡',
                    'type' => '1',
                ),
            356830 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '356830',
                    'name' => '上海银行-J分期付款信用卡-贷记卡',
                    'type' => '1',
                ),
            402673 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '402673',
                    'name' => '上海银行-申卡贷记卡-贷记卡',
                    'type' => '1',
                ),
            402674 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '402674',
                    'name' => '上海银行-申卡贷记卡-贷记卡',
                    'type' => '1',
                ),
            438600 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '438600',
                    'name' => '上海银行-上海申卡IC-借记卡',
                    'type' => '2',
                ),
            486466 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '486466',
                    'name' => '上海银行-申卡贷记卡-贷记卡',
                    'type' => '1',
                ),
            519498 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '519498',
                    'name' => '上海银行-申卡贷记卡普通卡-贷记卡',
                    'type' => '1',
                ),
            520131 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '520131',
                    'name' => '上海银行-申卡贷记卡金卡-贷记卡',
                    'type' => '1',
                ),
            524031 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '524031',
                    'name' => '上海银行-万事达白金卡-贷记卡',
                    'type' => '1',
                ),
            548838 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '548838',
                    'name' => '上海银行-万事达星运卡-贷记卡',
                    'type' => '1',
                ),
            622148 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '622148',
                    'name' => '上海银行-申卡贷记卡金卡-贷记卡',
                    'type' => '1',
                ),
            622149 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '622149',
                    'name' => '上海银行-申卡贷记卡普通卡-贷记卡',
                    'type' => '1',
                ),
            622268 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '622268',
                    'name' => '上海银行-安融卡-贷记卡',
                    'type' => '1',
                ),
            356829 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '356829',
                    'name' => '上海银行-分期付款信用卡-贷记卡',
                    'type' => '1',
                ),
            622300 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '622300',
                    'name' => '上海银行-信用卡-贷记卡',
                    'type' => '1',
                ),
            628230 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '628230',
                    'name' => '上海银行-个人公务卡-贷记卡',
                    'type' => '1',
                ),
            622269 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '622269',
                    'name' => '上海银行-安融卡-贷记卡',
                    'type' => '1',
                ),
            625099 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '625099',
                    'name' => '上海银行-上海银行银联白金卡-贷记卡',
                    'type' => '1',
                ),
            625953 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '625953',
                    'name' => '上海银行-贷记IC卡-贷记卡',
                    'type' => '1',
                ),
            625350 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '625350',
                    'name' => '上海银行-中国旅游卡（IC普卡）-贷记卡',
                    'type' => '1',
                ),
            625351 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '625351',
                    'name' => '上海银行-中国旅游卡（IC金卡）-贷记卡',
                    'type' => '1',
                ),
            625352 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '625352',
                    'name' => '上海银行-中国旅游卡（IC白金卡）-贷记卡',
                    'type' => '1',
                ),
            519961 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '519961',
                    'name' => '上海银行-万事达钻石卡-贷记卡',
                    'type' => '1',
                ),
            625839 =>
                array(
                    'bank_id' => '116',
                    'card_bin' => '625839',
                    'name' => '上海银行-淘宝IC普卡-贷记卡',
                    'type' => '1',
                ),
            628223 =>
                array(
                    'bank_id' => '117',
                    'card_bin' => '628223',
                    'name' => '上饶银行(65264330)-三清山公务卡-贷记卡',
                    'type' => '1',
                ),
            621416 =>
                array(
                    'bank_id' => '117',
                    'card_bin' => '621416',
                    'name' => '上饶银行(65264331)-三清山IC卡-借记卡',
                    'type' => '2',
                ),
            622486 =>
                array(
                    'bank_id' => '118',
                    'card_bin' => '622486',
                    'name' => '绍兴银行股份有限公司-兰花卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            603602 =>
                array(
                    'bank_id' => '118',
                    'card_bin' => '603602',
                    'name' => '绍兴银行股份有限公司-兰花卡-借记卡',
                    'type' => '2',
                ),
            623026 =>
                array(
                    'bank_id' => '118',
                    'card_bin' => '623026',
                    'name' => '绍兴银行-兰花IC借记卡-借记卡',
                    'type' => '2',
                ),
            623086 =>
                array(
                    'bank_id' => '118',
                    'card_bin' => '623086',
                    'name' => '绍兴银行-社保IC借记卡-借记卡',
                    'type' => '2',
                ),
            628291 =>
                array(
                    'bank_id' => '118',
                    'card_bin' => '628291',
                    'name' => '绍兴银行-兰花公务卡-贷记卡',
                    'type' => '1',
                ),
            621244 =>
                array(
                    'bank_id' => '119',
                    'card_bin' => '621244',
                    'name' => '盛京银行-玫瑰卡-借记卡',
                    'type' => '2',
                ),
            623081 =>
                array(
                    'bank_id' => '119',
                    'card_bin' => '623081',
                    'name' => '盛京银行-玫瑰IC卡-借记卡',
                    'type' => '2',
                ),
            623108 =>
                array(
                    'bank_id' => '119',
                    'card_bin' => '623108',
                    'name' => '盛京银行-玫瑰IC卡-借记卡',
                    'type' => '2',
                ),
            566666 =>
                array(
                    'bank_id' => '119',
                    'card_bin' => '566666',
                    'name' => '盛京银行-玫瑰卡-借记卡',
                    'type' => '2',
                ),
            622455 =>
                array(
                    'bank_id' => '119',
                    'card_bin' => '622455',
                    'name' => '盛京银行-玫瑰卡-借记卡',
                    'type' => '2',
                ),
            940039 =>
                array(
                    'bank_id' => '119',
                    'card_bin' => '940039',
                    'name' => '盛京银行-玫瑰卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            622466 =>
                array(
                    'bank_id' => '119',
                    'card_bin' => '622466',
                    'name' => '盛京银行-玫瑰卡(银联卡)-贷记卡',
                    'type' => '1',
                ),
            628285 =>
                array(
                    'bank_id' => '119',
                    'card_bin' => '628285',
                    'name' => '盛京银行-盛京银行公务卡-贷记卡',
                    'type' => '1',
                ),
            622955 =>
                array(
                    'bank_id' => '119',
                    'card_bin' => '622955',
                    'name' => '盛京银行-医保卡-借记卡',
                    'type' => '2',
                ),
            622940 =>
                array(
                    'bank_id' => '120',
                    'card_bin' => '622940',
                    'name' => '石嘴山银行-麒麟借记卡-借记卡',
                    'type' => '2',
                ),
            623120 =>
                array(
                    'bank_id' => '120',
                    'card_bin' => '623120',
                    'name' => '石嘴山银行-麒麟借记卡-借记卡',
                    'type' => '2',
                ),
            628355 =>
                array(
                    'bank_id' => '120',
                    'card_bin' => '628355',
                    'name' => '石嘴山银行-麒麟公务卡-贷记卡',
                    'type' => '1',
                ),
            622855 =>
                array(
                    'bank_id' => '121',
                    'card_bin' => '622855',
                    'name' => '苏州银行股份有限公司-新苏卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            621461 =>
                array(
                    'bank_id' => '121',
                    'card_bin' => '621461',
                    'name' => '苏州银行股份有限公司-新苏卡-借记卡',
                    'type' => '2',
                ),
            623521 =>
                array(
                    'bank_id' => '121',
                    'card_bin' => '623521',
                    'name' => '苏州银行股份有限公司-金桂卡-借记卡',
                    'type' => '2',
                ),
            622321 =>
                array(
                    'bank_id' => '123',
                    'card_bin' => '622321',
                    'name' => '台州银行-大唐贷记卡-贷记卡',
                    'type' => '1',
                ),
            625001 =>
                array(
                    'bank_id' => '123',
                    'card_bin' => '625001',
                    'name' => '台州银行-大唐准贷记卡-准贷记卡',
                    'type' => '1',
                ),
            622427 =>
                array(
                    'bank_id' => '123',
                    'card_bin' => '622427',
                    'name' => '台州银行-大唐卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            940069 =>
                array(
                    'bank_id' => '123',
                    'card_bin' => '940069',
                    'name' => '台州银行-大唐卡-借记卡',
                    'type' => '2',
                ),
            623039 =>
                array(
                    'bank_id' => '123',
                    'card_bin' => '623039',
                    'name' => '台州银行-借记卡-借记卡',
                    'type' => '2',
                ),
            628273 =>
                array(
                    'bank_id' => '123',
                    'card_bin' => '628273',
                    'name' => '台州银行-公务卡-贷记卡',
                    'type' => '1',
                ),
            628205 =>
                array(
                    'bank_id' => '126',
                    'card_bin' => '628205',
                    'name' => '天津银行-商务卡-贷记卡',
                    'type' => '1',
                ),
            621038 =>
                array(
                    'bank_id' => '127',
                    'card_bin' => '621038',
                    'name' => '铁岭银行-龙凤卡-借记卡',
                    'type' => '2',
                ),
            623102 =>
                array(
                    'bank_id' => '128',
                    'card_bin' => '623102',
                    'name' => '威海市商业银行-通达借记IC卡-借记卡',
                    'type' => '2',
                ),
            628234 =>
                array(
                    'bank_id' => '128',
                    'card_bin' => '628234',
                    'name' => '威海市商业银行(64814650)-通达公务卡-贷记卡',
                    'type' => '1',
                ),
            622391 =>
                array(
                    'bank_id' => '129',
                    'card_bin' => '622391',
                    'name' => '潍坊银行-鸢都卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            940072 =>
                array(
                    'bank_id' => '129',
                    'card_bin' => '940072',
                    'name' => '潍坊银行-鸳都卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            628391 =>
                array(
                    'bank_id' => '129',
                    'card_bin' => '628391',
                    'name' => '潍坊银行(64624580)-鸢都公务卡-贷记卡',
                    'type' => '1',
                ),
            621977 =>
                array(
                    'bank_id' => '130',
                    'card_bin' => '621977',
                    'name' => '温州银行-金鹿卡-借记卡',
                    'type' => '2',
                ),
            622868 =>
                array(
                    'bank_id' => '130',
                    'card_bin' => '622868',
                    'name' => '温州银行-金鹿信用卡-贷记卡',
                    'type' => '1',
                ),
            622899 =>
                array(
                    'bank_id' => '130',
                    'card_bin' => '622899',
                    'name' => '温州银行-金鹿信用卡-贷记卡',
                    'type' => '1',
                ),
            628255 =>
                array(
                    'bank_id' => '130',
                    'card_bin' => '628255',
                    'name' => '温州银行-金鹿公务卡-贷记卡',
                    'type' => '1',
                ),
            625988 =>
                array(
                    'bank_id' => '130',
                    'card_bin' => '625988',
                    'name' => '温州银行-贷记IC卡-贷记卡',
                    'type' => '1',
                ),
            622973 =>
                array(
                    'bank_id' => '131',
                    'card_bin' => '622973',
                    'name' => '乌海银行股份有限公司-狮城借记卡-借记卡',
                    'type' => '2',
                ),
            623153 =>
                array(
                    'bank_id' => '131',
                    'card_bin' => '623153',
                    'name' => '乌海银行股份有限公司----借记卡',
                    'type' => '2',
                ),
            622136 =>
                array(
                    'bank_id' => '133',
                    'card_bin' => '622136',
                    'name' => '西安银行股份有限公司-福瑞卡-借记卡',
                    'type' => '2',
                ),
            622981 =>
                array(
                    'bank_id' => '133',
                    'card_bin' => '622981',
                    'name' => '西安银行股份有限公司-金丝路卡-借记卡',
                    'type' => '2',
                ),
            623165 =>
                array(
                    'bank_id' => '133',
                    'card_bin' => '623165',
                    'name' => '西安银行股份有限公司-金丝路借记卡-借记卡',
                    'type' => '2',
                ),
            621391 =>
                array(
                    'bank_id' => '134',
                    'card_bin' => '621391',
                    'name' => '西藏银行-借记IC卡-借记卡',
                    'type' => '2',
                ),
            622393 =>
                array(
                    'bank_id' => '136',
                    'card_bin' => '622393',
                    'name' => '厦门银行股份有限公司-银鹭借记卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            6886592 =>
                array(
                    'bank_id' => '136',
                    'card_bin' => '6886592',
                    'name' => '厦门银行股份有限公司-银鹭卡-借记卡',
                    'type' => '2',
                ),
            940023 =>
                array(
                    'bank_id' => '136',
                    'card_bin' => '940023',
                    'name' => '厦门银行股份有限公司-银联卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            623019 =>
                array(
                    'bank_id' => '136',
                    'card_bin' => '623019',
                    'name' => '厦门银行股份有限公司-凤凰花卡-借记卡',
                    'type' => '2',
                ),
            621600 =>
                array(
                    'bank_id' => '136',
                    'card_bin' => '621600',
                    'name' => '厦门银行股份有限公司-凤凰花卡-借记卡',
                    'type' => '2',
                ),
            621339 =>
                array(
                    'bank_id' => '137',
                    'card_bin' => '621339',
                    'name' => '新疆汇和银行-汇和卡-借记卡',
                    'type' => '2',
                ),
            621238 =>
                array(
                    'bank_id' => '138',
                    'card_bin' => '621238',
                    'name' => '邢台银行股份有限公司-金牛卡-借记卡',
                    'type' => '2',
                ),
            620528 =>
                array(
                    'bank_id' => '138',
                    'card_bin' => '620528',
                    'name' => '邢台银行(65541310)-金牛市民卡-借记卡',
                    'type' => '2',
                ),
            621325 =>
                array(
                    'bank_id' => '139',
                    'card_bin' => '621325',
                    'name' => '雅安市商业银行-锦城卡-借记卡',
                    'type' => '2',
                ),
            623084 =>
                array(
                    'bank_id' => '139',
                    'card_bin' => '623084',
                    'name' => '雅安市商业银行----借记卡',
                    'type' => '2',
                ),
            621272 =>
                array(
                    'bank_id' => '141',
                    'card_bin' => '621272',
                    'name' => '阳泉市商业银行-金鼎卡-借记卡',
                    'type' => '2',
                ),
            621738 =>
                array(
                    'bank_id' => '141',
                    'card_bin' => '621738',
                    'name' => '阳泉市商业银行-金鼎卡-借记卡',
                    'type' => '2',
                ),
            621273 =>
                array(
                    'bank_id' => '142',
                    'card_bin' => '621273',
                    'name' => '宜宾市商业银行-锦程卡-借记卡',
                    'type' => '2',
                ),
            623079 =>
                array(
                    'bank_id' => '142',
                    'card_bin' => '623079',
                    'name' => '宜宾市商业银行-借记IC卡-借记卡',
                    'type' => '2',
                ),
            621348 =>
                array(
                    'bank_id' => '143',
                    'card_bin' => '621348',
                    'name' => '营口沿海银行-祥云借记卡-借记卡',
                    'type' => '2',
                ),
            622400 =>
                array(
                    'bank_id' => '144',
                    'card_bin' => '622400',
                    'name' => '营口银行股份有限公司-辽河一卡通(银联卡)-借记卡',
                    'type' => '2',
                ),
            623177 =>
                array(
                    'bank_id' => '144',
                    'card_bin' => '623177',
                    'name' => '营口银行股份有限公司-营银卡-借记卡',
                    'type' => '2',
                ),
            623087 =>
                array(
                    'bank_id' => '146',
                    'card_bin' => '623087',
                    'name' => '枣庄银行-借记IC卡-借记卡',
                    'type' => '2',
                ),
            621028 =>
                array(
                    'bank_id' => '148',
                    'card_bin' => '621028',
                    'name' => '浙江稠州商业银行-义卡-借记卡',
                    'type' => '2',
                ),
            623083 =>
                array(
                    'bank_id' => '148',
                    'card_bin' => '623083',
                    'name' => '浙江稠州商业银行-义卡借记IC卡-借记卡',
                    'type' => '2',
                ),
            628250 =>
                array(
                    'bank_id' => '148',
                    'card_bin' => '628250',
                    'name' => '浙江稠州商业银行-公务卡-贷记卡',
                    'type' => '1',
                ),
            621726 =>
                array(
                    'bank_id' => '149',
                    'card_bin' => '621726',
                    'name' => '浙江民泰商业银行-金融IC卡-借记卡',
                    'type' => '2',
                ),
            621088 =>
                array(
                    'bank_id' => '149',
                    'card_bin' => '621088',
                    'name' => '浙江民泰商业银行-民泰借记卡-借记卡',
                    'type' => '2',
                ),
            620517 =>
                array(
                    'bank_id' => '149',
                    'card_bin' => '620517',
                    'name' => '浙江民泰商业银行-金融IC卡C卡-预付费卡',
                    'type' => '3',
                ),
            622740 =>
                array(
                    'bank_id' => '149',
                    'card_bin' => '622740',
                    'name' => '浙江民泰商业银行-银联标准普卡金卡-贷记卡',
                    'type' => '1',
                ),
            625036 =>
                array(
                    'bank_id' => '149',
                    'card_bin' => '625036',
                    'name' => '浙江民泰商业银行-商惠通-准贷记卡',
                    'type' => '1',
                ),
            628275 =>
                array(
                    'bank_id' => '150',
                    'card_bin' => '628275',
                    'name' => '浙江泰隆商业银行(64733450)-泰隆公务卡(单位卡)-贷记卡',
                    'type' => '1',
                ),
            622565 =>
                array(
                    'bank_id' => '150',
                    'card_bin' => '622565',
                    'name' => '浙江泰隆商业银行(64733450)-泰隆尊尚白金卡、钻石卡-贷记卡',
                    'type' => '1',
                ),
            622287 =>
                array(
                    'bank_id' => '150',
                    'card_bin' => '622287',
                    'name' => '浙江泰隆商业银行(64733450)-泰隆信用卡-贷记卡',
                    'type' => '1',
                ),
            622717 =>
                array(
                    'bank_id' => '150',
                    'card_bin' => '622717',
                    'name' => '浙江泰隆商业银行(64733450)-融易通-准贷记卡',
                    'type' => '1',
                ),
            622421 =>
                array(
                    'bank_id' => '151',
                    'card_bin' => '622421',
                    'name' => '郑州银行股份有限公司-世纪一卡通(银联卡)-借记卡',
                    'type' => '2',
                ),
            940056 =>
                array(
                    'bank_id' => '151',
                    'card_bin' => '940056',
                    'name' => '郑州银行股份有限公司-世纪一卡通-借记卡',
                    'type' => '2',
                ),
            96828 =>
                array(
                    'bank_id' => '151',
                    'card_bin' => '96828',
                    'name' => '郑州银行股份有限公司-世纪一卡通-借记卡',
                    'type' => '2',
                ),
            622363 =>
                array(
                    'bank_id' => '152',
                    'card_bin' => '622363',
                    'name' => '珠海华润银行股份有限公司-万事顺卡-借记卡',
                    'type' => '2',
                ),
            940048 =>
                array(
                    'bank_id' => '152',
                    'card_bin' => '940048',
                    'name' => '珠海华润银行股份有限公司-万事顺卡(银联卡)-借记卡',
                    'type' => '2',
                ),
            621455 =>
                array(
                    'bank_id' => '152',
                    'card_bin' => '621455',
                    'name' => '珠海华润银行股份有限公司-珠海华润银行IC借记卡-借记卡',
                    'type' => '2',
                ),
            628270 =>
                array(
                    'bank_id' => '152',
                    'card_bin' => '628270',
                    'name' => '珠海华润银行(64375850)-公务信用卡-贷记卡',
                    'type' => '1',
                ),
        ),
    "banks" =>
        array(
            1 =>
                array(
                    'id' => '1',
                    'bank_name' => '中国人民银行',
                    'en_name' => 'PEOPLE\'S BANK OF CHINA',
                    'start_year' => '1948',
                    'swift_code' => 'PBOCCNBJ',
                    'color' => '',
                    'bank_image' => '',
                ),
            2 =>
                array(
                    'id' => '2',
                    'bank_name' => '中国进出口银行',
                    'en_name' => 'THE EXPORT-IMPORT BANK OF CHINA',
                    'start_year' => '1994',
                    'swift_code' => 'EIBCFRP1',
                    'color' => '',
                    'bank_image' => '',
                ),
            3 =>
                array(
                    'id' => '3',
                    'bank_name' => '中国农业发展银行',
                    'en_name' => 'AGRICULTURAL DEVELOPMENT BANK OF CHINA',
                    'start_year' => '1994',
                    'swift_code' => 'ADBNCNBJ',
                    'color' => '',
                    'bank_image' => '',
                ),
            4 =>
                array(
                    'id' => '4',
                    'bank_name' => '国家开发银行',
                    'en_name' => 'CHINA DEVELOPMENT BANK',
                    'start_year' => '2008',
                    'swift_code' => 'SDBCCNBJ',
                    'color' => '',
                    'bank_image' => '',
                ),
            5 =>
                array(
                    'id' => '5',
                    'bank_name' => '中国工商银行',
                    'en_name' => 'INDUSTRIAL AND COMMERCIAL BANK OF CHINA',
                    'start_year' => '1984',
                    'swift_code' => 'ICBKCNBJ',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/630af3d9744a0f7add21e0380f6e307f.png',
                ),
            6 =>
                array(
                    'id' => '6',
                    'bank_name' => '中国农业银行',
                    'en_name' => 'AGRICULTURAL BANK OF CHINA',
                    'start_year' => '1979',
                    'swift_code' => 'ABOCCNBJ',
                    'color' => '#FF58BE69',
                    'bank_image' => 'bank-icon/f5bc02635018485e3ab079a13e280575.png',
                ),
            7 =>
                array(
                    'id' => '7',
                    'bank_name' => '中国银行',
                    'en_name' => 'BANK OF CHINA LIMITED',
                    'start_year' => '1912',
                    'swift_code' => 'BKCHCNBJ',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/04114b63c2f46ae4a218a932de3b5327.png',
                ),
            8 =>
                array(
                    'id' => '8',
                    'bank_name' => '中国建设银行',
                    'en_name' => 'CHINA CONSTRUCTION BANK CORPORATION',
                    'start_year' => '1954',
                    'swift_code' => 'PCBCCNBJ',
                    'color' => '#FF2E73DC',
                    'bank_image' => 'bank-icon/92f4a501fa0b076afe8ca81bd9b56d4e.png',
                ),
            9 =>
                array(
                    'id' => '9',
                    'bank_name' => '交通银行',
                    'en_name' => 'BANK OF COMMUNICATIONS',
                    'start_year' => '1908',
                    'swift_code' => 'COMMCNSH',
                    'color' => '#FF154B80',
                    'bank_image' => 'bank-icon/d5b91144d88502dd03659d0ba02e4ba3.png',
                ),
            10 =>
                array(
                    'id' => '10',
                    'bank_name' => '中国邮政储蓄银行',
                    'en_name' => 'POSTAL SAVINGS BANK OF CHINA',
                    'start_year' => '2006',
                    'swift_code' => 'PSBCCNBJ',
                    'color' => '#FF58BE69',
                    'bank_image' => 'bank-icon/cf4748f4d950641f7c70ad6ac6309e8d.png',
                ),
            11 =>
                array(
                    'id' => '11',
                    'bank_name' => '中国光大银行',
                    'en_name' => 'CHINA EVERBRIGHT BANK',
                    'start_year' => '1992',
                    'swift_code' => 'EVERCNBJ',
                    'color' => '#FFFFB241',
                    'bank_image' => 'bank-icon/374984955211414e39231e55de47a7ff.png',
                ),
            12 =>
                array(
                    'id' => '12',
                    'bank_name' => '中国民生银行',
                    'en_name' => 'CHINA MINSHENG BANKING CORPORATION, LIMITED',
                    'start_year' => '1996',
                    'swift_code' => 'MSBCCNBJ',
                    'color' => '#FF3BC8CE',
                    'bank_image' => 'bank-icon/d0eb2b7afb35c0e75fd474d97a2e50e2.png',
                ),
            13 =>
                array(
                    'id' => '13',
                    'bank_name' => '招商银行',
                    'en_name' => 'CHINA MERCHANTS BANK',
                    'start_year' => '1987',
                    'swift_code' => 'CMBCCNBS',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/b0fe1c999806d26035c9f7d602aa8417.png',
                ),
            14 =>
                array(
                    'id' => '14',
                    'bank_name' => '中信银行',
                    'en_name' => 'CITIC BANK CORPORATION LIMITED',
                    'start_year' => '1987',
                    'swift_code' => 'CIBKCNBJ',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/1ce5012cd01376a0351e51ad6f54ca48.png',
                ),
            15 =>
                array(
                    'id' => '15',
                    'bank_name' => '华夏银行',
                    'en_name' => 'HUA XIA BANK',
                    'start_year' => '1992',
                    'swift_code' => 'HXBKCNBJ',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/a4b7b3b367cbba6f0cd33f793c65f769.png',
                ),
            16 =>
                array(
                    'id' => '16',
                    'bank_name' => '浦发银行',
                    'en_name' => 'SHANGHAI PUDONG DEVELOPMENT BANK',
                    'start_year' => '1992',
                    'swift_code' => 'SPDBCNSH',
                    'color' => '#FF154B80',
                    'bank_image' => 'bank-icon/dddb3ce6f4d0feda7443752786aa3c26.png',
                ),
            17 =>
                array(
                    'id' => '17',
                    'bank_name' => '平安银行',
                    'en_name' => 'PING AN BANK',
                    'start_year' => '1987',
                    'swift_code' => 'SZDBCNBS',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/a6a15acb9209cebf0726bb91cd03b67e.png',
                ),
            18 =>
                array(
                    'id' => '18',
                    'bank_name' => '广发银行',
                    'en_name' => 'CHINA GUANGFA BANK',
                    'start_year' => '1988',
                    'swift_code' => 'GDBKCN22',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/86d2c320c22b02214a651c2ce3591569.png',
                ),
            19 =>
                array(
                    'id' => '19',
                    'bank_name' => '兴业银行',
                    'en_name' => 'INDUSTRIAL BANK',
                    'start_year' => '1988',
                    'swift_code' => 'FJIBCNBA',
                    'color' => '#FF154B80',
                    'bank_image' => 'bank-icon/5e0ffca6c58fb7d655de0ef763ae5790.png',
                ),
            20 =>
                array(
                    'id' => '20',
                    'bank_name' => '浙商银行',
                    'en_name' => 'CHINA ZHESHANG BANK',
                    'start_year' => '2004',
                    'swift_code' => 'ZJCBCN2N',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/561277c090ad5c6cfe0956d48f724c16.png',
                ),
            21 =>
                array(
                    'id' => '21',
                    'bank_name' => '渤海银行',
                    'en_name' => 'CHINA BOHAI BANK',
                    'start_year' => '2005',
                    'swift_code' => 'CHBHCNBT',
                    'color' => '#FF2E73DC',
                    'bank_image' => 'bank-icon/f5c5ce1fbd2f7bbb860c0c32fad55948.png',
                ),
            22 =>
                array(
                    'id' => '22',
                    'bank_name' => '恒丰银行',
                    'en_name' => 'HENGFENG BANK',
                    'start_year' => '1987',
                    'swift_code' => 'HFBACNSD',
                    'color' => '#FF154B80',
                    'bank_image' => 'bank-icon/7906ef02c0be5e5f4f3ffb9c84456b5a.png',
                ),
            23 =>
                array(
                    'id' => '23',
                    'bank_name' => '鞍山银行',
                    'en_name' => 'BANK OF ANSHAN',
                    'start_year' => '1998',
                    'swift_code' => 'ANBKCNBA',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/2f818943bcb7dd0aa19f61d0fa491158.png',
                ),
            24 =>
                array(
                    'id' => '24',
                    'bank_name' => '包商银行',
                    'en_name' => 'BAOSHANG BANK',
                    'start_year' => '1998',
                    'swift_code' => 'BTCBCNBJ',
                    'color' => '#FFFFB241',
                    'bank_image' => 'bank-icon/78e8da40c415ccf3cc9ae6abee0a7a7b.png',
                ),
            25 =>
                array(
                    'id' => '25',
                    'bank_name' => '保定银行',
                    'en_name' => 'BANK OF BAODING',
                    'start_year' => '2008',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            26 =>
                array(
                    'id' => '26',
                    'bank_name' => '北京银行',
                    'en_name' => 'BANK OF BEIJING',
                    'start_year' => '1995',
                    'swift_code' => 'BJCNCNBJ',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/f6f420279df85be79e949dbf43e4d992.png',
                ),
            27 =>
                array(
                    'id' => '27',
                    'bank_name' => '本溪市商业银行',
                    'en_name' => 'BENXI CITY COMMERCIAL BANK',
                    'start_year' => '2010',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            28 =>
                array(
                    'id' => '28',
                    'bank_name' => '沧州银行',
                    'en_name' => 'BANK OF CANGZHOU',
                    'start_year' => '1998',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            29 =>
                array(
                    'id' => '29',
                    'bank_name' => '长安银行',
                    'en_name' => 'BANK OF CHANG\'AN',
                    'start_year' => '2009',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            30 =>
                array(
                    'id' => '30',
                    'bank_name' => '长沙银行',
                    'en_name' => 'BANK OF CHANGSHA',
                    'start_year' => '1997',
                    'swift_code' => 'CHCCCNSS',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/e52bdb0338ae27b9cb2080faea5845ae.png',
                ),
            31 =>
                array(
                    'id' => '31',
                    'bank_name' => '长治银行',
                    'en_name' => 'BANK OF CHANGZHI',
                    'start_year' => '2005',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            32 =>
                array(
                    'id' => '32',
                    'bank_name' => '朝阳银行',
                    'en_name' => 'BANK OF CHAOYANG',
                    'start_year' => '2008',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            33 =>
                array(
                    'id' => '33',
                    'bank_name' => '成都银行',
                    'en_name' => 'BANK OF CHENGDU',
                    'start_year' => '1996',
                    'swift_code' => 'CBOCCNBC',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/3114c5765100781c8c5557a2f1e91e52.png',
                ),
            34 =>
                array(
                    'id' => '34',
                    'bank_name' => '承德银行',
                    'en_name' => 'BANK OF CHENGDE',
                    'start_year' => '2006',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            35 =>
                array(
                    'id' => '35',
                    'bank_name' => '重庆三峡银行',
                    'en_name' => 'CHONGQING THREE GORGES BANK',
                    'start_year' => '1998',
                    'swift_code' => 'CTGBCN22',
                    'color' => '#FF2E73DC',
                    'bank_image' => 'bank-icon/0096ea2db78cdcdc2301747fcefdbc07.png',
                ),
            36 =>
                array(
                    'id' => '36',
                    'bank_name' => '重庆银行',
                    'en_name' => 'BANK OF CHONGQING',
                    'start_year' => '1996',
                    'swift_code' => 'CQCBCN22',
                    'color' => '#FF58BE69',
                    'bank_image' => 'bank-icon/6906b8ed2f6dd8fd90132c938b0c339e.png',
                ),
            37 =>
                array(
                    'id' => '37',
                    'bank_name' => '达州市商业银行',
                    'en_name' => 'DAZHOU CITY COMMERCIAL BANK',
                    'start_year' => '2001',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            38 =>
                array(
                    'id' => '38',
                    'bank_name' => '大连银行',
                    'en_name' => 'BANK OF DALIAN',
                    'start_year' => '1998',
                    'swift_code' => 'DLCBCNBD',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/a889f2855ad959c23306903b5998ff0b.png',
                ),
            39 =>
                array(
                    'id' => '39',
                    'bank_name' => '大同银行',
                    'en_name' => 'DATONG OF BANK',
                    'start_year' => '2000',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            40 =>
                array(
                    'id' => '40',
                    'bank_name' => '丹东银行',
                    'en_name' => 'BANK OF DANDONG',
                    'start_year' => '1997',
                    'swift_code' => 'DDBKCNBD',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/ef6a7679a75cfbd4633bc842427419c1.png',
                ),
            41 =>
                array(
                    'id' => '41',
                    'bank_name' => '长城华西银行',
                    'en_name' => 'GW BANK',
                    'start_year' => '1998',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            42 =>
                array(
                    'id' => '42',
                    'bank_name' => '德州银行',
                    'en_name' => 'DEZHOU BANK',
                    'start_year' => '2005',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            43 =>
                array(
                    'id' => '43',
                    'bank_name' => '东莞银行',
                    'en_name' => 'BANK OF DONGGUAN',
                    'start_year' => '1999',
                    'swift_code' => 'DGCBCN22',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/df1c16f7523a56d09457dcf95b50bc52.png',
                ),
            44 =>
                array(
                    'id' => '44',
                    'bank_name' => '东营银行',
                    'en_name' => 'DONGYING BANK',
                    'start_year' => '2005',
                    'swift_code' => 'DYSHCNBJ',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/8e0c7d2be898af823ec8ff4919dcb7eb.png',
                ),
            45 =>
                array(
                    'id' => '45',
                    'bank_name' => '鄂尔多斯银行',
                    'en_name' => 'ORDOS BANK',
                    'start_year' => '2007',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            46 =>
                array(
                    'id' => '46',
                    'bank_name' => '福建海峡银行',
                    'en_name' => 'FUJIAN HAIXIA BANK',
                    'start_year' => '1996',
                    'swift_code' => 'FZCBCNBS',
                    'color' => '#FF2E73DC',
                    'bank_image' => 'bank-icon/b921829e693486ee15059fa2c1d7f07f.png',
                ),
            47 =>
                array(
                    'id' => '47',
                    'bank_name' => '抚顺银行',
                    'en_name' => 'BANK OF FUSHUN',
                    'start_year' => '1997',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            48 =>
                array(
                    'id' => '48',
                    'bank_name' => '阜新银行',
                    'en_name' => 'BANK OF FUXIN',
                    'start_year' => '2001',
                    'swift_code' => 'FXBKCNBJ',
                    'color' => '#FF2E73DC',
                    'bank_image' => 'bank-icon/395319c0920a0488d0743283e943c7da.png',
                ),
            49 =>
                array(
                    'id' => '49',
                    'bank_name' => '富滇银行',
                    'en_name' => 'BANK OF RICH YUNNAN',
                    'start_year' => '1996',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            50 =>
                array(
                    'id' => '50',
                    'bank_name' => '甘肃银行',
                    'en_name' => 'BANK OF GANSU',
                    'start_year' => '2011',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            51 =>
                array(
                    'id' => '51',
                    'bank_name' => '赣州银行',
                    'en_name' => 'BANK OF GANZHOU',
                    'start_year' => '2001',
                    'swift_code' => 'BKGZCNBN',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/a1014fff439704bb3018677c4cf19564.png',
                ),
            52 =>
                array(
                    'id' => '52',
                    'bank_name' => '广东华兴银行',
                    'en_name' => 'GUANGDONG HUAXING BANK',
                    'start_year' => '2011',
                    'swift_code' => 'GDHBCN22',
                    'color' => '#FFFFB241',
                    'bank_image' => 'bank-icon/a4d2a894b5037ebc2ab03f2bcd76bd81.png',
                ),
            53 =>
                array(
                    'id' => '53',
                    'bank_name' => '广东南粤银行',
                    'en_name' => 'BANK OF GUANGDONG NAN YUE',
                    'start_year' => '1997',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            54 =>
                array(
                    'id' => '54',
                    'bank_name' => '广西北部湾银行',
                    'en_name' => 'GUANGXI BEIBU GULF BANK',
                    'start_year' => '1997',
                    'swift_code' => 'BGBKCNBJ',
                    'color' => '#FFFFB241',
                    'bank_image' => 'bank-icon/8d4686db04db11470f96856cece27a34.png',
                ),
            55 =>
                array(
                    'id' => '55',
                    'bank_name' => '广州银行',
                    'en_name' => 'BANK OF GUANGZHOU',
                    'start_year' => '1996',
                    'swift_code' => 'GZCBCN22',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/09f1218b62ffb5e77398336a1cdd298f.png',
                ),
            56 =>
                array(
                    'id' => '56',
                    'bank_name' => '贵阳银行',
                    'en_name' => 'BANK OF GUIYANG',
                    'start_year' => '1997',
                    'swift_code' => 'GYCBCNSI',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/16830465cfc5e51fc2425695291c6d58.png',
                ),
            57 =>
                array(
                    'id' => '57',
                    'bank_name' => '贵州银行',
                    'en_name' => 'BANK OF GUIZHOU',
                    'start_year' => '2012',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            58 =>
                array(
                    'id' => '58',
                    'bank_name' => '桂林银行',
                    'en_name' => 'GUILIN BANK',
                    'start_year' => '1997',
                    'swift_code' => 'GLBKCNBG',
                    'color' => '#FF2E73DC',
                    'bank_image' => 'bank-icon/d7557f9590b67464ae62c57949beda22.png',
                ),
            59 =>
                array(
                    'id' => '59',
                    'bank_name' => '哈尔滨银行',
                    'en_name' => 'HARBIN BANK',
                    'start_year' => '1997',
                    'swift_code' => 'HCCBCNBH',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/6acb4d0b02bb7a0087512779e67c08c1.png',
                ),
            60 =>
                array(
                    'id' => '60',
                    'bank_name' => '哈密市商业银行',
                    'en_name' => 'HAMI CITY COMMERCIAL BANK',
                    'start_year' => '2010',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            61 =>
                array(
                    'id' => '61',
                    'bank_name' => '邯郸银行',
                    'en_name' => 'BANK OF HANDAN',
                    'start_year' => '2008',
                    'swift_code' => 'BKHDCNB1',
                    'color' => '#FF2E73DC',
                    'bank_image' => 'bank-icon/b90e4c43076223ddf172b15b7aa8c9f2.png',
                ),
            62 =>
                array(
                    'id' => '62',
                    'bank_name' => '汉口银行',
                    'en_name' => 'HANKOU BANK',
                    'start_year' => '1997',
                    'swift_code' => 'WHCBCNBN',
                    'color' => '#FF2E73DC',
                    'bank_image' => 'bank-icon/1c4b87aa755daea7fe0103efec486d0c.png',
                ),
            63 =>
                array(
                    'id' => '63',
                    'bank_name' => '杭州银行',
                    'en_name' => 'BANK OF HANGZHOU',
                    'start_year' => '1996',
                    'swift_code' => 'HZCBCN2H',
                    'color' => '#FF2E73DC',
                    'bank_image' => 'bank-icon/94f9df971112afa9cb18e32c3a4acaf1.png',
                ),
            64 =>
                array(
                    'id' => '64',
                    'bank_name' => '河北银行',
                    'en_name' => 'BANK OF HEBEI',
                    'start_year' => '1996',
                    'swift_code' => 'BKSHCNBJ',
                    'color' => '#FF2E73DC',
                    'bank_image' => 'bank-icon/e91a4d287dc232fa2538ca7fe44d79ce.png',
                ),
            65 =>
                array(
                    'id' => '65',
                    'bank_name' => '衡水银行',
                    'en_name' => 'BANK OF HENGSHUI',
                    'start_year' => '2009',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            66 =>
                array(
                    'id' => '66',
                    'bank_name' => '葫芦岛银行',
                    'en_name' => 'BANK OF HULUDAO',
                    'start_year' => '2001',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            67 =>
                array(
                    'id' => '67',
                    'bank_name' => '湖北银行',
                    'en_name' => 'BANK OF HUBEI',
                    'start_year' => '2011',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            68 =>
                array(
                    'id' => '68',
                    'bank_name' => '湖州银行',
                    'en_name' => 'BANK OF HUZHOU',
                    'start_year' => '1997',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            69 =>
                array(
                    'id' => '69',
                    'bank_name' => '华融湘江银行',
                    'en_name' => 'HUARONG XIANGJINAG BANK',
                    'start_year' => '2010',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            70 =>
                array(
                    'id' => '70',
                    'bank_name' => '徽商银行',
                    'en_name' => 'HUISHANG BANK',
                    'start_year' => '2005',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            71 =>
                array(
                    'id' => '71',
                    'bank_name' => '吉林银行',
                    'en_name' => 'BANK OF JILIN',
                    'start_year' => '1997',
                    'swift_code' => 'JLBKCNBJ',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/f16b446b8dc746573b8c3a6ecd5a1341.png',
                ),
            72 =>
                array(
                    'id' => '72',
                    'bank_name' => '济宁银行',
                    'en_name' => 'BANK OF JINING',
                    'start_year' => '2006',
                    'swift_code' => 'BKJNCNBJ',
                    'color' => '#FF2E73DC',
                    'bank_image' => 'bank-icon/59f8a5f2ccab632116924aeec407d268.png',
                ),
            73 =>
                array(
                    'id' => '73',
                    'bank_name' => '嘉兴银行',
                    'en_name' => 'BANK OF JIAXING',
                    'start_year' => '1996',
                    'swift_code' => 'BOJXCNBJ',
                    'color' => '#FF3BC8CE',
                    'bank_image' => 'bank-icon/eee532b04e8a0c07b41f6c71184fb324.png',
                ),
            74 =>
                array(
                    'id' => '74',
                    'bank_name' => '江苏银行',
                    'en_name' => 'BANK OF JIANGSU',
                    'start_year' => '2006',
                    'swift_code' => 'BOJSCNBN',
                    'color' => '#FF2E73DC',
                    'bank_image' => 'bank-icon/992e1d88ac68fc17eb1c5de9a791b3ed.png',
                ),
            75 =>
                array(
                    'id' => '75',
                    'bank_name' => '焦作中旅银行',
                    'en_name' => 'BANK OF CTS.JZ',
                    'start_year' => '1998',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            76 =>
                array(
                    'id' => '76',
                    'bank_name' => '金华银行',
                    'en_name' => 'BANK OF JINHUA',
                    'start_year' => '1997',
                    'swift_code' => 'JHCBCNBJ',
                    'color' => '#FFFFB241',
                    'bank_image' => 'bank-icon/45a217332b1ecf75c17461afa596dcc3.png',
                ),
            77 =>
                array(
                    'id' => '77',
                    'bank_name' => '锦州银行',
                    'en_name' => 'BANK OF JINZHOU',
                    'start_year' => '1997',
                    'swift_code' => 'JZCBCNBJ',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/520be2fbad2430e7170add764ba783c7.png',
                ),
            78 =>
                array(
                    'id' => '78',
                    'bank_name' => '晋城银行',
                    'en_name' => 'JINCHENG BANK',
                    'start_year' => '2005',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            79 =>
                array(
                    'id' => '79',
                    'bank_name' => '晋商银行',
                    'en_name' => 'JINSHANG BANK',
                    'start_year' => '1998',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            80 =>
                array(
                    'id' => '80',
                    'bank_name' => '晋中银行',
                    'en_name' => 'BANK OF JINZHONG',
                    'start_year' => '2007',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            81 =>
                array(
                    'id' => '81',
                    'bank_name' => '江西银行',
                    'en_name' => 'JIANGXI OF BANK',
                    'start_year' => '2015',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            82 =>
                array(
                    'id' => '82',
                    'bank_name' => '九江银行',
                    'en_name' => 'BANK OF JIUJIANG',
                    'start_year' => '2000',
                    'swift_code' => 'BOJJCNBJ',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/bbe26b68fb8d7434afd9396631c82364.png',
                ),
            83 =>
                array(
                    'id' => '83',
                    'bank_name' => '中原银行',
                    'en_name' => 'ZHONGYUAN OF BANK',
                    'start_year' => '2014',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            84 =>
                array(
                    'id' => '84',
                    'bank_name' => '库尔勒银行',
                    'en_name' => 'KORLA OF BANK',
                    'start_year' => '2009',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            85 =>
                array(
                    'id' => '85',
                    'bank_name' => '昆仑银行',
                    'en_name' => 'BANK OF THE KUNLUN',
                    'start_year' => '2010',
                    'swift_code' => 'CKLBCNBJ',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/50cbc6a0a46f6cebbabecc2a5f024f1d.png',
                ),
            86 =>
                array(
                    'id' => '86',
                    'bank_name' => '莱商银行',
                    'en_name' => 'LAISHANG BANK',
                    'start_year' => '2005',
                    'swift_code' => 'LWCBCNBJ',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/11e32ce47b1946a8b553191e4d43f735.png',
                ),
            87 =>
                array(
                    'id' => '87',
                    'bank_name' => '兰州银行',
                    'en_name' => 'BANK OF LANZHOU',
                    'start_year' => '1997',
                    'swift_code' => 'LZCBCNBL',
                    'color' => '#FF2E73DC',
                    'bank_image' => 'bank-icon/f9a456eaa47a557dfbc04c07b3691523.png',
                ),
            88 =>
                array(
                    'id' => '88',
                    'bank_name' => '廊坊银行',
                    'en_name' => 'BANK OF LANGFANG',
                    'start_year' => '2000',
                    'swift_code' => 'BOLFCNBL',
                    'color' => '#FF2E73DC',
                    'bank_image' => 'bank-icon/7f669711559987aba49e69278f46a69c.png',
                ),
            89 =>
                array(
                    'id' => '89',
                    'bank_name' => '乐山市商业银行',
                    'en_name' => 'LESHAN CITY COMMERCIAL BANK',
                    'start_year' => '1997',
                    'swift_code' => 'LSCCCNBL',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/c18e8b3da3d97fb7d1a775a0ed17157b.png',
                ),
            90 =>
                array(
                    'id' => '90',
                    'bank_name' => '凉山州商业银行',
                    'en_name' => 'LIANGSHAN PREFECTURE COMMERCIAL BANK',
                    'start_year' => '2007',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            91 =>
                array(
                    'id' => '91',
                    'bank_name' => '辽阳银行',
                    'en_name' => 'BANK OF LIAOYANG',
                    'start_year' => '1997',
                    'swift_code' => 'LCOMCNBJ',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/cecae253846d2c07220f6b6f3457d664.png',
                ),
            92 =>
                array(
                    'id' => '92',
                    'bank_name' => '临商银行',
                    'en_name' => 'LINSHANG BANK',
                    'start_year' => '1998',
                    'swift_code' => 'LYCBCNBL',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/726f4d0f00934aef389aedaf313cfcd5.png',
                ),
            93 =>
                array(
                    'id' => '93',
                    'bank_name' => '柳州银行',
                    'en_name' => 'BANK OF LIUZHOU',
                    'start_year' => '1997',
                    'swift_code' => 'LZBKCNBJ',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/54db00c534860a65b9f211eafb6fcc30.png',
                ),
            94 =>
                array(
                    'id' => '94',
                    'bank_name' => '龙江银行',
                    'en_name' => 'BANK OF LONGJIANG',
                    'start_year' => '2009',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            95 =>
                array(
                    'id' => '95',
                    'bank_name' => '泸州市商业银行',
                    'en_name' => 'LUZHOU CITY COMMERCIAL BANK',
                    'start_year' => '1997',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            96 =>
                array(
                    'id' => '96',
                    'bank_name' => '洛阳银行',
                    'en_name' => 'BANK OF LUOYANG',
                    'start_year' => '1997',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            97 =>
                array(
                    'id' => '97',
                    'bank_name' => '绵阳市商业银行',
                    'en_name' => 'MIANYANG CITY COMMERCIAL BANK',
                    'start_year' => '2000',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            98 =>
                array(
                    'id' => '98',
                    'bank_name' => '四川天府银行',
                    'en_name' => 'SICHUAN TIANFU BANK',
                    'start_year' => '2001',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            99 =>
                array(
                    'id' => '99',
                    'bank_name' => '南京银行',
                    'en_name' => 'BANK OF NANJING',
                    'start_year' => '1996',
                    'swift_code' => 'NJCBCNBN',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/5b7ea42d5412bcc07e5a5dc749d620ee.png',
                ),
            100 =>
                array(
                    'id' => '100',
                    'bank_name' => '内蒙古银行',
                    'en_name' => 'BANK OF INNER MONGOLIA',
                    'start_year' => '1999',
                    'swift_code' => 'HSSYCNBH',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/643810cb9f3ff322587800738f54c5c4.png',
                ),
            101 =>
                array(
                    'id' => '101',
                    'bank_name' => '宁波东海银行',
                    'en_name' => 'NINGBO DONGHAI BANK',
                    'start_year' => '2012',
                    'swift_code' => 'DHBCCN2N',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/06a3a694c3837ada0620df368a54d534.png',
                ),
            102 =>
                array(
                    'id' => '102',
                    'bank_name' => '宁波通商银行',
                    'en_name' => 'NINGBO COMMERCE BANK',
                    'start_year' => '2012',
                    'swift_code' => 'BINHCN2N',
                    'color' => '#FF3BC8CE',
                    'bank_image' => 'bank-icon/403305587adfa78e257e68ee5048871e.png',
                ),
            103 =>
                array(
                    'id' => '103',
                    'bank_name' => '宁波银行',
                    'en_name' => 'BANK OF NINGBO',
                    'start_year' => '1997',
                    'swift_code' => 'BKNBCN2N',
                    'color' => '#FFFFB241',
                    'bank_image' => 'bank-icon/1950279388d39ff1ceed7a95b855c556.png',
                ),
            104 =>
                array(
                    'id' => '104',
                    'bank_name' => '宁夏银行',
                    'en_name' => 'BANK OF NINGXIA',
                    'start_year' => '2010',
                    'swift_code' => 'YCCBCNBY',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/bd8f05c06a874994666b3001688fbba1.png',
                ),
            105 =>
                array(
                    'id' => '105',
                    'bank_name' => '攀枝花市商业银行',
                    'en_name' => 'PANZHIHUA CITY COMMERCIAL BANK',
                    'start_year' => '1997',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            106 =>
                array(
                    'id' => '106',
                    'bank_name' => '盘锦银行',
                    'en_name' => 'BANK OF PANJIN',
                    'start_year' => '2005',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            107 =>
                array(
                    'id' => '107',
                    'bank_name' => '平顶山银行',
                    'en_name' => 'BANK OF PINGDINGSHAN',
                    'start_year' => '2008',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            108 =>
                array(
                    'id' => '108',
                    'bank_name' => '齐鲁银行',
                    'en_name' => 'QILU BANK',
                    'start_year' => '1996',
                    'swift_code' => 'JNSHCNBN',
                    'color' => '#FF2E73DC',
                    'bank_image' => 'bank-icon/9fe8a049d050e4db6c53fb15ccf50023.png',
                ),
            109 =>
                array(
                    'id' => '109',
                    'bank_name' => '齐商银行',
                    'en_name' => 'QISHANG BANK',
                    'start_year' => '1997',
                    'swift_code' => 'ZBBKCNBZ',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/97c9b0ceeb17655be0b0415f64307839.png',
                ),
            110 =>
                array(
                    'id' => '110',
                    'bank_name' => '秦皇岛银行',
                    'en_name' => 'BANK OF QINHUANGDAO',
                    'start_year' => '1998',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            111 =>
                array(
                    'id' => '111',
                    'bank_name' => '青岛银行',
                    'en_name' => 'BANK OF QINGDAO',
                    'start_year' => '2007',
                    'swift_code' => 'QCCBCNBQ',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/8fbb58a0b7501d5478f2b63c1db7efcb.png',
                ),
            112 =>
                array(
                    'id' => '112',
                    'bank_name' => '青海银行',
                    'en_name' => 'BANK OF QINGHAI',
                    'start_year' => '1997',
                    'swift_code' => 'BOXNCNBL',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/51f927a017358a2709166e98e2bedf3a.png',
                ),
            113 =>
                array(
                    'id' => '113',
                    'bank_name' => '曲靖市商业银行',
                    'en_name' => 'QUJING CITY COMMERCIAL BANK',
                    'start_year' => '2006',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            114 =>
                array(
                    'id' => '114',
                    'bank_name' => '泉州银行',
                    'en_name' => 'BANK OF QUANZHOU',
                    'start_year' => '1997',
                    'swift_code' => 'BKQZCNBZ',
                    'color' => '#FF2E73DC',
                    'bank_image' => 'bank-icon/7dad0cbad4a93735312455b4a2f623fa.png',
                ),
            115 =>
                array(
                    'id' => '115',
                    'bank_name' => '日照银行',
                    'en_name' => 'BANK OF RIZHAO',
                    'start_year' => '2000',
                    'swift_code' => 'RZCBCNBD',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/eee1881cf5b9482694ae58cd686e9cf7.png',
                ),
            116 =>
                array(
                    'id' => '116',
                    'bank_name' => '上海银行',
                    'en_name' => 'BANK OF SHANGHAI',
                    'start_year' => '1995',
                    'swift_code' => 'BOSHCNSH',
                    'color' => '#FF154B80',
                    'bank_image' => 'bank-icon/540b1718324db16829ce75bb17ef4228.png',
                ),
            117 =>
                array(
                    'id' => '117',
                    'bank_name' => '上饶银行',
                    'en_name' => 'BANK OF SHANGRAO',
                    'start_year' => '2007',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            118 =>
                array(
                    'id' => '118',
                    'bank_name' => '绍兴银行',
                    'en_name' => 'BANK OF SHAOXING',
                    'start_year' => '1997',
                    'swift_code' => 'SXCBCN2X',
                    'color' => '#FF154B80',
                    'bank_image' => 'bank-icon/c348934c49bbcedddff8610375dca11b.png',
                ),
            119 =>
                array(
                    'id' => '119',
                    'bank_name' => '盛京银行',
                    'en_name' => 'SHENGJING BANK',
                    'start_year' => '1997',
                    'swift_code' => 'SYCBCNBY',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/520133698c532728f50a1bef845fdcb3.png',
                ),
            120 =>
                array(
                    'id' => '120',
                    'bank_name' => '石嘴山银行',
                    'en_name' => 'BANK OF SHIZUISHAN',
                    'start_year' => '2009',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            121 =>
                array(
                    'id' => '121',
                    'bank_name' => '苏州银行',
                    'en_name' => 'BANK OF SUZHOU',
                    'start_year' => '2004',
                    'swift_code' => 'DWRBCNSU',
                    'color' => '#FF58BE69',
                    'bank_image' => 'bank-icon/f82349db4aaa65d94db55df05c797dfd.png',
                ),
            122 =>
                array(
                    'id' => '122',
                    'bank_name' => '遂宁银行',
                    'en_name' => 'SUINING BANK',
                    'start_year' => '2008',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            123 =>
                array(
                    'id' => '123',
                    'bank_name' => '台州银行',
                    'en_name' => 'BANK OF TAIZHOU',
                    'start_year' => '2002',
                    'swift_code' => 'TZBKCNBT',
                    'color' => '#FF3BC8CE',
                    'bank_image' => 'bank-icon/bbb5974a0fcb8b891ac9dd23ce2901b0.png',
                ),
            124 =>
                array(
                    'id' => '124',
                    'bank_name' => '泰安银行',
                    'en_name' => 'TAIAN OF BANK',
                    'start_year' => '2007',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            125 =>
                array(
                    'id' => '125',
                    'bank_name' => '唐山银行',
                    'en_name' => 'TANGSHAN OFL BANK',
                    'start_year' => '1998',
                    'swift_code' => 'BOTSCNBJ',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/1a12cfda81340c21c818957af2049fd3.png',
                ),
            126 =>
                array(
                    'id' => '126',
                    'bank_name' => '天津银行',
                    'en_name' => 'BANK OF TIANJIN',
                    'start_year' => '1996',
                    'swift_code' => 'TCCBCNBT',
                    'color' => '#FF2E73DC',
                    'bank_image' => 'bank-icon/55569166d7d71f591c366ef421f39575.png',
                ),
            127 =>
                array(
                    'id' => '127',
                    'bank_name' => '铁岭银行',
                    'en_name' => 'BANK OF TIELING',
                    'start_year' => '2007',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            128 =>
                array(
                    'id' => '128',
                    'bank_name' => '威海市商业银行',
                    'en_name' => 'WEIHAI CITY COMMERCIAL BANK',
                    'start_year' => '1997',
                    'swift_code' => 'WHBKCNBJ',
                    'color' => '#FF2E73DC',
                    'bank_image' => 'bank-icon/e07a547167731a09c1a1d818220ec742.png',
                ),
            129 =>
                array(
                    'id' => '129',
                    'bank_name' => '潍坊银行',
                    'en_name' => 'BANK OF WEIFANG',
                    'start_year' => '1997',
                    'swift_code' => 'WFCBCNBN',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/0b7bca4d88dcdb162c070327206d7663.png',
                ),
            130 =>
                array(
                    'id' => '130',
                    'bank_name' => '温州银行',
                    'en_name' => 'BANK OF WENZHOU',
                    'start_year' => '1998',
                    'swift_code' => 'WZCBCNSH',
                    'color' => '#FFFFB241',
                    'bank_image' => 'bank-icon/74d1c8e293f551da326c3f9cfdb5895c.png',
                ),
            131 =>
                array(
                    'id' => '131',
                    'bank_name' => '乌海银行',
                    'en_name' => 'BANK OF WUHAI',
                    'start_year' => '2006',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            132 =>
                array(
                    'id' => '132',
                    'bank_name' => '乌鲁木齐银行',
                    'en_name' => 'URUMQI OF BANK',
                    'start_year' => '1997',
                    'swift_code' => 'UCCBCNBJ',
                    'color' => '#FF2E73DC',
                    'bank_image' => 'bank-icon/84dbd924d167eef5883877279399b202.png',
                ),
            133 =>
                array(
                    'id' => '133',
                    'bank_name' => '西安银行',
                    'en_name' => 'BANK OF XIAN',
                    'start_year' => '1997',
                    'swift_code' => 'IXABCNBX',
                    'color' => '#FF154B80',
                    'bank_image' => 'bank-icon/330e578a4ac388e74839497d088eb33f.png',
                ),
            134 =>
                array(
                    'id' => '134',
                    'bank_name' => '西藏银行',
                    'en_name' => 'BANK OF TIBET',
                    'start_year' => '2011',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            135 =>
                array(
                    'id' => '135',
                    'bank_name' => '厦门国际银行',
                    'en_name' => 'XIAMEN INTERNATIONAL BANK',
                    'start_year' => '1985',
                    'swift_code' => 'IBXHCNBA',
                    'color' => '#FF2E73DC',
                    'bank_image' => 'bank-icon/78a356cfabc744b51a4c2832e30f1ef5.png',
                ),
            136 =>
                array(
                    'id' => '136',
                    'bank_name' => '厦门银行',
                    'en_name' => 'XIAMEN BANK',
                    'start_year' => '1996',
                    'swift_code' => 'CBXMCNBA',
                    'color' => '#FF2E73DC',
                    'bank_image' => 'bank-icon/e0e7ca6254cde3dec8ab0a77783b2501.png',
                ),
            137 =>
                array(
                    'id' => '137',
                    'bank_name' => '新疆汇和银行',
                    'en_name' => 'XINJIANG HUIHE BANK',
                    'start_year' => '2009',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            138 =>
                array(
                    'id' => '138',
                    'bank_name' => '邢台银行',
                    'en_name' => 'BANK OF XINGTAI',
                    'start_year' => '2007',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            139 =>
                array(
                    'id' => '139',
                    'bank_name' => '雅安市商业银行',
                    'en_name' => 'YAAN CITY COMMERCIAL BANK',
                    'start_year' => '2008',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            140 =>
                array(
                    'id' => '140',
                    'bank_name' => '烟台银行',
                    'en_name' => 'YANTAI BANK',
                    'start_year' => '1997',
                    'swift_code' => 'YTCBCNSD',
                    'color' => '#FF58BE69',
                    'bank_image' => 'bank-icon/a0d4e3ef6aa8882c61ae61e9ca84eb3f.png',
                ),
            141 =>
                array(
                    'id' => '141',
                    'bank_name' => '阳泉市商业银行',
                    'en_name' => 'YANGQUAN CITY COMMERCIAL BANK',
                    'start_year' => '2007',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            142 =>
                array(
                    'id' => '142',
                    'bank_name' => '宜宾市商业银行',
                    'en_name' => 'YIBIN CITY COMMERCIAL BANK',
                    'start_year' => '2006',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            143 =>
                array(
                    'id' => '143',
                    'bank_name' => '营口沿海银行',
                    'en_name' => 'YINGKOU COASTAL BANK',
                    'start_year' => '2010',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            144 =>
                array(
                    'id' => '144',
                    'bank_name' => '营口银行',
                    'en_name' => 'BANK OF YINGKOU',
                    'start_year' => '1997',
                    'swift_code' => 'YKCBCNBJ',
                    'color' => '#FF2E73DC',
                    'bank_image' => 'bank-icon/7ae375e595139af44b341fdecd1db9be.png',
                ),
            145 =>
                array(
                    'id' => '145',
                    'bank_name' => '云南红塔银行',
                    'en_name' => 'YUNNAN HONGTA OF BANK',
                    'start_year' => '2006',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            146 =>
                array(
                    'id' => '146',
                    'bank_name' => '枣庄银行',
                    'en_name' => 'ZAOZHUANG BANK',
                    'start_year' => '2007',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            147 =>
                array(
                    'id' => '147',
                    'bank_name' => '张家口银行',
                    'en_name' => 'ZHANGJIAKOU OF BANK',
                    'start_year' => '2003',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            148 =>
                array(
                    'id' => '148',
                    'bank_name' => '浙江稠州商业银行',
                    'en_name' => 'ZHEJIANG CHOUZHOU COMMERCIAL BANK',
                    'start_year' => '2006',
                    'swift_code' => 'CZCBCN2X',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/b1bebf44b7981c956017280f6504ab29.png',
                ),
            149 =>
                array(
                    'id' => '149',
                    'bank_name' => '浙江民泰商业银行',
                    'en_name' => 'ZHEJIANG MINTAI COMMERCIAL BANK',
                    'start_year' => '2006',
                    'swift_code' => 'ZJMTCNSH',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/0d386cd06f3b4e4f614a513ae4000f99.png',
                ),
            150 =>
                array(
                    'id' => '150',
                    'bank_name' => '浙江泰隆商业银行',
                    'en_name' => 'ZHEJIANG TAILONG COMMERCIAL BANK',
                    'start_year' => '2006',
                    'swift_code' => 'ZJTLCNBH',
                    'color' => '#FFFFB241',
                    'bank_image' => 'bank-icon/b31ba374532d4303e0d1f94cfce97f9d.png',
                ),
            151 =>
                array(
                    'id' => '151',
                    'bank_name' => '郑州银行',
                    'en_name' => 'BANK OF ZHENGZHOU',
                    'start_year' => '2009',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            152 =>
                array(
                    'id' => '152',
                    'bank_name' => '珠海华润银行',
                    'en_name' => 'CHINA RESOURCES BANK OF ZHUHAI',
                    'start_year' => '1996',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            153 =>
                array(
                    'id' => '153',
                    'bank_name' => '自贡银行',
                    'en_name' => 'ZIGONG OF BANK',
                    'start_year' => '2001',
                    'swift_code' => '',
                    'color' => '',
                    'bank_image' => '',
                ),
            154 =>
                array(
                    'id' => '154',
                    'bank_name' => '花旗银行',
                    'en_name' => 'Citibank',
                    'start_year' => '1812',
                    'swift_code' => 'CITICNSXBJG',
                    'color' => '#FF154B80',
                    'bank_image' => 'bank-icon/0bf1b0d6d9aa5ef0fd9b35e9e6985a9c.png',
                ),
            155 =>
                array(
                    'id' => '155',
                    'bank_name' => '渣打银行',
                    'en_name' => 'Standard Chartered Bank',
                    'start_year' => '1853',
                    'swift_code' => 'SCBLCNSX',
                    'color' => '#FF3BC8CE',
                    'bank_image' => 'bank-icon/80bf803abc7dc80f387f71e3acb27cf0.png',
                ),
            156 =>
                array(
                    'id' => '156',
                    'bank_name' => '汇丰银行',
                    'en_name' => 'The Hongkong and Shanghai Banking Corporation Limited',
                    'start_year' => '1865',
                    'swift_code' => 'HSBCHKHHHKH',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/61798096834a2f9c89e85280eff31e1d.png',
                ),
            157 =>
                array(
                    'id' => '157',
                    'bank_name' => '东亚银行',
                    'en_name' => 'The Bank of East Asia',
                    'start_year' => '1918',
                    'swift_code' => 'BEASCNSHCCC',
                    'color' => '#FFF75959',
                    'bank_image' => 'bank-icon/50be9eb301a69ea6da55a1c5ef12dade.png',
                ),
        )
);